// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.16.63
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|2005|北欧|战斗|幸村誠|热血",
  30211: "漫画|后宫|浜田よしかづ|卖肉|战斗|热血|怪怪守护神|格斗|肉|搞笑|鬼神",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  57532: "漫画|大暮维人|舞城王太郎|恋爱|绮丽|大暮維人|卖肉|非主流|伪科幻|深渊融接|集英社",
  105074: "Navel|Galgame|伪娘|女装|西又葵|鈴平ひろ|月に寄りそう乙女の作法|GAL|2014|大小姐|PC",
  115389: "漫画|山本崇一朗|日常|妹控|治愈|已完结|小学馆|萝莉|札月家的杏子妹妹|轻松|漫画系列",
  140092: "PSV|digimon|繁体中文版|RPG|数码宝贝|NS|数码宝贝世界|数码暴龙|2016|情怀|BNEI",
  201980: "漫画|异世界|转生|丸山朝ヲ|奇幻|猫娘|2016|养女儿|轻小说改|棚架ユウ|萌",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|週刊少年チャンピオン|2017|日常|热血|日本",
  234273: "少女漫画|漫画|恋爱|校园|森野萌|少女漫|狗粮|2017|少女|花野井君和相思病|漫画系列",
  234489: "异世界|漫画|轻改|轻小说改|2017|穿越|小说改|九我山レキ|转生|漫画系列|战斗",
  244401: "小说改|漫画|异世界|基|战斗|狗血|轻小说改|魔物娘|已完结",
  247392: "漫画|异世界|小说改|轻小说改|轻改|漫画系列|转生|连载中|蘭々|正太|系列",
  279877: "漫画|搞笑|美食|奇幻|春原ロビンソン|集英社|ひらけい|喜剧|沙雕|2019|少年JUMP+",
  284311: "小说改",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|原创|漫画系列",
  301226: "漫画|搞笑|糸吉了一|漫画系列|2019|ニコニコ静画|父女|KADOKAWA|治愈|已完结",
  305730: "漫画|搞笑|丹念に発酵|异世界|漫画系列|コミックウォーカー|2019|奇幻|日漫|日本|系列",
  311891: "漫画|恋爱|短篇|校园|青春|JUMP|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  325236: "漫画|搞笑|篠原健太|奇幻|集英社|2021|週刊少年ジャンプ|周刊少年JUMP|校园|超自然日常|日本",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  335248: "轻小说|恋爱|校园|狗粮|大小姐|未完结小说|小说系列|2021年|小说|校園|桃文",
  336828: "漫画|武田綾乃|むっしゅ|校园|百合|2021|青春|集英社|系列|原创|日本",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|小说系列|KADOKAWA",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  349274: "漫画|小说改|异世界|穿越|奇幻|轻小说改|プレジ和尚|漫画系列|ぶんころり|轻改|日常",
  349842: "小说改|漫画系列|漫画|日本|异世界|奇幻|系列|连载中|2021.",
  355057: "小说改|奇幻|少女漫画|講談社|漫画|系列|少女漫|水辺チカ|2021|连载中|漫画系列",
  367794: "漫画|校园|平本彰|互换身体|平本アキラ|工口|纯爱|奇幻|系列|套路|2022",
  372605: "轻小说|小说系列|奇幻|连载中|日本|原创|小说|web文|2021|佐賀崎しげる|ショウセツ",
  375683: "漫画系列",
  376861: "漫画系列|异世界|一般偏无聊",
  387554: "轻小说|大森藤ノ|小说系列|2022|已完结|全3卷",
  389483: "漫画|异世界|厕纸|漫画系列|画工还行",
  407624: "漫画|恋爱|倒贴|末世|馬かのこ|KADOKAWA|月刊ドラゴンエイジ|漫画系列|御姐|一般向|2022",
  409684: "漫画|音乐|摇滚|百合|校园|乐队|热血|日本|数摇|原创|连载中",
  420844: "轻小说",
  424889: "GAGAGA大赏",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  436747: "漫画|芳文社|日常|外传|2023|音乐|搞笑|Kirara|日本|日漫|くみちょう",
  498299: "轻小说|恋爱|塩本",
  506640: "漫画",
  525894: "轻小说|六海刻羽",
  552663: "Galgame|PC|游戏|ADV|NS"
};
