// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.10.68
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  9640: "三浦健太郎|漫画|奇幻|剑风传奇|万年深坑|神级|血腥|暴力|灰暗系|硬汉|复仇",
  31731: "漫画|启蒙|教育|夫妻成长日记|克・亜樹|爱情|白泉社|1997|工口|漫画系列|成年コミック",
  94928: "少女漫画|漫画|春田なな|校园|恋爱|少女|少女漫|春田菜菜|日漫|少女マンガ|男二控",
  100130: "短篇集|漫画|少女漫画",
  243198: "美食|竞技",
  245922: "悬疑|漫画|推理|伊藤翔太|犯罪|复仇|2018|講談社|黑暗|井龍一|已完结",
  259816: "漫画|棒球|运动|少年JUMP+|竞技|みかわ絵子|2018|热血|集英社|体育漫画|搞笑",
  277134: "漫画|恐怖|猎奇|战斗|萝莉|近藤憲一|病娇|2019|惊悚|灵异|集英社",
  301622: "轻小说|小说系列|已完结|全2卷|少女|双葉社|恋爱药|魔女",
  304176: "韩漫|韩国|漫画|穿越|恋爱|校园|女性向|小说改|逆后宫|条漫|三角恋",
  304324: "漫画|悬疑|日本|系列|黑暗|校园|纸质书|漫画系列|已完结",
  315918: "轻小说|小说系列|转生|ハム男|异世界",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|智斗|活下去|反乌托邦|青年",
  320995: "连载中|日本|漫画|系列|原创|职场&赌博|赌博|漫画系列|想象力|2026-03|智斗",
  324366: "漫画|小说改|恶役千金|2020|女性向|百合|日本|宫廷|连载中|女性主人公|少女漫画",
  326699: "小说改|漫画系列",
  326724: "恋爱|漫画|校园|喜剧|搞笑|原创|久世蘭|逆推|2021|杀必死|连载中",
  330004: "韩漫|韩国|转生|BG|小说改|漫画|恋爱|女性向|条漫|萌系|欧风",
  332916: "漫画|喜欢|搞笑|2021",
  342547: "漫画|轻改|转生|小说改|轻小说改|异世界|凤傲天|漫画系列|少女|奇幻|女仆",
  346060: "漫画|奇幻|2021|江野スミ|江野朱美|神鬼|猎奇|战斗|怪异|漫画系列|系列",
  349842: "小说改|漫画|漫画系列|2026-02|2021.|连载中|古典欧风|系列|轻小说改|一般向|异世界",
  353207: "漫画|漫画系列|已完结|日本|经济|奇幻|智斗|战斗|6卷|奴隶|系列",
  355148: "小说改|2021|柊一葉|轻小说改|じろあるば|漫画系列|小学館|主仆|忠犬男|异世界|日漫",
  362541: "轻小说|奇幻|战斗|电击文库|小说系列|2021|電撃文庫|ロケット商会|异世界|热血|连载中",
  364863: "恋爱|漫画|校园|日常|小说改|2022|佐伯さん|芝田わん|漫画系列|轻小说改|邻家天使漫画",
  368830: "漫画|漫画系列|小学館|2022",
  388268: "漫画|カツヲ|战斗|末世|丧尸|生存|2022|漫画系列|短篇|治愈|日常",
  392778: "漫画系列",
  417220: "恋爱|漫画|小学館|2023|少女漫画|原创|连载中|已完结|系列|日漫BG|古代",
  419991: "画集|已购|原创",
  432940: "漫画|刀剑神域|川原砾|种田|小说改|奇幻|男主|世界融合|8|日本|开荒",
  433315: "漫画|日漫|萌系|古典欧风|幼女·萝莉|日本|小说改|女主|欧风",
  437954: "漫画|百合|こるせ|科幻|冒险|轻百合|女性主人公|姐妹|战斗|热血|日漫",
  445870: "轻小说|误解系|搞笑|异世界|后宫|日本|小说|系列|急川回レ",
  447990: "漫画|奇幻|集英社|搞笑|校园|2023|日本|少年|抓鬼|男子高中生日常|一般向",
  460712: "画集|mignon|R18|已购|2023|双葉社|成年コミック",
  460819: "漫画|日常|青年|生活|意识流|上班族|思考|2023|鍋倉夫|职场|小学馆",
  464364: "漫画|短篇|恋爱|マンガ|漫画系列|連載中",
  465682: "小说改|漫画|兄妹|日本|宅系|一般向|妹系|系列|连载中",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  485030: "小说|轻小说|青年|异世界|贞操逆转",
  492066: "",
  505445: "小说",
  505901: "漫画|恋爱|日本|校园|原创|已完结|系列",
  506840: "漫画|恋爱|校园|搞笑|青春|日本|原创|2024|女主画的超好看|週刊少年サンデー|连载中",
  511739: "漫画|小说改|漫画系列|系列|白泉社|日本|未完结|已弃|连载中|2026-01|2024",
  524513: "轻小说|恋爱|扭曲|性爱分离|青梅竹马|雲雀湯|校园|约炮|青春|日常|R18",
  530731: "漫画|日本|奈叶|系列|都築真紀|连载中|川上修一|2025|百合|魔炮",
  535916: "日本|小说|轻小说|てるゆーぬ",
  542030: "轻小说|2024|へいろー|カボチャマスク|奇幻|战斗|恋爱|异世界|web文",
  556816: "轻小说|电击文库|2025|星野星野|校园|恋爱|后宫",
  562638: "轻小说|百合|扭曲|恋爱|2025|校园|日本|电击文库|小说|出轨|Akeo",
  573423: "轻小说|葵关南|恋爱喜剧|深崎暮人|恋爱|日本|小说|青春|2025|误解系|系列",
  574043: "短篇集|かわじろう|漫画",
  631540: ""
};
