// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.26.43
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  15841: "Nitro+|虚渊玄|Galgame|虚淵玄|PC|致陏|phantom|神作|AVG|Nitroplus|硬派",
  19597: "伪娘|漫画|神吉|女装少年|2011|わぁい!|一迅社|瑞穂|恋爱|コミックス|成年コミック",
  38807: "漫画|岩明均|历史|战争|2003|古希腊|青年漫画|坑|军事|传记|講談社",
  40064: "安达充|漫画|棒球|月刊少年SUNDAY|2012|校园|运动|あだち充|恋爱|小学馆|日本漫画",
  48094: "漫画|千叶彻弥|热血|拳击|明日之丈|周刊少年magazine|1968|体育|竞技|运动|讲谈社",
  72689: "1986|寺沢大介|漫画|週刊少年マガジン|料理|美食|日本漫画|竞技|美食漫画",
  131504: "漫画|后宫|战斗|恋爱|神崎かるな|校园|2014|漫画系列|已完结|黒神遊夜|推荐格斗",
  134910: "沙村広明|漫画|职场|搞笑|广播|講談社|2014|月刊アフタヌーン|沙村广明|漫画大赏2016|连载中",
  138986: "恋爱|漫画|小说改|田口一|もっつん|全5卷|已完结|2011|后宫|福利|短篇",
  159865: "漫画|萝莉|穿越|异世界|轻改|后宫|奇幻|网游|2014|漫画系列|KADOKAWA",
  172279: "漫画|漫画系列",
  180932: "漫画|搞笑|轻小说改|番外|漫画系列|完结|惠惠|日常|素晴|小说改|日本",
  211665: "漫画|异世界|穿越|轻改|骸骨骑士|奇幻|漫画系列|龙傲天|骨王小号|战斗|轻小说",
  227220: "漫画|成田良悟|奇幻|反穿|群像剧|超能力|藤本新太|战斗|2017|异世界|漫画系列",
  227347: "連打一人|茶道|漫画|ジャンプ改|全4卷|吾为利休",
  235397: "百合|芳文社|漫画|日常|四格|科普|2017|まんがタイムKRコミックス|漫画系列|Quro|Kirara",
  236624: "漫画|轻改|异世界|战斗|轻小说改|奇幻|2018|ありかん|小说改|B漫",
  239656: "异世界|小说改|漫画系列|奇幻|人外|后宫|人外娘|母猩猩",
  242972: "漫画|恋爱|轻改|异世界|魔法|狗粮|小说改|轻小说改|冒险|2018|奇幻",
  247798: "漫画|异世界|小说改|抽卡|轻改|穿越|晴野しゅー|后宫|2018|コミックライド|轻小说改",
  252452: "漫画|宮永麻也|可爱|奇幻|已完结|日本|旅行|治愈|原创|公路|公路片",
  286140: "漫画|悬疑|乃木坂太郎|犯罪|颜艺|恋爱|小学館|2019|漫画系列|现代|已完结",
  292706: "异世界|漫画|小说改|战斗|漫画系列",
  293664: "漫画|恋爱|轻改|小说改|2019|校园|二丸修一|井冬良|KADOKAWA|后宫|轻小说",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  307237: "漫画|运动|体育|滑冰|热血|竞技|励志|つるまいかだ|日本|2020|原创",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|科幻|少年向|連載中",
  322890: "漫画|搞笑|战斗|脑洞|2020|桜谷シュウ|猎奇|日本漫画|漫画系列|コミプレ",
  328640: "漫画|国产|网文改|中国",
  328644: "中国",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  338544: "漫画|搞笑|杀手|南勝久|2021|战斗|日常|黑道|青年漫画|犯罪|扮猪吃老虎",
  342106: "漫画|板垣巴留|2021|連載中|搞笑|漫画系列|热血|秋田書店|マンガ|画风",
  352114: "恋爱|漫画|吸血鬼|狗粮|2020|校园|奇幻|套路|已完结|2021年|正太",
  357433: "轻小说|小说系列|2021|立川浦々|立川浦",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|漫画系列|校园|講談社|日本|原创|nonco",
  397619: "漫画|异世界|B漫|漫画系列|欢乐|龙傲天|2022|冬月光輝|た介|comicブースト",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  406468: "漫画|搞笑|恋爱|2022|战斗|集英社|千葉侑生|连载中|杀手|漫画系列",
  426302: "百合|漫画|2023|完结|漫画系列|恋爱|20话以内|图书|百合漫画|コミックス|4.5分",
  433727: "漫画|格斗|热血|百合|2023|MAAM|卖肉|原创|サンドロビッチ・ヤバ子|小学馆|神展开",
  486509: "",
  492138: "轻小说|百合|2024|SF|奇幻|童话|公路文|轻百合|小说|电击文库|小说系列",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  515936: "漫画|国漫|中国漫画",
  551639: "Galgame|百合|全年龄|和风传奇"
};
