// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.06.27.46
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6675: "稲荷家房之介|BL|平安时代|这次又是哈佐|阴阳师|BLコミック",
  25950: "皆川亮二|漫画|漫画系列|科幻|青年漫画|战斗|日本漫画|奇幻|系列|小学館",
  32750: "安达充|漫画|拳击|青春|2001|恋爱|体育|あだち充|爱情|少年漫画",
  48058: "漫画|美食|长友健筛|王牌酒保|单元剧|调酒师|城安良嬉|清新|2004|已完结|長友健篩",
  49974: "漫画|西森博之|小学館|校园|1988|不良少年|完结|日本漫画|少年漫画|已完结|漫画系列",
  64273: "光永康則|漫画|漫画系列|已完结|全20卷|吸血鬼|后宫？|怪物|公主|搜索用",
  69649: "漫画|春河35|朝霧カフカ|文豪Stray-dogs|2012|热血|格斗|战斗|少年漫|文豪超能力|文豪野犬",
  77532: "恋爱|漫画|剧情",
  89244: "漫画系列|科幻|鈴木みそ|日常|职场|科普|已完结",
  96134: "漫画|恋爱|搞笑|日常|校园|いみぎむる|吐槽|2012|電撃マオウ|角川書店|少女向",
  98253: "漫画|后宫|恋爱|异世界|めいびい|卖肉|指环王|奇幻|已完结|穿越|2014",
  111083: "奥浩哉|漫画|科幻|机器人|青年漫画|人性|战斗|讲谈社|SF|2017|重口",
  121380: "漫画|搞笑|冒险|卖肉|变态|战斗|スバルイチ|奇幻|智障|勇者死了|欢乐向",
  132555: "漫画|Type-Moon|Fate|游戏改|間桐桜|战斗|奇幻|2015|漫画系列|タスクオーナ|动画推销成功",
  136607: "漫画|小野夏芽|已完结|政治|推理漫画|2013|悬疑|オノ・ナツメ|公款旅游|短篇|百合",
  170868: "漫画|美食|Type-Moon|Fate|TAa|WEB漫画|日常|KADOKAWA|2016|只野まこと|漫画系列",
  170869: "漫画|文豪野犬|漫画系列|Q版|王道|WEB漫画|朝霧カフカ|春河35|战斗|热血|萌物",
  199446: "漫画|穿越|小说改|2017|药傲天|异世界|轻小说改|KADOKAWA|連載中|高野聖|漫画系列",
  211379: "漫画|国漫|台湾|国产|少年漫画|中国|周显宗|周顯宗|台漫",
  211410: "漫画|周显宗|国漫|中国|台漫|周顯宗",
  213068: "漫画系列|Fate|fgo|漫画",
  228579: "漫画|恋爱|井上小春|甜|奇幻|爱情|狗粮|恋爱漫画|2017|主僕|已完结",
  229031: "漫画|晴智|战斗|奇幻|集英社|魔幻|剧情|少年漫|原创|已完结|系列",
  270585: "多人本",
  274629: "BL|漫画|春園ショウ|BL漫画|漫画系列|校园|恋爱|日漫|2019|春园ショウ|KADOKAWA",
  275445: "漫画|推理|田村由美|小学館|月刊flowers|2017|连载中|思考|一般向漫画|日本漫画|青年",
  277301: "BL|漫画|BL漫画|白桃ノリコ|BLコミック",
  278297: "漫画|BL|BLコミック",
  296466: "漫画|后宫|搞笑|恋爱|校园|集英社|沙雕|野澤ゆき子|2019|中村力斗|日本",
  297926: "战斗|奥浩哉|集英社|連載中|漫画系列|花月仁|漫画|热血|冒险|惊悚|奇幻",
  300723: "人外|BLコミック|花嫁|子育て・子連れ",
  306272: "漫画|2020|奇幻|NAOE|战斗|BLコミック|漫画系列|耽美|一般向|BL",
  308450: "BLコミック",
  314224: "BLコミック",
  322530: "搞笑|漫画|反差萌|温馨|一迅社|2020|おつじ|漫画系列|一般向|亲情|连载化",
  337417: "伪娘|漫画|虚拟主播|vtuber|萝莉|正太|漫画系列|萌|已完结|2021|纸质书",
  342547: "漫画|轻改|转生|小说改|2021|少女|漫画系列|轻小说改|异世界|凤傲天|奇幻",
  385554: "",
  391396: "漫画系列|都市|科幻|R18|悬疑|透明|战斗|异能|漫画|猎奇|黑道",
  395179: "漫画|BL|日漫|緒崎カホ|漫画系列|2025-08",
  396405: "漫画|大正浪漫|群像|漫画系列|电波|生活|饴石|文艺",
  398073: "漫画|小说改|黑柿子|治愈|恋爱|武富智|黑暗|致郁|系列|漫画系列|日本",
  401119: "漫画|搞笑|后宫|2022|校园|奇幻|恋爱|赤城あさひと|日常|講談社|漫画系列",
  406440: "漫画|2022|艺术|漫画系列|类型:漫画|标签:待改|日本漫画|BL漫画|ぱらり",
  408796: "漫画|魔法|血腥|猎奇|七沢またり|2022|堤りん|黑暗|战斗|历史相关|漫画系列",
  429774: "漫画|7|恶女流|异世界|小说改",
  431105: "漫画|BLコミック",
  434176: "",
  446434: "奇幻|漫画|异世界|RPG|冒险|2023|日常|アッチあい|搞笑|游戏|KADOKAWA",
  456375: "漫画|战斗|轻改|科幻|外传|魔禁|百合|strelka|日本|鎌池和馬",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|日本|奇幻",
  490402: "游戏|STEAM|PC|冒险|美少女",
  497607: "漫画|日本|系列|漫画系列|连载中",
  499056: "漫画|伪娘|已完结|日本|2024|cos|原创|伪百合|7.2|畫功好|酷儿角色",
  503771: "漫画|后宫|日本|漫画系列|奇幻|连载中|已完结|系列|无H|原创|2025-12",
  506124: "恋爱|漫画|校园|日常|爱情|小动物|原创|黑长直|系列|连载中|日本",
  510155: "漫画|週刊少年ジャンプ|西修|集英社|魔法|宇佐崎しろ|2024|奇幻|原创|日本|连载中",
  510299: "漫画|集英社|战斗|日本|2024|原创|JUMP|热血|系列|2026-01|连载中",
  510679: "漫画|日本|连载中|2025-12|原创|系列",
  517268: "",
  520945: "漫画|已完结",
  528466: "漫画|BL",
  587237: "国产|悬疑|Galgame|民俗|AVG|全年龄|PC|游戏|Windows"
};
