// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.03.95
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1125: "KID|infinity|打越刚太郎|Galgame|Never7|悬疑|AVG|中泽工|PC|轮回开山作|PSP",
  1410: "Nitro+|5pb|Galgame|猎奇|悬疑|混沌头|死宅的妄想力可是很强大的|林直孝|PC|N+|5pb.",
  3582: "漫画|科学超电磁炮|冬川基|鎌池和馬|百合|科幻|超能力系|月刊Comic电击大王|魔法|某科学的超电磁炮|2007",
  15841: "Nitro+|虚渊玄|Galgame|虚淵玄|PC|致陏|phantom|神作|AVG|Nitroplus|硬派",
  25338: "漫画|搞笑|森繁拓真|无口少年|高玩帝|上课小动作|日本|请结婚吧|日常|无对话",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  57143: "漫画|恋爱|校园|Tiv|后宫|搞笑|政宗君的复仇|竹岡葉月|竹冈叶月|一迅社|2012",
  99397: "漫画|小说改|轻小说改|日本|一般向|战斗|后宫|系列|轻改漫画|¬|已完结",
  126771: "漫画|芳文社|搞笑|恋爱|漫画系列|美少女|伪娘|四格|中山幸|治愈",
  175554: "漫画|百合|芳文社|日常|搞笑|伊藤いづも|轻百合|街角魔族|2014|欢乐|治愈",
  186635: "OST|Falcom|空之轨迹|游戏|英雄传说|2016",
  189167: "少女漫画|集英社|漫画|槙ようこ|漫画系列|少女漫|校园|りぼん|三角股|少女マンガ|男二控",
  192295: "曽田正人|体育漫画|体育|日本漫画|系列|运动|中篇|1992|曾田正人|竞技",
  193281: "漫画|搞笑|あらゐけいいち|日常|2016|講談社|CITY|已完结|モーニング|漫画系列|連載中",
  229644: "漫画|治愈|亲情|浅野りん|美食|和菓子|2016|恋爱|KADOKAWA|漫画系列|连载中",
  242972: "漫画|恋爱|轻改|异世界|魔法|狗粮|小说改|轻小说改|冒险|2018|奇幻",
  264546: "日常|治愈|漫画|搞笑|猫猫|2018|水曜日のシリウス|四格|WEB|山田ヒツジ|国欠猫",
  272767: "漫画|Type-Moon|2019|Fate|連載中|系列|角川|佐々木少年|fgo|那个女人",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  284160: "漫画|小说改|奇幻|恶役|少女漫|女性主人公|2019|ほおのきソラ|战斗|轻改|轻小说改",
  299584: "漫画|小说改|奇幻|轻小说改|装逼|2019|天海雪乃|异世界|KADOKAWA|战斗|漫画系列",
  300545: "Galgame|分割商法|Steam简中|STEAM|官中|汉化|R18|GAL|纯爱|2020",
  302208: "漫画|Type-Moon|Fate|奇幻|平野稜二|KADOKAWA|战斗|2020|経験値|冲田小姐",
  308570: "漫画|百合|奇幻|双見酔|双葉社|WEB|战斗|漫画系列|原创|webアクション|系列",
  308573: "Galgame|ASa-Project|喜剧|小鳥居夕花|幼驯染|ASaProject|废萌|妹|杏子御津|2020|颜艺社",
  326285: "漫画|战斗|講談社|漫画系列|2021|铃木央|奇幻|少年漫画|系列|原创|日本",
  333572: "漫画|职场|漫画系列",
  336828: "漫画|武田綾乃|むっしゅ|校园|百合|2021|青春|集英社|系列|原创|日本",
  340052: "漫画|异世界|小说改|漫画系列|磐秋ハル|B漫",
  347780: "Galgame|Qruppo|倉骨治人|监狱|PC|搞笑|2022|骨折王子|燃|GAL|R18",
  368813: "漫画|小说改|漫画系列|恶役千金|轻小说改|异世界|丘野優|なろう系|2022|人生やり直し系|鏡",
  377599: "漫画|藤本タツキ|短篇|藤本树|叙述性诡计|2022|反转|悬疑|奇幻|电影|少年JUMP+",
  392773: "漫画|奇幻|一般向|异世界|2022|画风好|轻小说改|漫画系列|全员智商在线|穿越游戏|8",
  393233: "漫画|悬疑|浅見理都|漫画系列|推理|KISS|社会派|系列|2022|已完结|日本",
  394427: "百合|ACT|PC|STEAM|PS4|NS|富田美优|官方中文|万雌王|2022|PS5",
  401227: "NS|PC|2025|游戏|符文工房|JRPG|マーベラス|Switch|种田|符文工廠|其他",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  403637: "漫画|校园|恋爱|肉丸|原创|NTR？|谜|圈乱|贵乱|NTR|婊子",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|推理|日本漫画|連載中",
  446724: "轻小说|rurudo|百合|綾里けいし|轻小说系列|小说系列|原创|白毛|2023",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  453558: "已完结",
  464323: "恋爱|搞笑|校园|漫画|日常|反差|一般向|辣妹|比宮じょーず",
  475241: "轻小说",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  506124: "恋爱|校园|漫画|爱情|日常|日本|系列|连载中|伊藤京介",
  515211: "PC|ARPG|银河恶魔城|PS5|ACT|PS4|单机游戏|游戏|XboxOne|Platform",
  531861: "设定集",
  549199: "画集"
};
