// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.08.28.39
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19326: "漫画|堀田きいち|治愈系|校园|青春|治愈|君と僕。|月刊GFantasy|2003|少年|基",
  22829: "漫画|森薫|女仆|恋爱|英伦风|少女漫画|治愈|2002|森薰|乙女向|月刊コミックビーム",
  29137: "漫画|小山宙哉|励志|梦想|讲谈社|科幻|兄弟|講談社|感人|科幻漫画|2007",
  56289: "后宫|漫画|搞笑|藤代健|月刊少年ガンガン|蓝兰岛|后宫岛|日本|漫画系列|恋爱漫画|未完结漫画",
  69731: "漫画|真鍋昌平|真锅昌平|小学館|漫画系列|青年漫画|2004|系列|时代剧情|已完结",
  78548: "漫画|高橋葉介|短篇集|短篇|魔幻|toku|1992年|奇想|妖怪漫画|已完结|一卷完",
  134488: "Galgame|ensemble|音符社|きみしま青|秋野花|大姐姐|绘豚满足|PC|妹|汉化|废萌",
  138475: "漫画|恋爱|奇幻|あいだいろ|地缚少年花子君|少女漫画|月刊GFantasy|日本|连载中|月刊Gファンタジー|2014",
  138626: "少女漫画|漫画|芦原妃名子|少女|集英社|少女漫|职场|恋爱|漫画系列|已完结|熟女漫",
  148464: "漫画|藤崎竜|集英社|科幻|小说改|田中芳樹|藤崎龙|連載中|系列|银河英雄传说",
  186143: "小说改|漫画系列",
  187081: "漫画|恐怖漫画|猎奇|カトウタカヒロ|黑暗|恐怖|已完结|惊悚|小学馆|2016|日本漫画",
  190421: "漫画|百合|マンガ|猎奇|血腥|漫画系列|2022|2021|2024|菅原キク",
  201980: "漫画|异世界|转生|奇幻|丸山朝ヲ|猫娘|养女儿|2016|棚架ユウ|萌|漫画系列",
  210505: "漫画|搞笑|校园|少年漫|西修|2017|週刊少年チャンピオン|周刊少年Champion|日常|日本|热血",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  234799: "漫画|恋爱|色气|校园|福田晋一|cosplay|辣妹|日常|日本|2018|爱情",
  247484: "合同志|漫画|弱智|选集|实体|一般向|系列|多人本|不到7分|vtuber",
  258814: "漫画|日常|兄弟|2018|治愈|亲情|青春|完评|小学館|漫画系列|日漫",
  259293: "小说改|漫画|漫画系列|角川書店|のの原兎太|溝口ぐる|魔法|异世界|少女漫|奇幻|女性向",
  259816: "漫画|棒球|运动|少年JUMP+|竞技|みかわ絵子|2018|热血|集英社|体育漫画|搞笑",
  267222: "漫画|恐怖|搞笑|泉朝树|百合|2018|泉朝樹|日本漫画|ニコニコ静画|日本|KADOKAWA",
  285272: "漫画|恋爱|伪娘|魔法|桜井亜都|女装|日本|已完结|青文出版社|幼驯染|2019",
  300628: "冒险|奇幻|异世界|漫画|养女儿|小说改|2020|蕗野冬|轻改|转生|轻小说改",
  308570: "漫画|百合|奇幻|双見酔|双葉社|WEB|战斗|漫画系列|原创|webアクション|系列",
  314942: "漫画|搞笑|日常|校园|はれやまはれぞう|日本|治愈|短篇|系列|可爱|漫画系列",
  317072: "治愈|女儿|漫画|漫画系列|已完结|台版完结|全3卷",
  320995: "连载中|日本|漫画|系列|原创|职场&赌博|赌博|漫画系列|想象力|2026-03|智斗",
  321869: "漫画|恋爱|轻改|東鉄神|搞笑|忘年恋|年上|2020|姐弟恋|轻小说改|小说改",
  338544: "漫画|搞笑|杀手|南勝久|2021|战斗|黑道|日常|犯罪|青年漫画|日本",
  349559: "宫廷|中华风|战斗|漫画|日漫|日本|漫画系列|中国风|原创|悬疑|历史",
  355897: "日漫|小说改",
  358500: "小说改|漫画|一般向|日本|漫画系列",
  362486: "恐怖|漫画|猎奇|悬疑|黑暗|的野アンジ|短篇集|小学館|日本|2021|已完结",
  364863: "恋爱|漫画|校园|日常|小说改|2022|佐伯さん|芝田わん|漫画系列|轻小说改|邻家天使漫画",
  365059: "漫画|异世界|卖肉|恋爱|已完结|喜剧|藤島真ノ介|完结1|日本|恋爱喜剧|一般向",
  370029: "漫画|日常|治愈|やませちか|鉴定|原创|宝石|系列|2025-08|日本|漫画系列",
  376260: "漫画|妖怪|搞笑|伪娘|ともつか治臣|奇幻|神鬼|志怪|漫画系列|中篇|日漫",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|日本|原创|校园|講談社|漫画系列|nonco",
  389894: "漫画|校园|青春|搞笑|多箭头|日本|单相思|原创|百合|系列",
  390520: "百合|漫画|2022|KADOKAWA|动画改|漫画系列|都市|コミックフラッパー|枪战",
  392492: "日本|漫画|系列|漫画系列|已完结",
  399434: "漫画|搞笑|游戏改|艾尔登法环|奇幻|2022|飛田ニキイチ|漫画系列|战斗|角川|魂",
  404671: "日本|漫画|漫画系列",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|杀手|连载中|少年JUMPPLUS|日本",
  423465: "漫画|后宫|恋爱|校园|搞笑|2023|マツモトケンゴ|卖肉|欢乐|ニコニコ静画|一般向",
  452937: "漫画|连载中",
  462002: "漫画|漫画系列|惊悚|恐怖|小说改|连载中|碓井ツカサ|背筋",
  466646: "漫画|2024|游戏改|6.6|2025-12|剧情不清楚|男娘|系列|講談社|连载中|姐姐",
  472321: "恋爱|丸戸史明|漫画|青梅竹马|日本|三角恋|校园|よむ|搞笑|原创|2023",
  482741: "漫画|战斗|田中靖規|2024|怪物|集英社|原创|连载中|日本|系列|校园",
  492231: "漫画|日常|镰仓市|百合|貞松龍壱|画风故事人物舒服|漫画系列|轻百合|面包店|8|萌",
  496047: "漫画|漫画系列|2024",
  497895: "漫画|恋爱|轮回|霸凌|校园|日本|拯救|黑暗|悬疑|原创|2024",
  497921: "恋爱|校园|党争|漫画|日本|连载中|原创|2024|集英社|小野玄晖|少年",
  500126: "日漫|乐|8.3|日服第一男枪|@|漫画|日本|连载中|系列|暴力|原创",
  502536: "漫画|奇幻|冒险|战斗|精灵|魔法|美食|治愈|漫画系列|连载中|2026-03",
  510278: "恋爱|漫画|校园|日常|挑逗|日本|恩田ゆじ|系列|连载中",
  510299: "漫画|集英社|战斗|2024|校园|日本|JUMP|原创|热血|分镜还行，剧情一般",
  511646: "漫画|致郁|原创|日本|百合|亜月ねね|2024|连载中|边缘群体|青年|系列",
  513971: "PC|全年龄|紺野アスタ|羊宫妃那|游戏|ゆさの|Galgame|渡辺明夫|短篇|VN|26",
  516783: "校园|漫画|日常|小说改|一般向|日本|黑长直|同居|套路|打胶打出幻觉了|森あいり",
  520019: "漫画|恐怖|日本|原创|连载中|系列|Cura|日漫|悬疑|2025-07",
  521699: "命运石之门|2025|MAGES.|Galgame|ADV|全年龄|科学ADV|游戏|2026|AVG|悬疑",
  541812: "日漫|系列|日本漫画|原创|现代|奇幻|校园|少女漫画|漫画|日本|(๑´ڡ`๑)",
  542875: "百合|漫画|搞笑|2025|ヒロユキ|原创|週刊少年マガジン|连载中|欢乐|系列|日本",
  547603: "奇幻|漫画|百合|2025|温馨|已完结|真木蛍五|腰斩|现代|电子版|可爱"
};
