// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.06.17.81
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  31731: "漫画|启蒙|教育|夫妻成长日记|克・亜樹|爱情|白泉社|1997|工口|漫画系列|成年コミック",
  40643: "漫画|許斐剛|运动|集英社|ジャンプSQ.|2009|少年|体育漫画|2009-04|系列|长篇漫画",
  44591: "漫画|Fate|百合|魔法少女|Type-Moon|广山弘|魔法少女☆伊莉雅|伊莉雅|2012|小学生|魔法少女伊莉雅",
  48090: "吉田秋生|漫画|1985|少女漫画|小学館|BL|80年代|系列|耽美|耽美BL|别册少女Comic",
  65458: "少女漫画|漫画|あきづき空太|白泉社|恋爱|少女漫|2006|LaLa|少女|秋月空太|奇幻",
  70861: "漫画|こうの史代|治愈|日本|日常|夫妻",
  94009: "漫画|坂口尚|历史漫画|佛学|1993|一休宗纯|日本漫画|历史|系列|禅意",
  100392: "漫画|掰掰演劇社",
  128839: "漫画|棒球|2015|満田拓也|週刊少年サンデー|系列|竞技|连载中|日本|热血",
  140704: "已完结|限制|青年漫画|漫画系列|全21卷|八月薫|漫画|R18",
  143791: "短篇集|悬疑漫画|恐怖|楳図かずお|漫画系列|剧情|悬疑|小学馆|日本漫画|漫画|奇幻",
  161375: "漫画|历史|民俗|佐々大河|佐大河|漫画系列|日常|未完结|eb!|风土人情",
  170746: "漫画|猎奇|あずみきし|2013|负能量|新潮社|奇幻|连载中|黑暗|連載中|死后世界",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|電撃マオウ|漫画系列",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|肉|限制",
  211728: "漫画|日常|クール教信者|木村光博|漫画系列|百合|月刊Action|月刊アクション|萝莉|轻百合|连载中",
  221948: "漫画|搞笑|工口|卖肉|后宫|沙雕|双龍|社保|微エロ|2017|漫画系列",
  231908: "漫画|山本崇一朗|日常|搞笑|战斗|2018|小学館|百合|已完結|連載中|连载中",
  266498: "漫画|足球|講談社|运动|金城宗幸|2018|ノ村優介|週刊少年マガジン|体育漫画|中二|连载中",
  272351: "格斗|漫画|战斗|2019|漫画系列|格斗漫画|だろめおん|打斗|小学館|老年痴呆|搞笑",
  282324: "漫画|恋爱|小说改|轻改|KADOKAWA|紙城境介|草壁レイ|2019|校园|日常|轻小说改",
  288315: "漫画|少女漫画|恋爱|2019|森下suu|講談社|少女|少女漫|日本漫画|デザート|校园",
  298752: "漫画|格斗|战斗|超能力|奇幻|日本|2020|原创|连载中|小学館|ゲズンタイト",
  299228: "漫画|搞笑|2020|魔法|热血|周刊少年JUMP|集英社|奇幻|战斗|甲本一|已完结",
  305824: "漫画|后宫|战斗|异世界|奇幻|R18|卖肉|色情|肉|血腥|轻小说改",
  310827: "漫画|恋爱|日常|女仆|漫画系列|小学館|2020|原创|B漫|しょたん|纯爱",
  313877: "百合|漫画|奇幻|人外|猎奇|苗川采|2020|妖怪|日本|漫画系列|轻百合",
  320180: "短篇集|已完结|日本漫畫|恐龍",
  352392: "漫画|恋爱|假小子|伪男|2021|欢乐|蒼川なな|男装丽人|搞笑|系列|伪郎",
  354383: "百合|美食|日常|漫画|ゆざきさかおみ|KADOKAWA|2021|漫画系列|Twitter|断更|真人化",
  357988: "漫画|恋爱|人外|2021|奇怪的xp|KADOKAWA|传说|フシアシクモ|漫画系列|短篇|エロ",
  373830: "漫画|异世界|奇幻|搞笑|オヤジ草|卖肉|转生|2022|后宫|御鷹穂積",
  374355: "TL|系列|已完结|日本|漫画",
  377013: "百合|漫画|2021|异世界|恶役千金|复仇|小说改|已完结|白梅ナズナ|转生恶役|日本",
  382508: "漫画|漫画系列|搞笑|2025-08",
  386666: "漫画|百合|悬疑|2022|凸ノ高秀|江坂純|科幻|漫画系列|週刊ヤングジャンプ|集英社作品|日本漫画作品",
  390286: "漫画|小说改|漫画系列|战斗|日本|单元剧|续作|轻改|已完结",
  390287: "漫画|小说改|已完结|漫画系列|续作|轻改|战斗|日本",
  391572: "漫画|治愈|日本|百合|温馨|新装版|日常",
  392893: "漫画|漫画系列|系列|已完结|TL|日本|纸质书",
  403581: "漫画系列",
  405000: "搞笑|漫画系列|漫画|连载中|系列|原创|2026-01|日本",
  417220: "恋爱|漫画|少女漫画|小学館|2023|连载中|原创|青文出版社|女作者|系列|收藏",
  417234: "职场|漫画|雪永ちっち|战斗|講談社|格斗|なだいにし|漫画系列|装逼|搞笑|搜索用",
  427475: "漫画|搞笑|奇幻|週刊少年ジャンプ|恋爱|集英社|校园|2023|川江康太|战斗|人外娘",
  440076: "战斗|轻小说改|奇幻|漫画|连载中|小说改|日本|系列|哥布林的作者|画功好|纸质书",
  444076: "韩漫|韩国|已完结|漫画|条漫",
  445751: "竞技|漫画|系列|2023|連載中|运动|2026-01|连载中|尖端出版社|マンガ|原创",
  448453: "漫画|后宫|恋爱|校园|一般向|搞笑|日常|已完结|烂尾|腰斩|日本",
  448626: "漫画|返老还童|死者苏生|战斗|鬼怪|黑暗|8|寿命论|新挑限|战斗分镜强|悬疑",
  462719: "2026-02|2023|漫画改|东立出版社|日本|漫画|连载中|秋田书店|系列|一般向",
  471549: "漫画|恋爱|战斗|奇幻|2024|不像少女漫|少女マンガ|狐娘老婆|有意识使用武力|漫画系列",
  482298: "日本|漫画|游戏改|系列|已完结|漫画系列",
  531577: "漫画",
  543455: "系列|连载中|小说改|隐藏身份|日本|奇幻|漫画",
  545047: "漫画|后宫|异世界|搞笑|妈控|母系|望公太|青年|日本|连载中|ニコニコ漫画",
  601268: "",
  617946: ""
};
