// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.17.65
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3821: "绿川幸|治愈|漫画|白泉社|夏目友人帳|温暖画风|妖怪志|催泪弹|緑川ゆき|治愈系|怪谈",
  54168: "漫画|赤松中学|轻改|轻小说改|战斗|漫画系列|轻小说|奇幻|全16卷|日本|已完结",
  109978: "治愈|漫画|恋爱|搞笑|剧情|柴门文|已完结|漫画系列",
  110731: "漫画|恋爱|校园|小说改|渡航|伊緒直道|轻改|青春|2012|小学館|漫画系列",
  122272: "百合|漫画|校园|恋爱|高嶋ひろみ|日常|2010|社团|xxxと加瀬さん|牵牛花与加濑同学。|漫画系列",
  126883: "漫画|一般向|日常|腰斩|小说改",
  130584: "若木民喜|漫画|日常|西点|腰斩|漫画系列|周刊|料理|美食|美食漫画",
  134926: "小说系列",
  169907: "漫画|日漫|小學館|超短篇|單卷",
  188271: "漫画|岩本ナオ|少女漫画|短篇|已完结|少女|全一巻|單卷|超短篇|2014|マンガ",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  236624: "漫画|轻改|异世界|战斗|奇幻|轻小说改|2018|ありかん|小说改|日本",
  275361: "漫画|黑暗|复仇|异世界|小说改|勇者|2019|轻改|价值观扭曲|轻小说改|系列",
  279877: "漫画|搞笑|美食|奇幻|春原ロビンソン|集英社|喜剧|ひらけい|沙雕|2019|日常",
  285100: "漫画|搞笑|异世界|外传|尖端|小说改|系列|toku|日本|已完结|轻改",
  287385: "",
  289342: "漫画|科幻|轻改|战斗|增强现实|2019|纳米机器|赛博格|小说改|綾村切人|枪战",
  291882: "漫画|异世界|穿越|野田宏|若松卓宏|轻小说改|小学馆|轻改|搞笑|系列|战斗",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  297597: "漫画|性转|轻改|异世界|小说改|搞笑|轻小说改|奇幻|2019|漫画系列|战斗",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|漫画系列|2019|半月板損傷|穿越|ヒーローズ",
  300534: "漫画|漫画系列|异世界|策略|小说改|轻小说改|轻改|军事政治|2020|鳥羽徹|战斗",
  306253: "漫画|异世界|2019|漫画系列|新潮社|とうろう|原创|魔王|マンガ|意义|くらげバンチ",
  314528: "同人|全年龄|STEAM|iOS|PS4|2020|悬疑|短篇|纯爱|Galgame|PC",
  317612: "漫画|卖肉|女拳|漫画系列|2021|月刊コミックゼノン|黑暗|看不下去|7.3|悬疑",
  319012: "漫画|战斗|鈴木祐斗|周刊少年JUMP|杀手|2020|搞笑|日本|日常|JUMP|週刊少年ジャンプ",
  320214: "漫画|异世界|轻改|小说改|战斗|2020|网游|策略|穿越|奇幻|鉄田猿児",
  328235: "漫画|小说改|進行諸島|漫画系列|异世界|COIN|打斗很好|画功非常好|@|万解|8.2",
  341315: "死亡游戏|NS|PS4|r|Galgame|PS5|AVG|小鳥遊ゆめ|生肉|库存|2022-01",
  343477: "漫画|恋爱|吸血鬼|吉河美希|搞笑|2021|一般向|漫画系列|异性恋",
  381864: "漫画|足球|运动|热血|講談社|金城宗幸|蓝色监狱|2022|漫画系列|卖腐|原创",
  398117: "漫画|文豪野犬|轻小说|外传|热血|漫画系列|春河35|已购漫画|王道|战斗",
  402824: "漫画|短篇集",
  403205: "漫画",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|奇幻|日本",
  467935: "轻小说|萬屋久兵衛|桃子|絵葉ましろ",
  469146: "轻小说|甲田学人|奇幻|小说|校园|猎奇|2024|恐怖|小说系列|系列|悬疑",
  475241: "轻小说",
  492219: "",
  505472: "轻小说|逢縁奇演|小说|恋爱|荻pote|奇幻|電撃文庫|校园|搞笑|KADOKAWA|青春",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  569608: "游戏|NS2|ACT|PC|NS",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4",
  570430: "PC|NS|JRPG|游戏|工作室|PS4|RPG|NS2|PS5",
  570431: "PS5|RPG|NS2|Switch|PC|游戏|PS4|工作室|NS|JRPG"
};
