// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.10.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6496: "漫画|PEACH‐PIT|蔷薇少女|哥特|奇幻|战斗|2002|PEACH-PIT|哥特萝莉|漫画系列|少女漫画",
  31469: "漫画|矢吹健太朗|后宫|卖肉|校园|喜剧|長谷見沙貴|搞笑|2006|集英社|摔跤技能书",
  41093: "漫画|热血|美食|岛袋光年|冒险|JUMP|战斗|集英社|2008|週刊少年ジャンプ|少年JUMP",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|日常|椿泉",
  58644: "漫画|悬疑|生存|科幻|マンガ|漫画系列|已完结",
  72580: "漫画|鏡貴也|山本ヤマト|集英社|奇幻|战斗|ジャンプスクエア|动画化|JumpSquare|漫画系列|マンガ",
  103085: "漫画|四格|クール教信者|搞笑|芳文社|恋爱|小森拒不了！|2012|酷教信者|喜剧",
  130998: "漫画|异世界|穿越|冒险|小说改|轻改|关于我转生后成为史莱姆的那件事|2015|川上泰樹|轻小说改|小说系列",
  138475: "漫画|恋爱|奇幻|あいだいろ|地缚少年花子君|月刊GFantasy|少女漫画|月刊Gファンタジー|日本|2014|连载中",
  183756: "漫画|搞笑|恋爱|山本アリフレッド|神经病|理科生坠入情网，故尝试证明。|纯爱|2016|日常|校园|计算机科学",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|漫画系列|電撃マオウ",
  207479: "漫画|美食|治愈|小山愛子|小学館|生活|2016|日常|2016年|連載中",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|2017|週刊少年チャンピオン|日常|日本|热血",
  212189: "漫画|足球|体育|小林有吾|竞技|运动|小学館|2015|青春|体育漫画|热血",
  212535: "百合|漫画|文尾文|校园|日常|已完结|コミック百合姫|2016|ヤングアニマル|漫画系列|系列",
  215285: "漫画|异世界|轻改|后宫|恋爱|战斗|2016|白米良|RoGa|小说改",
  225513: "漫画|青年|久世岳|日常|搞笑|漫画系列|成人向|一迅社|真实|青年漫画|中村悠一",
  242942: "漫画",
  248141: "漫画|异世界|轻改|龙傲天|转生|小说改|漫画系列|轻小说改|穿越|战斗|奇幻",
  248885: "漫画|异世界|龙傲天|2018|納都花丸|爽文|轻改|小说改|轻小说改|概念神|藤孝剛志",
  248914: "漫画|轻小说改|异世界|奇幻|战斗|2017|小说改|数值龙傲天|滝乃大祐|黑妹|画风",
  249726: "漫画|冒险|父控|异世界|战斗|轻改|漆原玖|2018|轻小说改|父女|小说改",
  265151: "漫画|异世界|轻改|后宫|无双|真綿|小说改|转生|智商低|穿越|浪费设定",
  272611: "漫画|青春|校园|恋爱|高松美咲|講談社|2018|月刊アフタヌーン|日常|少女漫画|成长",
  272951: "漫画|异世界|转生|小说改|战斗|轻改|皇ハマオ|开挂无敌|轻小说改|漫画系列|日本",
  274821: "漫画|狗血|NTR|R18|宮崎摩耶|人妻|婊子|恋爱|マンガ|系列|限制",
  279136: "漫画|异世界|小说改|轻改|恋爱|龙傲天|漫画系列|轻小说改|总|B漫|吐了",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  283417: "百合|漫画|入间人间|柚原もけ|校园|安达与岛村|小说改|恋爱|入間人間|2019|清新",
  307607: "漫画|异世界|左藤真通|网游|奇幻|搞笑|2020|游戏|战斗|連載中|講談社",
  311289: "漫画|网游|战斗|轻小说改|冒险|週刊少年マガジン|不二涼介|2020|热血|轻改|奇幻",
  313876: "百合|漫画|日常|幼女|治愈|漫画系列|吉村佳|2020|原创|萝莉|黑丝连裤袜",
  314528: "同人|全年龄|STEAM|iOS|PS4|2020|悬疑|短篇|纯爱|Galgame|PC",
  318135: "漫画|异世界|穿越|轻小说改|2020|儿戏|小说改|种田|マガジンポケット|漫画系列|游戏",
  318611: "漫画|战斗|魔法|异世界|大森藤ノ|奇幻|青井聖|漫画系列|热血|2020|小说改",
  325588: "异世界|漫画|烈海王|漫画系列|格斗|刃牙|外传|秋田书店|刃牙外传|战斗|秋田書店",
  333519: "小说改|漫画|异世界|开挂无敌|漫画系列|龙傲天|穿越|战斗|魔法|奇幻",
  340073: "日漫|小说改|漫画系列",
  341315: "死亡游戏|NS|PS4|r|Galgame|PS5|AVG|小鳥遊ゆめ|生肉|库存|2022-01",
  342106: "漫画|板垣巴留|2021|搞笑|秋田書店|連載中|热血|漫画系列|マンガ|画风",
  348390: "漫画|小说改|校园|恋爱|轻小说改|2021|青梅竹馬|没啥好看|一般向|ドラドラふらっと|雲雀湯",
  349898: "百合|漫画|搞笑|日常|一迅社|恋爱|已完结|tsuke|2021|コミック百合姫|漫画系列",
  351360: "東方|东方|同人音乐|合集|2021|秋季例大祭8",
  352392: "漫画|恋爱|假小子|伪男|2021|蒼川なな|欢乐|男装丽人|搞笑|漫画系列|伪郎",
  361987: "漫画|エロ|卖肉|小说改|冒险|漫画系列|R18|2021|NTR|奇幻|18X",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|热血|集英社|大女主|週刊少年ジャンプ|连载中|日本",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|講談社|三簾真也",
  392095: "漫画|恋爱|校园|小说改|轻小说改|纯爱|漫画系列|2022|轻改|講談社|网络连载",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|连载中|杀手|日本",
  408209: "百合|漫画|かしわぎつきこ|2022|日常|一迅社|校园|漫画系列|7|真百",
  411115: "小说改|已完结",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|卖肉|小学馆|神展开",
  434727: "漫画|恋爱|校园|川田大智|系列|集英社|連載中|纯爱|未完结漫画|一般向|2023",
  440077: "漫画|校园|青春|日常|恋爱|偶像|矢寺圭太|女装|连载中|先看|在追",
  449427: "漫画|战斗|搞笑|怪兽|小学馆|ヨシアキ|2023|日本|变身|原创|科幻",
  452349: "漫画|周刊少年JUMP|热血|战斗|集英社|日本|日漫|2023|连载中|复仇|外薗健",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|原创",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|奇幻|日本",
  464543: "少女|少女漫画|漫画|伪郎",
  545203: "",
  573899: "牛尾憲輔|OST|电锯人|2025"
};
