// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.14.74
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  149172: "漫画|历史|坂本眞一|青年漫画|2015|社会|黑暗|集英社|坂本真一|中篇|系列",
  241011: "治愈|日常|漫画|一般向|桜井海|2018|日本漫画|pixivコミック|ガンガンpixiv|toku",
  272768: "漫画|Type-Moon|fgo|2019|游戏改|一迅社|系列|日本|漫画系列|奇幻|完结",
  301622: "轻小说|小说系列|已完结|少女|魔女|全2卷|双葉社|恋爱|恋爱药",
  315918: "轻小说|异世界|小说系列|转生|ハム男",
  362541: "轻小说|奇幻|战斗|电击文库|小说系列|2021|電撃文庫|ロケット商会|异世界|热血|连载中",
  445870: "轻小说|误解系|搞笑|异世界|后宫|日本|系列|急川回レ|小说",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  485030: "小说|轻小说|青年|异世界|贞操逆转",
  492066: "",
  505445: "小说",
  524513: "轻小说|恋爱|扭曲|雲雀湯|性爱分离|校园|青梅竹马|约炮|青春|日常|NTR",
  530020: "轻小说|2025|小说|カクヨム|東夷|后宫|をん",
  542030: "轻小说|2024|へいろー|恋爱|カボチャマスク|战斗|小说|日本|奇幻|异世界|web文",
  556816: "轻小说|2025|电击文库|星野星野|恋爱|校园|后宫|系列|日本|小说",
  562638: "百合|轻小说|扭曲|2025|校园|恋爱|日本|出轨|电击文库|小说|Akeo",
  573423: "轻小说|葵关南|恋爱喜剧|深崎暮人|恋爱|小说|日本|2025|青春|误解系|系列",
  697625: "",
  701787: ""
};
