// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.2.2.581
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1191: "moonstone|呉|Galgame|妹控的坟墓|妹控毒药|何処へ行くの、あの日|妹|GAL|兄控|郁|生肉",
  3822: "漆原友紀|虫师|漫画|治愈|讲谈社|空灵|蟲師|脱俗|漆原友纪|灵气|超治愈",
  5015: "岩明均|漫画|猎奇|科幻|青年漫画|环保|恐怖|完结|講談社|战斗|日本",
  14916: "GAL|PC|2002|汉化|SLG|Broccoli|歌超好听...|AVG|游戏",
  26676: "轻小说|淡路帆希|恋爱|护花之龙的叙情诗|已完结|小说|奇幻|系列|银月之龙|小说系列|フルーツパンチ",
  31808: "漫画|哆啦A梦|童年|藤子·F·不二雄|科幻|藤子・F・不二雄|超长篇|小学館|冒险|友情|1980",
  36567: "漫画|和月伸宏|浪客剑心|集英社|武士|时代剧|少年漫画|幕末|JUMP|经典|格斗",
  38023: "漫画|鳥山明|鸟山明|战斗|一卷完|搞笑|集英社|單卷|王道|2005|无厘头",
  38080: "手冢治虫|漫画|手塚治虫|医学漫画|医学|1973|青年漫|单元剧|青年漫画|已完结",
  45431: "安彦良和|漫画|高达|科幻|GUNDAM|2001|0079|已完结|神作|机战|萝卜",
  64273: "光永康則|漫画|漫画系列|已完结|吸血鬼|全20卷|怪物|后宫？|公主|搜索用",
  81282: "轻小说|推理|岡崎琢磨|shirakaba|宝島社|系列|日常推理|）|2012|全一巻|日本轻小说",
  129974: "押見修造|漫画|猎奇|吸血鬼|黑暗|2015|押见修造|講談社|社会人性|別冊少年マガジン|悬疑惊悚",
  130998: "漫画|异世界|穿越|冒险|小说改|轻改|关于我转生后成为史莱姆的那件事|2015|川上泰樹|轻小说改|小说系列",
  180061: "漫画|日常|恋爱|搞笑|校园|オダトモヒト|黑丝|狗粮|周刊少年sunday|小学馆|2016",
  195862: "漫画|搞笑|影崎由那|阿羅本景|2016|ホーム社|漫画系列",
  210068: "Galgame|悬疑|范乃秋晴|SF|景の海のアペイリア|意外之作|シルキーズプラス|2017|PC|科幻|妹",
  217833: "漫画|艺术|山口つばさ|校园|講談社|成长|2017|青年漫画|月刊アフタヌーン|美术生|美术",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|pixiv",
  225848: "Galgame|FD|景の海のアペイリア|范乃秋晴|シルキーズプラス|后宫|2017|範乃秋晴|ADV|汉化|悬疑",
  268279: "藤本タツキ|漫画|战斗|邪道|热血|周刊少年JUMP|集英社|自由人|少年JUMP|2018|藤本树",
  274307: "漫画|异世界|恋爱|穿越|轻改|漫画系列|轻小说改|青乃下|2018|奇幻|狗粮",
  281418: "高橋留美子|漫画|日本漫画|王道|漫画系列|2019|系列|恋爱|少年漫画",
  282324: "漫画|恋爱|小说改|轻改|紙城境介|草壁レイ|KADOKAWA|2019|校园|日常|轻小说改",
  288038: "漫画|异世界|小说改|轻改|冒险|漫画系列|战斗|2019|左藤圭右|轻小说改|奇幻",
  292572: "漫画|眉月じゅん|恋爱|科幻|集英社|2019|少女漫画|青年漫|週刊ヤングジャンプ|連載中|九龙大众浪漫",
  306926: "漫画|小说改|异世界|奇幻|战斗|小鈴危一|漫画系列|正太|转生|冒险|オカザキトシノリ",
  307921: "Galgame|国产|蓝莲安|国产AVG|单恋|反浪漫|全年龄|STEAM|8A_studio|国g|2020",
  308287: "漫画|神鬼|悬疑|怪谈|萝莉|ぬじま|奇幻|小学館|女性主人公|2019年|漫画系列",
  309438: "OST|松本文纪|galgame|松本文紀|ATRI|2020|赤尾ひかる|柳麻美|游戏原声集|游戏原声带|游戏",
  310983: "少女漫画|校园|漫画|恋爱|やまもり三香|少女|2020|講談社|デザート|漫画系列|日漫",
  311889: "漫画|治愈|日常|二階堂幸|搞笑|講談社|宠物|一般向漫画|漫画系列|2020|20年代",
  322220: "漫画|异世界|轮回|恶役千金|穿越|2020|女性向|恋爱|轻改|恶役|木乃ひのき",
  336224: "",
  337560: "Galgame|NanaWind|PC|藤崎紗矢香|2022年|ADV|游戏|白毛好评|奶子|GPT机翻|奶奶闻的",
  358510: "小说改|漫画系列|恋爱|异世界",
  366790: "漫画|怪怪守护神|限制",
  366792: "漫画|限制|怪怪守护神|官方下海",
  368650: "漫画|末永裕樹|2022|馬上鷹将|落语|集英社|週刊少年ジャンプ|大女主|热血|连载中|漫画系列",
  378805: "百合|美食|漫画|搞笑|2019|梵辛|漫画系列|KADOKAWA",
  383455: "galgame|国产|STEAM|PC|AVG|GAL|中国|纯爱",
  388852: "恋爱|漫画|校园|漫画系列|日常",
  401945: "恋爱|集英社|校园|漫画系列|男视角|2022",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  403129: "ACT|RPG|PC|游戏",
  423115: "奇幻|推理|悬疑|漫画|講談社|恋爱|日向夏|2023",
  436153: "轻小说|搞笑|伪娘|青春|小说系列|2023",
  447955: "Galgame|国产|AVG|PC|纯爱|GAL|游戏|青梅竹马|白裤袜|STEAM",
  469394: "PC|PS5|ACT|XSX|游戏|白金|龙珠|STEAM|童年|格斗|经典",
  470276: "falcom|轨迹系列|JRPG|RPG|PS5|法老控|PS4|2024-09|PC|游戏|2024",
  476513: "和泉万夜|猎奇|Galgame|るび様|重口|拔作|血腥|2024|バグシステム|R18G|PC",
  499873: "Capcom|AVG|推理|逆转|解谜|PC|2024|逆转系列|NS|ADV|游戏",
  501665: "Galgame|あめとゆき|海豹社|なかひろ|あざらしそふと|北見六花|2024|生肉|PC|ADV|R18",
  514038: "轻小说|恋爱|百合|番外|小说|校园|日常|2023|入间人间",
  516074: "日本|漫画|原创|系列|已完结",
  524477: ""
};
