// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.06.43
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11254: "alicesoft|Galgame|PC|生肉|2001-04|库存|ADV|H|AVG|Karen|2001",
  26879: "漫画|渡辺航|体育|弱虫ペダル|热血|週刊少年チャンピオン|少年向|竞技|飚速宅男|运动",
  35572: "漫画|国产|有妖气|热血|国漫|许辰|少年漫画|战斗|国产漫画|2012|奇幻",
  49153: "漫画|井上淳哉|生存游戏|生存|战斗|爆炸的艺术|已完结|月刊|新潮社|青年|漫画系列",
  61671: "InnocentGrey|Galgame|杉菜水姫|猎奇|PC|2006|AVG|GAL|悬疑|R18|白河綾音",
  90813: "二之宫知子|漫画|少女漫画|2013|恋爱|少女漫|二ノ宮知子|少女|漫画系列|生活|少女マンガ",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  193910: "漫画|少女漫画|少女|村田真優|校园|漫画系列|少女漫|狗粮|りぼん|恋爱|青春校园，胃疼",
  198355: "漫画|巨乳|クール教信者|日常|温馨|H漫画|卖肉|エロ|一般向|实用|秋田書店",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  225513: "漫画|青年|日常|搞笑|久世岳|一迅社|漫画系列|成人向|青年漫画|真实|社畜",
  240662: "漫画|职场|恋爱|狗粮|しろまんた|一迅社|2018|网络连载|萌|连载中|体型差",
  241896: "恋爱|漫画|少女|蒼木スピカ|人外|少女漫画|怪兽|漫画系列|人兽|2018|少女漫",
  248271: "漫画|异世界|轻改|小说改|VR|狐印|轻小说|漫画系列|百合|系列|连载",
  248670: "轻小说|川口士|后宫|异世界|连载|小说系列|战斗|2018|先读|ショウセツ",
  265155: "漫画|百合|轻小说改|旅行|奇幻|小说改|漫画系列|系列|B漫|白石定規|七緒一綺",
  270407: "百合|漫画|小说改|战斗|南方纯|猎奇|异世界|kiki|2018|冒险|奇幻",
  284854: "漫画|异世界|轻小说改|漫画系列|小说改|日常",
  292001: "漫画|漫画系列|轻改|轻小说改|日常|美食|异世界|养女儿|搞笑|后宫|マンガ",
  305869: "漫画",
  307237: "漫画|运动|体育|滑冰|热血|竞技|励志|つるまいかだ|日本|2020|原创",
  308990: "轻小说|理不尽な孫の手|异世界|朝凪|小说系列|朝lan|小说|连载中|系列|未完结轻小说|标签:恋爱",
  329376: "病娇|小说改|转生|少女漫|少女|轻小说改|漫画系列|女性主角|恶役千金",
  336604: "轻小说|凤傲天|小说系列|香坂マト|异世界|战斗|扮猪吃老虎|女性主角|系列|2005|がお",
  338894: "轻小说|恋爱|小说系列|雲雀湯|青梅竹马|戀愛|日本|web小说|校園|青梅|校园",
  340296: "漫画|轻小说改|异世界|漫画系列|小说改|2021|凤傲天|恋爱|日本|轻改|未完结",
  341376: "轻小说|奇幻|女主文|依空まつり|魔女|校园|小说|凤傲天|2020|小説家になろう|女性视角",
  343684: "轻小说|异世界|爽文|后宫|误解|转生|三嶋与夢|搞笑|科幻|恶德领主|误解系",
  355148: "小说改|柊一葉|2021|小学館|轻小说改|漫画系列|じろあるば|异世界",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|日本|画风好|系列",
  375025: "轻小说|恋爱|纯爱|たかた|小说|校园|角川スニーカー文庫|日向あずり|小说系列|日本|正常",
  401749: "漫画|中国|科幻|国漫|网文改|2014|国产",
  402044: "Galgame|全年龄|同人|PC|青春|AVG|友情|游戏|纯爱|ADV",
  422182: "系列|漫画系列",
  425694: "百合|国漫|架空|校园|中国|原创|双双转生|轻橘|魂穿|西幻",
  432523: "轻小说|后宫|异世界|搞笑|恋爱|战斗|日本|小说|百合|小说系列|原创",
  433428: "日本|萝莉|轻小说|小说|系列|小说系列|海鵜げそ|纸质书|春の日びより|web小说",
  439275: "轻小说|小说|彩月レイ",
  442710: "",
  443569: "PC|STEAM|AVG|游戏|ADV|Horror|Linux",
  446647: "冒险|漫画|后宫|异世界|穿越|ヤンマガWeb|小说改|一般向|异世界转移|絢乃|聖橋蘭",
  448550: "轻小说|战斗|冒险|小说系列|地下城|WEB",
  451128: "漫画|中国",
  452281: "悬疑|@|小说改|7.5|結城真一郎|第一个故事有意思",
  473405: "漫画|乐队|百合|2024|日常|集英社|少年JUMP+|漫画系列|音乐|日本|搞笑",
  481730: "漫画|連載中|在追|漫画系列|NON|运动|マンガ",
  497214: "百合|Galgame|PC|游戏|AVG|GL|VN",
  499874: "小高和刚|打越钢太郎|PC|悬疑|ADV|AVG|战棋|SRPG|游戏|STEAM|NS",
  515211: "PC|ARPG|银河恶魔城|PS5|ACT|PS4|单机游戏|游戏|XboxOne|Platform",
  527387: "PC|2025|ADV|全年龄|Windows|百合|游戏|AVG|Mac|VN|神椿"
};
