// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.01.47
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1410: "Nitro+|5pb|Galgame|猎奇|悬疑|混沌头|死宅的妄想力可是很强大的|林直孝|PC|N+|5pb.",
  3582: "漫画|科学超电磁炮|冬川基|鎌池和馬|百合|科幻|超能力系|月刊Comic电击大王|魔法|某科学的超电磁炮|2007",
  15841: "Nitro+|虚渊玄|Galgame|虚淵玄|PC|致陏|phantom|神作|AVG|Nitroplus|硬派",
  25338: "漫画|搞笑|森繁拓真|无口少年|高玩帝|上课小动作|日本|请结婚吧|日常|无对话",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  57143: "漫画|恋爱|校园|Tiv|后宫|搞笑|政宗君的复仇|竹岡葉月|竹冈叶月|一迅社|2012",
  99397: "漫画|小说改|轻小说改|日本|一般向|战斗|后宫|系列|轻改漫画|¬|已完结",
  126771: "漫画|芳文社|搞笑|恋爱|漫画系列|美少女|伪娘|四格|中山幸|治愈",
  134910: "沙村広明|漫画|职场|搞笑|广播|講談社|2014|月刊アフタヌーン|沙村广明|漫画大赏2016|连载中",
  138986: "恋爱|漫画|小说改|田口一|もっつん|全5卷|已完结|2011|后宫|福利|短篇",
  180932: "漫画|搞笑|轻小说改|番外|漫画系列|完结|惠惠|日常|素晴|小说改|日本",
  189167: "少女漫画|集英社|漫画|槙ようこ|漫画系列|少女漫|校园|りぼん|三角股|少女マンガ|男二控",
  192295: "曽田正人|体育漫画|体育|日本漫画|系列|运动|中篇|1992|曾田正人|竞技",
  211665: "漫画|异世界|穿越|轻改|骸骨骑士|奇幻|漫画系列|龙傲天|骨王小号|战斗|轻小说",
  227347: "連打一人|茶道|漫画|ジャンプ改|全4卷|吾为利休",
  229644: "漫画|治愈|亲情|浅野りん|美食|和菓子|2016|恋爱|KADOKAWA|漫画系列|连载中",
  235397: "百合|芳文社|漫画|日常|四格|科普|2017|まんがタイムKRコミックス|漫画系列|Quro|Kirara",
  242972: "漫画|恋爱|轻改|异世界|魔法|狗粮|小说改|轻小说改|冒险|2018|奇幻",
  247798: "漫画|异世界|小说改|抽卡|轻改|穿越|晴野しゅー|后宫|2018|コミックライド|轻小说改",
  252452: "漫画|宮永麻也|可爱|奇幻|已完结|日本|旅行|治愈|原创|公路|公路片",
  264546: "日常|治愈|漫画|搞笑|猫猫|2018|水曜日のシリウス|四格|WEB|山田ヒツジ|国欠猫",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  284160: "漫画|小说改|奇幻|恶役|少女漫|女性主人公|2019|ほおのきソラ|战斗|轻改|轻小说改",
  292706: "异世界|漫画|小说改|战斗|漫画系列",
  299584: "漫画|小说改|奇幻|轻小说改|装逼|2019|天海雪乃|异世界|KADOKAWA|战斗|漫画系列",
  300545: "Galgame|分割商法|Steam简中|STEAM|官中|汉化|R18|GAL|纯爱|2020",
  307237: "漫画|运动|体育|滑冰|热血|竞技|励志|つるまいかだ|日本|2020|原创",
  308573: "Galgame|ASa-Project|喜剧|小鳥居夕花|幼驯染|ASaProject|废萌|妹|杏子御津|2020|颜艺社",
  326285: "漫画|战斗|講談社|漫画系列|2021|铃木央|奇幻|少年漫画|系列|原创|日本",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  333572: "漫画|职场|漫画系列",
  340052: "漫画|异世界|小说改|漫画系列|磐秋ハル|B漫",
  347780: "Galgame|Qruppo|倉骨治人|监狱|PC|搞笑|2022|骨折王子|燃|GAL|R18",
  357433: "轻小说|小说系列|2021|立川浦々|立川浦",
  368813: "漫画|小说改|漫画系列|恶役千金|轻小说改|异世界|丘野優|なろう系|2022|人生やり直し系|鏡",
  377599: "漫画|藤本タツキ|短篇|藤本树|叙述性诡计|2022|反转|悬疑|奇幻|电影|少年JUMP+",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  403637: "漫画|校园|恋爱|肉丸|原创|NTR？|谜|圈乱|贵乱|NTR|婊子",
  446724: "轻小说|rurudo|百合|綾里けいし|轻小说系列|小说系列|原创|白毛|2023",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  464323: "恋爱|搞笑|校园|漫画|日常|反差|一般向|辣妹|比宮じょーず",
  475241: "轻小说",
  486509: "",
  492138: "轻小说|百合|2024|SF|奇幻|童话|公路文|轻百合|小说|电击文库|小说系列",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  506124: "恋爱|校园|漫画|爱情|日常|日本|系列|连载中|伊藤京介",
  515211: "PC|ARPG|银河恶魔城|PS5|ACT|PS4|单机游戏|游戏|XboxOne|Platform",
  531861: "设定集",
  549199: "画集"
};
