// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.21.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11028: "龙骑士07|悬疑|Galgame|うみねこのなく頃に|推理|AVG|猎奇|神作|竜騎士07|PS3|龙骑士",
  34107: "Galgame|柚子社|PSP|天神乱漫|废萌|ゆずソフト|GAL|Yuzu-Soft|若叶俺の嫁|妹控|伊藤静",
  40643: "漫画|許斐剛|运动|ジャンプSQ.|集英社|少年|2009|2009-04|体育漫画|杀人网球|漫画系列",
  123326: "同人|雨傘日傘事務所|Galgame|燃|感动|PC|生肉|有了你我不再怕黑|同人游戏|2009|ADV",
  138475: "漫画|恋爱|奇幻|あいだいろ|地缚少年花子君|月刊GFantasy|少女漫画|月刊Gファンタジー|2014|日本|漫画系列",
  143597: "漫画|异世界|轻小说改|奇幻|穿越|無職転生|轻改|フジカワユカ|后宫|2014|人生",
  144564: "漫画|智斗|超能力|生存游戏|战斗|みやこかしわ|2015|谋略|小学馆|悬疑|生存",
  161195: "falcom|轨迹系列|PS4|RPG|JRPG|英雄传说|闪之轨迹|轨迹|PC|2017|閃の軌跡",
  207479: "漫画|美食|小山愛子|治愈|小学館|生活|2016|日常|2016年|連載中",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  229635: "falcom|轨迹系列|PS4|RPG|JRPG|閃の軌跡|英雄传说|2018|閃の軌跡4|PC|内山昂辉",
  230858: "漫画|格斗|奇幻|梅村真也|战斗|动作|2017|アジチカ|漫画系列|日本|コアミックス",
  234799: "漫画|恋爱|色气|校园|福田晋一|cosplay|辣妹|日常|2018|爱情|少女漫",
  248086: "漫画|搞笑|穿越|馬場康誌|异世界|普京|战斗|脑洞|2018|大统领|奇幻",
  268992: "BL|漫画|紺吉|搞笑|BLコミック|2018|BL漫画|祥伝社|日漫|降智|女性向",
  270165: "漫画|已完结|搞笑|炒冷饭|漫画系列|2019|講談社|异世界|全5卷|10年代|不到7分",
  289342: "漫画|科幻|轻改|战斗|增强现实|赛博格|纳米机器|2019|綾村切人|小说改|枪战",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  296774: "falcom|轨迹系列|RPG|PS4|JRPG|英雄传说|2020|PC|轨迹|剧情|日本ファルコム",
  296863: "漫画|少女漫画|奇幻|少女漫|妖怪|女性主人公|少女|恋爱|一迅社|战斗|漫画系列",
  304298: "漫画|恋爱|漫画系列|竹書房|2020|搞笑|职场|巨乳萝莉|斎創",
  305903: "恋爱|漫画|校园|搞笑|纯爱|欢乐向|漫画系列|动漫之家",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|科幻|少年向|連載中",
  312150: "轻小说|恋爱|校园|小说系列|狗粮|フライ|日本|系列|戀愛|小说|校園",
  318135: "漫画|异世界|穿越|轻小说改|2020|小说改|种田|漫画系列|游戏|マガジンポケット|儿戏",
  318611: "漫画|战斗|异世界|魔法|大森藤ノ|奇幻|青井聖|漫画系列|2020|热血|校园",
  319012: "漫画|鈴木祐斗|战斗|周刊少年JUMP|杀手|2020|搞笑|日本|日常|JUMP|連載中",
  322621: "falcom|轨迹系列|RPG|JRPG|PS4|轨迹|英雄传说|2021|日本ファルコム|PC|PS5",
  325008: "漫画系列|已完结|全4卷",
  332487: "漫画|恋爱|小说改|校园|轻小说改|倒贴|漫画系列|日常|吉北ぽぷり|恋爱喜剧|画风",
  335516: "漫画|恋爱|奇幻|漫画系列|吸血鬼|2021|KADOKAWA|fmt.Manga",
  337740: "BL|旅行|漫画系列|2020|ソライモネ|治愈|BLコミック|连载中|清水",
  342552: "漫画|恋爱|日常|兄妹|2021|轻小说改|KADOKAWA|一般向|奏ユミカ|三河ごーすと|小说改",
  349268: "漫画|真冬日|2021|异世界|连载化|恶役千金|恶役|B漫|漫画系列|やましろ梅太",
  353857: "百合|漫画|异世界|奇幻|Be-con|猎奇|2021|青騎士|姐妹|KADOKAWA|漫画系列",
  362627: "falcom|轨迹系列|JRPG|RPG|黎之轨迹|PS5|PC|2022|PS4|日本ファルコム|分割商法",
  372709: "漫画|氏家卜全|黄段子|搞笑|小学生|漫画系列|日常|氏家ト全|系列|恋爱|日本漫画",
  401227: "NS|PC|2025|游戏|符文工房|JRPG|マーベラス|Switch|种田|符文工廠|其他",
  408197: "恋爱|校园|漫画|日常|2021|KADOKAWA|漫画系列|シロサワ|其他|系列|日本",
  416714: "FTG|Cygames|PC|格斗|2023|碧蓝幻想|PS5|STEAM|PS4|多人",
  433000: "漫画|ギャル|轻小说改|恋爱|搞笑|校园|日常|草中|辣妹|138ネコ",
  436731: "ARPG|游戏|PC|NS|PS4|XSX|PS5|XboxOne",
  452349: "漫画|周刊少年JUMP|热血|战斗|集英社|日漫|2023|日本|复仇|连载中|外薗健",
  462533: "漫画|恋爱|战斗|杀手|暴力|黑暗|連載中|大瀬戸陸|2024|分镜爽|黑道",
  472654: "轻小说|及川輝新",
  488392: "AVG|2025|STEAM|ADV|PC|魔法少女|Galgame|同人|NS|游戏|悬疑",
  509948: "JRPG|炼金工房|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|NS|STEAM",
  519041: "Windows|PC|游戏|猎奇|EROGE|R18",
  530029: "轻小说|水城水城|恋爱|校园|2025|KADOKAWA|MF文库J|潮崎しの",
  544568: "轻小说|綾坂キョウ",
  556500: ""
};
