// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.15.36
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  66368: "漫画|恋爱|集英社|アミュー|少年漫画|音乐|古筝|热血|竞技|桜アミュー|连载中",
  103535: "漫画|官方同人|命运石之门|成家慎一郎|牧濑红莉栖|5pb|漫画系列|已完结|全4卷|2012|社团",
  111234: "轻小说",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  134064: "漫画|搞笑|校园|Gファンタジー|漫画系列|连载中|田中まい|★マンガ|日常|重复|☆主条目",
  154936: "小说|轻小说",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  292589: "漫画|推理|2019|系列|小说改|漫画系列|悬疑|京極夏彦|连载中|志水アキ|收藏",
  299168: "轻小说|小说系列|WEB",
  307237: "漫画|运动|体育|滑冰|热血|励志|竞技|日本|つるまいかだ|2020|原创",
  317314: "漫画|日常|百合|日本|兴趣类|连载中|2019|原创|渋谷圭一郎|系列|科普",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  328376: "漫画|校园|エロ|福利|卖肉|搞笑|色情|糟糕|ムラタコウジ|漫画系列|2020",
  331609: "小说|轻小说|恋爱|校园|绝症",
  333709: "百合|漫画|檜原フキ|エロ|穿越|校园|已完结|R18|2021|日本|漫画系列",
  337906: "轻小说|中村颯希|小说系列|一迅社|奇幻|中华风|ゆき哉",
  344667: "小说",
  346060: "漫画|奇幻|2021|江野スミ|江野朱美|战斗|神鬼|漫画系列|猎奇|怪异|热门",
  348056: "百合|漫画|后宫|奥たまむし|恋爱|沙雕|漫画系列|2021|KADOKAWA|日本",
  357823: "草間さかえ|BL漫画|BLコミック|侦探|BL|2022",
  372294: "轻小说|异世界|百合|战斗|女主|小说系列|狂气|轻百|轻百合|女性向|漫画",
  373153: "漫画|后宫|稲葉みのり|恋爱|成年コミック|2022|NTR|职场|离婚|绿帽男？",
  373629: "漫画|2022|金田陽介|奇幻|异世界|校园|講談社|マガジンポケット|讲谈社|原创|日本",
  388039: "漫画|恋爱|校园|小说改|八神鏡|倒贴|轻小说改|2022|きぐるみ|コミックライド|轻改",
  389637: "轻小说|来栖夏芽|异世界",
  393603: "轻小说|日之浦拓|追放系|2022|对应漫画|GreeN|なろう系|旅游|奇幻|HJ文庫|异世界",
  394482: "",
  411978: "轻小说",
  416714: "Cygames|FTG|PC|格斗|2023|PS5|碧蓝幻想|PS4|STEAM|日系",
  433428: "轻小说|萝莉|日本|小说系列|系列|小说|web小说|纸质书",
  433526: "BL|日本|漫画|系列|连载中",
  451195: "轻小说|底花",
  470830: "漫画|百合|师徒|奇幻|魔法|古賀由人|4kaえんぴつ|コミック百合姫|已完结|系列|短篇",
  475219: "轻小说|木の芽|2023|异世界|后宫|富士见|连载中|连载|真后宫|幼驯染",
  493365: "性转|漫画|校园|三角恋|TS|2024|百合|日本|恋爱|系列",
  509955: "传说系列|JRPG|RPG|PS5|2025|PC|PS4|Switch|NS|普通游戏",
  511444: "轻小说|坂石遊作|2023|小说系列|催泪|角川BOOKS|小说",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  525894: "轻小说|六海刻羽",
  557554: "",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4",
  579477: "PC|PS5|2025|JRPG|RPG|XSX|NAMCO|游戏|NS",
  590822: ""
};
