// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.09.59
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11254: "alicesoft|Galgame|PC|生肉|2001-04|库存|ADV|H|AVG|Karen|2001",
  26879: "漫画|渡辺航|体育|弱虫ペダル|热血|週刊少年チャンピオン|少年向|竞技|飚速宅男|运动",
  85896: "Galgame|PeasSoft|妹|PC|2014|双飞|生肉|ADV|实妹|小倉結衣|后宫",
  89419: "漫画|大久保圭|文艺复兴|少女漫画|ARTE|励志|月刊コミックゼノン|绘画|一般向漫画|艺术|连载中",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  148732: "漫画|芳文社|百合|日常|治愈|露营|あfろ|摇曳露营Δ|2015|轻百合|漫画系列",
  181003: "漫画|搞笑|五十嵐正邦|欢乐|KADOKAWA|悬疑|2016|2019|B漫|系列|汉化",
  198355: "漫画|巨乳|クール教信者|日常|温馨|H漫画|卖肉|エロ|一般向|实用|秋田書店",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  231825: "漫画|异世界|百合|小说改|奇幻|穿越|凤傲天|せるげい|熊熊|くまなの|漫画系列",
  237704: "漫画|日常|钓鱼|小坂泰之|校园|搞笑|海洋|2017|科普|连载中|秋田書店",
  241896: "恋爱|漫画|少女|蒼木スピカ|人外|少女漫画|怪兽|漫画系列|人兽|2018|少女漫",
  244481: "搞笑|已完结|魔法少女|漫画系列|漫画|马猴烧酒|ribon|奇幻|汉化",
  248271: "漫画|异世界|轻改|小说改|VR|狐印|轻小说|漫画系列|百合|系列|连载",
  248670: "轻小说|川口士|后宫|异世界|连载|小说系列|战斗|2018|先读|ショウセツ",
  248883: "漫画|恋爱|校园|搞笑|肉番|丈|狗粮|喜剧|2018|快结婚|KADOKAWA",
  265155: "漫画|百合|轻小说改|旅行|奇幻|小说改|漫画系列|系列|B漫|白石定規|七緒一綺",
  284854: "漫画|异世界|轻小说改|漫画系列|小说改|日常",
  304298: "漫画|恋爱|漫画系列|竹書房|2020|搞笑|职场|巨乳萝莉|斎創",
  305869: "漫画",
  307721: "漫画|轻改|异世界|小说改|日本|奇幻|系列|搞笑|穿越|轻小说改|漫画系列",
  308489: "国漫|三番熊|腾讯系|漫画|中國|国产|中国|条漫",
  308990: "轻小说|理不尽な孫の手|异世界|朝凪|小说系列|朝lan|小说|连载中|系列|未完结轻小说|标签:恋爱",
  311891: "漫画|恋爱|短篇|校园|青春|JUMP|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  312642: "漫画|正太|转生|异世界|龙傲天|轻改|后宫|战斗|漫画系列|2020|未完结漫画",
  319309: "漫画|安田佳澄|科幻|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|糟糕|GAL|限制",
  329376: "病娇|小说改|转生|少女漫|少女|轻小说改|漫画系列|女性主角|恶役千金",
  336604: "轻小说|凤傲天|小说系列|香坂マト|异世界|战斗|扮猪吃老虎|女性主角|系列|2005|がお",
  338894: "轻小说|恋爱|小说系列|雲雀湯|青梅竹马|戀愛|日本|web小说|校園|青梅|校园",
  340770: "漫画|恋爱|大小姐|套路|小说改|日常|水島空彦|2021|校园|轻小说改|漫画系列",
  341376: "轻小说|奇幻|女主文|依空まつり|魔女|校园|小说|凤傲天|2020|小説家になろう|女性视角",
  343684: "轻小说|异世界|爽文|后宫|误解|转生|三嶋与夢|搞笑|科幻|恶德领主|误解系",
  349339: "恋爱|漫画|人妻|巨乳|搞笑|卖肉|ねこ末端|杀必死|已完结|漫画系列|一般向",
  355148: "小说改|柊一葉|2021|小学館|轻小说改|漫画系列|じろあるば|异世界",
  374355: "TL",
  375025: "轻小说|恋爱|纯爱|たかた|小说|校园|角川スニーカー文庫|日向あずり|小说系列|日本|正常",
  389730: "中国|国漫|漫画",
  391665: "百合|国漫|恶役千金|漫画|刺猬猫阅读|恋爱|赤色|断S|条漫|中国|国产",
  392095: "漫画|恋爱|校园|小说改|纯爱|轻小说改|漫画系列|2022|轻改|网络连载|講談社",
  402044: "Galgame|全年龄|同人|PC|青春|AVG|友情|游戏|纯爱|ADV",
  422182: "系列|漫画系列",
  425694: "百合|国漫|架空|校园|中国|原创|双双转生|轻橘|魂穿|西幻",
  432523: "轻小说|后宫|异世界|搞笑|恋爱|战斗|日本|小说|百合|小说系列|原创",
  433428: "日本|萝莉|轻小说|小说|系列|小说系列|海鵜げそ|纸质书|春の日びより|web小说",
  439275: "轻小说|小说|彩月レイ",
  439690: "漫画|卖肉|恋爱|校园|2023|系列|龍大和|工口|糟糕|纯爱|肉",
  446647: "冒险|漫画|后宫|异世界|穿越|ヤンマガWeb|小说改|一般向|异世界转移|絢乃|聖橋蘭",
  447051: "中国|逆袭|重生|网文改|系统",
  448550: "轻小说|战斗|冒险|小说系列|地下城|WEB",
  451128: "漫画|中国",
  452281: "悬疑|@|小说改|7.5|結城真一郎|第一个故事有意思",
  461443: "漫画|搞笑",
  473405: "漫画|乐队|百合|2024|日常|集英社|少年JUMP+|漫画系列|音乐|日本|搞笑",
  475241: "轻小说",
  481730: "漫画|連載中|在追|漫画系列|NON|运动|マンガ",
  492268: "百合|漫画|校园|千種みのり|2023|KADOKAWA|角川",
  497214: "百合|Galgame|PC|游戏|AVG|GL|VN",
  499874: "小高和刚|打越钢太郎|PC|悬疑|ADV|AVG|战棋|SRPG|游戏|STEAM|NS",
  527387: "PC|2025|ADV|全年龄|Windows|百合|游戏|AVG|Mac|VN|神椿",
  529080: "AVG|PC|游戏|ADV|Switch|NS",
  553277: "画集|中国|国产|纸质书"
};
