// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.09.09.40
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  77199: "韩露|耽美|国漫|漫画|漫友|BL漫画|华丽派|BL|BLコミック|漫画中的插画|国产",
  287547: "轻小说|异世界|后宫|大崎アイル|WEB|转生流|冒险|转生|Tam-U|阳痿|小说",
  305872: "轻小说|误解系|厨力治国|搞笑|异世界|餅月望|欢乐多|时间回溯|迪化|WEB|小说",
  310983: "漫画|少女漫画|恋爱|校园|やまもり三香|2020|少女|講談社|デザート|连载中|少女漫",
  311834: "百合|轻小说|异世界|奇幻|战斗|恋爱|WEB|鴉ぴえろ|小说|小说系列|KADOKAWA",
  324621: "Galgame|渡辺僚一|百合|悬疑|シルキーズプラス|futa|扶她|2021|あめとゆき|科幻|百合？",
  329306: "百合|漫画|搞笑|芳文社|Kirara|肉丸|四格|BadGirl|2020|2021",
  350856: "小说改|漫画系列|系列|日本|漫画|连载中|轻小说改",
  357105: "小说改|漫画系列",
  376012: "韩漫|漫画|搞笑|韩国|异世界|颜艺|穿越|小说改|webtoon|男性向|韩国漫画",
  402768: "gal改|漫画系列|游戏改|2023|漫画|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  409168: "漫画|热血|东立出版社|2022|类型:漫画|龙|画风有魄力|少年|好看|系列",
  427432: "恋爱|漫画|卯月ココ|校园|少女漫|講談社|2023|少女|少女漫画|デザート|連載中",
  441381: "台湾|武侠|漫画|青年漫画|性|国产|喜劇|台灣|麥人杰|武俠|臺版",
  443107: "漫画|恋爱|重女|职场|搞笑|あきやま|日常|日本|2023|青年|週刊ヤングジャンプ",
  480993: "漫画|日本|战斗|奇幻|烂尾|已完结|腰斩|一般向|倒贴|开挂无敌|小说改",
  485466: "百合|漫画|后宫|奇幻|2024|日常|コミック百合姫|しぼりかすこ|恋爱|真百|2025",
  491875: "漫画|限制",
  524654: "百合|漫画|校园|恋爱|2024|とりいしづく|甜|真百|单行本|已完结|搞笑",
  561323: "漫画|日本|卖肉|熟女|后宫|连载中|魔法少女|原创|2025|奇幻|2026-04",
  655873: "2026"
};
