// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.04.23.37
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  113: "漫画|伊藤润二|恐怖|伊藤潤二|短篇集|猎奇|中山市朗|2003|全一卷|木原浩勝|短篇",
  15792: "小畑健|漫画|围棋|完全版|成长|经典|棋魂|堀田由美|1999|少年漫画|人生",
  40978: "漫画|三国|港漫|陈某|智斗|殘存亦末路兵敗如山倒|火凤燎原|热血|八奇|2001|国漫",
  55332: "战斗|皆川亮二|科幻|漫画|漫画系列|科幻漫画|冒险|奇幻|Sunday|日本漫画|90年代",
  94463: "推理|逆转裁判|Capcom|AVG|巧舟|解谜|PC|游戏|2014|NS|3DS",
  104874: "轻小说|志倉千代丸|群像|pako|超自然9人组|小说|系列|小说系列|幻想|都市",
  168635: "BL|おげれつたなか|BL漫画|エロ|漫画|R18|BLコミック|工口|耽美|校园|幻冬社",
  188381: "漫画|猎奇|生存|悬疑|已完结|黑暗|全7卷|漫画系列|科幻|2016|講談社",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  224503: "漫画|悬疑|智斗|推理|朝基まさし|犯罪|山川直輝|2017|講談社|心理|青年漫画",
  228234: "漫画|恐怖|校园|恋爱|已完结|青梅竹马|悬疑|みつちよ丸|マンガ|漫画系列|集英社",
  230591: "漫画|石黑正数|悬疑|科幻|石黒正数|2018|講談社|脑洞|公路|战斗|末世",
  263870: "",
  267280: "漫画|擦边球|搞笑|已完结|色气|生活|相原瑛人|太太|講談社|2018|年上",
  271005: "漫画|后宫|福利向|战斗|竹村洋平|卖肉|奇幻|2019|肉|福利|集英社",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  295730: "漫画系列|BL|双胞胎|漫画|BL漫画|2019|ABO",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  305282: "漫画|后宫|卖肉|异世界|轻小说改|R18|轻改|小说改|实用|限制|日本",
  306888: "百合|漫画|小说改|异世界|コミック百合姫|恶役千金|恋爱|青乃下|2020|漫画系列|轻改",
  311613: "漫画系列",
  311737: "漫画|卖肉|搞笑|人不如狗|讲谈社|动物|微エロ|2020|いつつせ|漫画系列|后宫",
  316215: "漫画|生存|麻生羽呂|智斗|已完结|短篇|漫画系列|小学館|系列|原创|週刊少年サンデー",
  323829: "漫画|游戏改|搞笑|まめおじたん|2020|gal改|无性器描写的H|日本|连载中|已完结|原创",
  325234: "漫画|历史|松井優征|周刊少年JUMP|可爱的男孩子|搞笑|2021|週刊少年ジャンプ|日本|日漫|集英社",
  325236: "漫画|搞笑|篠原健太|奇幻|集英社|週刊少年ジャンプ|2021|周刊少年JUMP|日本|校园|原创",
  327654: "漫画|日本漫画|标签:待改|菌类末日|画功一般|7.1|日本|系列|片山あやか|@|类型:漫画",
  337049: "中国|实体",
  344920: "BLコミック|漫画|日本|R18|BL漫画|日漫|本間アキラ",
  347066: "百合|漫画|きぃやん|コミック百合姫|恋爱|一迅社|2021|漫画系列|细腻|已完结|2022",
  348689: "日常|KADOKAWA|漫画|日本|マンガ",
  353235: "连载中|2025-07|漫画改|日本|漫画|漫画系列|系列|海贼王",
  357042: "漫画|賀来ゆうじ|战斗|集英社|奇幻|热血|已完结|週刊少年ジャンプ|2022|少年漫画|贺来友治",
  358855: "BLコミック",
  362417: "漫画|田川とまた|漫画系列|伪限制|講談社|2021|マンガ|系列|純猥談編集部|恋爱|日本",
  367691: "漫画|搞笑|宅|mii.m|2022|講談社|极道|漫画系列|已完结|少年マガジンエッジ|系列",
  372285: "漫画|小说改|异世界|2021|轻小说改|便宜改编|婚约破弃|6.6|なろう系|爽文|漫画系列",
  372591: "百合|漫画|幼驯染|ヒジキ|恋爱|校园|2022|甜作|漫画系列|真百",
  373162: "百合|漫画|ヒジキ|恋爱|2022|姐妹|KADOKAWA|日常|漫画系列|扭曲",
  374357: "BLコミック|漫画|耽美|BL|漫画系列|全2卷|已完结",
  380015: "",
  381902: "BL|职场|网游|BLコミック|ん村|一迅社|恋爱|2020|搞笑／吐槽|搞笑|漫画",
  402224: "漫画|战斗|奇幻|已完结|短篇|新川直司|週刊少年マガジン|悬疑|漫画系列|2022|日本",
  411504: "漫画|BL|系列|台湾|已完结",
  416240: "漫画|战斗|講談社|驱鬼|复仇|SNS|热血|恋爱|猎奇|灵异|连载中",
  417112: "漫画|はぐれメタボ|2022|なろう系|おおのいも|连载中|2025-12|日本|マンガ|小说改|轻小说改",
  418302: "漫画|异世界|冒险|战斗|日本|穿越|网游|奇幻|2022|小说改|少年",
  421394: "JUMP+",
  424715: "BLコミック|イクヤス",
  432211: "漫画|小说改|猎奇|百合|战斗|大逃杀|一般向|日本|连载中|漫画系列|轻小说改",
  436747: "漫画|芳文社|外传|日常|音乐|搞笑|2023|くみちょう|Kirara|日本|连载中",
  445069: "原创|连载中|日本|漫画|青年",
  446488: "日本|漫画|历史|原创|已完结|系列",
  460940: "漫画|战斗|恋爱|日本|奇幻|原创|族群|已完结|系列",
  478567: "搞笑|山崎麻里|穿越|古罗马|奇幻|连载中|喜剧|扁脸族|原创|系列|日本",
  495647: "",
  497920: "集英社|连载中|2024|原创|漫画|日本|系列|打恶魔|2025-11|节奏太快了吧|男主挺强",
  503203: "",
  512725: "",
  573315: "日本|漫画|BL|系列"
};
