// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.30.47
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  32491: "漫画|丧女|日常|谷川ニコ|搞笑|百合|不管我怎么去想我不受欢迎这件事都是你们的错!|后宫|校园|漫画系列|2011",
  104586: "Vocaloid|GUMI|164",
  143372: "茶太|同人|2015|日向そら",
  209535: "漫画|异世界|性转|轻改|すえみつぢっか|穿越|小说改|2016|搞笑|性转换|漫画系列",
  225427: "漫画|駕籠真太郎|短篇集|猎奇|太田出版|1995|日本漫画|R18|艺术漫画|エロ|全一卷",
  254651: "雪広うたこ|漫画|一迅社|一般向|侦探|BL|漫画系列|日本漫画|推理|男人|BL2018",
  282735: "漫画|后宫|异世界|轻小说改|恋爱|工口|小島紗|R18|小说改|穿越|奇幻",
  285114: "漫画|奇幻|治愈|樋口彰彦|搞笑|講談社|历史|漫画系列|百合|日常|2019",
  287428: "漫画|春輝|卖肉|忍者|漫画系列|R18|系列|奇幻|青年漫画|擦边球|色情",
  297267: "漫画|恋爱|党争|吉河美希|搞笑|2020|講談社|周刊少年magazine|週刊少年マガジン|日漫|妹",
  306272: "漫画|2020|奇幻|NAOE|战斗|BLコミック|漫画系列|月刊Gファンタジー|一般向|BL",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  337711: "漫画|日本|系列|原创|少女|人外|Furry|连载中|优先|限制",
  368804: "漫画|战斗|奇幻|講談社|2022|热血|裏那圭|漫画系列|原创|废品",
  370565: "卖肉|漫画|后宫|恋爱|杀必死|漫画系列|小说改|待エロ|色|月刊ドラゴンエイジ|神月洸壱",
  372262: "漫画系列",
  372612: "漫画|奇幻|战斗|轻小说改|异世界|大叔|乍藤和樹|师徒|漫画系列|小说改|连载中",
  391432: "漫画|后宫|卖肉|奇幻|小说改|异世界|一般向|擦边球|校园|日常|搞笑",
  391665: "百合|国漫|漫画|恶役千金|刺猬猫阅读|恋爱|断S|赤色|国产|条漫|中国",
  418009: "恋爱",
  447981: "漫画|系列|講談社|NTR|恋爱|マンガ|负反馈大于正反馈|2023|无聊|生肉|連載中",
  488880: "百合|漫画|2024|やとさきはる|甜|搞笑|講談社|恋爱|喜剧|コミックDAYS|美食",
  515527: "RPG|炼金工房|PC|PS5|游戏|2025|PS4|NS|PS|JRPG",
  529432: "falcom|ARPG|NS2|伊苏|游戏|2025|7.5|JRPG|2025+|RPG"
};
