// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.10.30.36
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  8949: "漫画|樋野茉莉|吸血鬼|少女漫画|画工不错|樋野まつり|白泉社|吸血鬼骑士|女性向|少女漫|乙女向",
  24207: "漫画|肉|后宫|佐藤ショウジ|战斗|校园|卖肉|恋爱|福利|漫画系列|日本",
  28773: "少女漫|漫画|少女漫画|傲娇与忠犬|八田鮎子|別冊マーガレット|集英社|腹黑男|少女|少女マンガ",
  32475: "兽耳|后宫|萌|漫画",
  36008: "少女漫画|恋爱|萌|科普|漫画|校园|已完结|漫画系列|少女",
  40444: "漫画|兄妹|少女漫画|扭曲的爱|椎名チカ|妹控|扭曲|喜当爹|已完结|義理|青年漫画",
  42435: "漫画|热血|战争|原泰久|历史|集英社|青年漫画|2006|历史漫画|古代|连载中",
  44121: "森下suu|漫画|少女漫画|少女漫|日々蝶々|集英社|少女|マーガレット|高嶺之花|三无女|恋爱",
  54463: "漫画|短篇|丸尾末広|短篇集|猎奇",
  59118: "漫画|耽美|腐|雪広うたこ|BL|漫画系列|月刊ZEROSUM|基|2010|伪娘|一迅社",
  76385: "漫画|芊尾悟|异世界|漫画系列|柳内たくみ|改编|轻改|小说改|アルファポリス|轻小说改|限制",
  76635: "漫画|紺野あずれ|コミックハイ!|卖肉|2013|糟糕|露出",
  77155: "漫画|已完结|光永康則|全4卷|工口|节操漫不解释|青年漫画|漫画シリーズ|卖肉|エロ|漫画系列",
  85597: "葉月京|已完结|漫画|全6卷|青年漫画|恋爱|福利|职场|漫画系列",
  92094: "漫画|恋爱|巨乳|完结|猫耳|猫娘|漫画系列",
  114064: "Galgame|方糖社|萌木原ふみたけ|FD|Lump_of_Sugar|甜作|PC|泉户真白|汉化|GAL",
  143080: "少女漫画",
  145280: "森本梢子|少女漫|少女漫画|漫画|搞笑|少女|已完结|高台家的成员|恋爱|女性漫画|Comic",
  155705: "Galgame|白もち桜|hearts|妹|萝莉|PC|GAL|2016|生肉|ADV|实妹",
  159886: "漫画|少女漫画|少女漫|集英社|大詩りえ|已完结|原创|日本|少女|乙女向け|校园",
  168238: "漫画|少女漫画|人外|少女漫|白泉社|恋爱|奇幻|花与梦|福瑞|美女与野兽|2015",
  169710: "悬疑|少女漫画|漫画|一般向|少女漫|少女|成长|三角恋|shojo|漫画系列",
  170007: "漫画|シモダアサミ|日常|搞笑|月刊アクション|中学生性日记|漫画系列|2013|双葉社|系列|短篇",
  178494: "少女漫画|漫画|野切耀子|已完结|日本|男二控|期待度1|日本漫画|全4卷|ARIA|日漫",
  182537: "漫画|轻改|漫画系列|异世界|轻小说改|战斗|小说改|奇幻",
  182858: "全4卷|已完结|漫画系列|7.5|基督山",
  183681: "丸尾末広|漫画|猎奇|剧情|黑暗|实体",
  190757: "漫画|校园|恋爱|増田里穂|纯爱|青春|少女漫画|少女|日常|全一卷|少女漫",
  201337: "恋爱|少女|已完结",
  237343: "异世界|转生|小说改|漫画|2017|正太|美食|轻改|古流望|飯田せりこ|冒险",
  293668: "マンガ",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|游戏",
  295693: "漫画|日漫|表|BG|書籍化|系列|恋爱|漫画系列|青梅竹马",
  297286: "洛天依|Vocaloid|v家|album|★Vocaloid|神专",
  298405: "漫画|漫画系列|少女|奇幻|连载中|日本|日漫|原创|系列",
  299236: "Vocaloid|音乐|洛天依|阿良良木健|2016",
  304270: "漫画|小说改|搞笑|异世界|舞铲阶级|浪费作画|漫画系列|日本|系列|节操|已完结",
  309385: "漫画|战斗|热血|集英社|松本直也|少年JUMP+|怪獣|2020|科幻|少年向|連載中",
  315767: "漫画|末世|2020|公路|治愈|さいとー栄|百合|原创|日本|系列|连载中",
  323191: "漫画|奇幻|战斗|少年|伪娘|2020|已完结|系列|架空历史|日本|少年漫画",
  324510: "漫画|1997|年鉴|原创|短篇|已完结|一卷完|猎奇|日本|限制级",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  332250: "漫画|龍幸伸|战斗|奇幻|怪谈|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  353203: "漫画|搞笑|平方昌宏|魅魔|漫画系列|系列|奇幻|原创|已完结|日本|完结",
  375555: "日漫|恋爱|校园|异世界|BG",
  377526: "漫画|漫画系列",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|漫画系列|校园|原创|講談社|日本|週刊少年マガジン",
  391436: "漫画|致郁|浄土るる|哲学|宗教|治愈|2022|小学館|漫画系列|7",
  403297: "漫画|恋爱|推理漫画",
  409402: "百合|漫画|ウオズミアミ|2022|漫画ウオズミアミ|恋爱|NTR|人妻|日本漫画|GL|集英社",
  425858: "",
  454851: "漫画|后宫|卖肉|佐原玄清|校园|2023|穿越|奇幻|恋爱|一般向|漫画系列",
  456679: "",
  463771: "漫画|恋爱|日常|直球|多治見尚哉|原创|2023|系列|漫画系列|连载中|日本",
  464379: "漫画|卖肉|异世界|穿越|控制欲|そらモチ|奇幻|H|墨天業|川崎悠|2023",
  467464: "BL|漫画|BLコミック|露久ふみ",
  478573: "漫画|集英社|奇幻|穿越|日本|怪谈|原创|已完结|日漫|系列",
  482476: "",
  497897: "漫画|搞笑|原创|外星人|系列|日常|日本|一般向|卖肉|泽田コウ|连载中",
  506343: "漫画",
  553103: "专辑|Vocaloid|CD|同人音乐|中国|生贺|Vsinger",
  569616: ""
};
