// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.04.27.44
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  32491: "漫画|丧女|日常|谷川ニコ|搞笑|百合|不管我怎么去想我不受欢迎这件事都是你们的错!|后宫|漫画系列|校园|2011",
  40978: "漫画|三国|港漫|陈某|智斗|殘存亦末路兵敗如山倒|火凤燎原|热血|八奇|2001|国漫",
  55423: "漫画|下口智裕|清水荣一|奥特曼|月刊ヒーローズ|特摄|科幻|钢铁曼|2011",
  78964: "漫画|五十嵐あぐり|小林立|百合|麻将|麻雀|咲-Saki-|月刊ビッグガンガン|外传|校园|¬",
  107047: "漫画|宮下裕樹|系列|中篇|飞",
  108564: "漫画|格斗|热血|サンドロビッチ・ヤバ子|2012|三肉必起|小学馆|格斗漫画|だろめおん|漫画系列|裏サンデー",
  114868: "OST|古典音乐|四月是你的谎言|四月は君の嘘|横山克|2014|古典|动画|2014年10月|音乐|恋爱",
  117091: "OST|横山克|四月は君の嘘|2015|四月是你的谎言|anime|动画|O.S.T.|动画歌曲|ENA☆|ACG",
  185030: "ADV|希萌|AVG|Galgame|PC|STEAM|游戏|全年龄|narrator|草火车",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|讲谈社|搞笑|連載中|講談社",
  262151: "漫画|真岛浩|上田敦夫|讲谈社|热血|漫画系列|妖精尾巴|连载中|日本|原创|系列",
  272967: "漫画|奇幻|猪熊しのぶ|R18|搞笑|卖肉|工口|2018|异世界|限制|泡泡浴",
  289342: "漫画|科幻|轻改|战斗|增强现实|赛博格|纳米机器|2019|綾村切人|小说改|枪战",
  296427: "轻小说|恋爱|狗粮|兎谷あおい|校园|小说系列|小説家になろう|2017|校園|纯爱|日本轻小说",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|漫画系列|2019|半月板損傷|穿越|ヒーローズ",
  302417: "星空めてお|Liar-soft|Galgame|中村哲也|FD|PC|2004|GAL|视频通关|爱欲|乡愁",
  307607: "漫画|异世界|左藤真通|网游|奇幻|搞笑|游戏|2020|bug|連載中|战斗",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  313133: "漫画|搞笑|2019|芳文社|奇幻|toufu|勇者|魔王|异世界|战斗|未完结漫画",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|未完结漫画|2020",
  318611: "漫画|战斗|异世界|魔法|大森藤ノ|奇幻|青井聖|漫画系列|校园|2020|小说改",
  319012: "漫画|鈴木祐斗|战斗|周刊少年JUMP|杀手|2020|搞笑|日常|JUMP|連載中|集英社",
  322968: "漫画|春場ねぎ|周刊少年magazine|奇幻|2021|週刊少年マガジン|講談社|战斗|讲谈社|連載中|漫画系列",
  326285: "漫画|战斗|講談社|漫画系列|2021|铃木央|奇幻|少年漫画|系列|原创|日本",
  329101: "漫画|甘詰留太|R18|限制|青年漫画|卖肉|未完结漫画|恋爱|R15|ヤングキング|搞笑",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|2021|龙幸伸",
  334277: "漫画|春輝|R18|限制|成年コミック|漫画系列|真实故事改编|素人|卖肉|短篇|青年漫",
  337417: "伪娘|漫画|虚拟主播|vtuber|萝莉|正太|漫画系列|萌|2021|党争|扭曲",
  340068: "小说改|漫画系列",
  368804: "漫画|战斗|奇幻|講談社|2022|裏那圭|漫画系列|热血|废品|原创",
  398259: "轻小说|战斗|白毛|鵜飼有志|猎奇|死亡游戏|小说系列|智斗|日本|大逃杀|小说",
  400667: "漫画|小说改|日本|系列|乙女向|连载中|漫画系列",
  412304: "2022|校园|少女マンガ|恋爱|集英社|少女漫画|漫画|少女漫|青春校园|日下あき|margaret",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  448259: "",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|講談社|2023|日常|后宫|午夜心旋律",
  465306: "",
  489256: "异世界|漫画|退队流|NTR|战斗还行",
  499874: "AVG|PC|悬疑|ADV|游戏|NS|STEAM|小高和刚|幼驯染|RPG|Switch",
  505457: "轻小说|2024",
  538438: "恋爱|少女|奇幻|国漫|漫画|国产|中国|已完结|乙女向",
  542118: "PC|推理|NS|2025"
};
