// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.3.3.698
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|OP|少年JUMP",
  9849: "ヤマイ|KANAN",
  11992: "轻小说|機巧少女は傷つかない|后宫|海冬レイジ|人机|机娘|校园|夜夜|幻想|るろお|机巧少女不会受伤",
  24596: "冨樫義博|漫画|富坚义博|HunterXHunter|坑|热血|JUMP|少年漫画|少年JUMP|集英社|富奸",
  36599: "",
  112396: "漫画|搞笑|百合|日常|ユキヲ|邪神与厨二病少女|人外娘|血腥|COMICメテオ|邪神|萝莉",
  134663: "朝森瑞季|漫画|已完结|性感娇妻玛莉亚|VITAMAN|成年コミック|工口|长篇|恋爱|漫画系列|2009",
  140704: "已完结|青年漫画|漫画系列|限制|全21卷|八月薫|漫画|R18",
  141549: "漫画|工口|R18|青年漫画|已完结|漫画系列|成年コミック",
  167732: "漫画|异世界|小说改|转生|馬場翁|穿越|かかし朝浩|爽文|轻小说改|练级|奇幻",
  185741: "漫画|龙珠|日本|連載中|鸟山明|拯救世界|とよたろう|战斗|热血|Vジャンプ|特兰克斯",
  185875: "漫画|漫画系列|永生|吸血鬼|奇幻|人外",
  196164: "漫画|成田良悟|2016|讲谈社|恋爱|已完結|日本漫画|狗粮|講談社|已完结|2010s",
  198591: "漫画|卖肉|异世界|奇幻|后宫|R18|战斗|佐藤健悦|穿越|連載中|吸奶",
  215198: "Galgame|AVG|游戏|PC|文字ADV",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|异世界|转生|R18|KADOKAWA",
  230858: "漫画|格斗|奇幻|梅村真也|动作|战斗|2017|アジチカ|漫画系列|コアミックス|日本",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|JUMP|少年漫画|芥見下|週刊少年ジャンプ",
  247623: "轻小说|异世界|狗粮|勇者|妹|小说系列|角川スニーカー文庫|实妹|隐居|日常|ざっぽん",
  285452: "吉田秋生|漫画|日常|一般向漫画|系列|小学館|少女漫|生活|治愈|2019|漫画系列",
  288241: "FTG|PS4|STEAM|格斗|PC|NS|ACT|游戏|续作|arcsystem|2020",
  290456: "漫画|轻小说改|奇幻|异世界|战斗|小说改|轻改|2019|阿倍野ちゃこ|漫画系列|SE",
  296466: "漫画|后宫|搞笑|恋爱|集英社|校园|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  302956: "漫画|异世界|小说改|凤傲天|日常|轻小说改|长寿种|连载中|日本|漫画系列|B漫",
  306272: "漫画|2020|奇幻|NAOE|BLコミック|战斗|漫画系列|BL|耽美|一般向",
  306292: "小说改|漫画系列",
  307237: "漫画|体育|热血|运动|竞技|滑冰|つるまいかだ|励志|2020|日本|講談社",
  308778: "轻小说|间谍|竹町|战斗|小说系列|小说|日本轻小说|系列|热血|2020",
  314591: "伊藤明弘|漫画|漫画系列|日本漫画|战斗|已完结|1993|枪械漫画|全3卷",
  315767: "漫画|末世|治愈|2020|さいとー栄|公路|系列|原创|漫画系列|后末日|连载中",
  317530: "羊おじさん倶楽部|同人|百合|Galgame|短篇|2020|全年龄|PC|AVG|雰囲気がいい|游戏",
  318351: "RPG|HRPG|黄油|同人|萝莉|RPGMaker|R18|U-ROOM|2020|PC|怀孕",
  319309: "漫画|安田佳澄|科幻|悬疑|連載中|2020|青年漫画|活下去|智斗|マンガ|反乌托邦",
  324366: "漫画|2020|小说改|恶役千金|女性向|百合|宫廷|恶役令嬢|灵魂互换|大女主|女性主人公",
  324416: "漫画|恋爱|后宫|日常|2021|搞笑|多女主|内藤マーシー|党争|日本",
  326058: "异世界|转生|恶役千金|漫画系列|漫画|搞笑|2020|白黒|ニコニコ漫画",
  327286: "講談社|悬疑|推理|剧情|系列|漫画|漫画系列",
  332298: "小说改|恋爱|漫画|漫画系列|2021|日漫|荻原沙優",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  337561: "Galgame|NanaWind|2024年|奶子|废萌|分割商法|巨乳|ADV|PC|2024-06|GPT机翻",
  349845: "漫画系列|搞笑|漫画|小说改|异世界",
  361988: "漫画|校园霸凌|致郁|奇幻|タイザン5|短篇|外星人|2021|科幻|萝莉|少年JUMP+",
  369847: "漫画|科幻|末世|废土|岩中治生|2022|废土风|冒险|灾难|日本|女性主人公",
  375007: "漫画|日常|后宫|小说改|刀剑神域|单行本|没啥好看",
  403551: "漫画|恋爱|奇幻|漫画系列|ミトガワワタル|日本|集英社|已完结|系列|搞笑|原创",
  409285: "漫画|校园|小说改|爱情|重来人生|穿越|日常|たん旦|一般向|奇幻|慶野由志",
  432211: "漫画|猎奇|小说改|百合|一般向|轻小说|漫画系列|白毛",
  433234: "漫画|搞笑|性转|大武政夫|萝莉|2023|KADOKAWA|战斗|养女儿|系列|ハルタオルタ",
  440323: "Galgame|妹|海豹社|拔作|白毛|あざらしそふと|纯爱|PC|白裤袜|2023|密语",
  449498: "FTG|PS5|2024|PC|arcsystem|PS4|游戏|NS",
  483860: "2024",
  484776: "百合|轻小说|入間人間|扭曲|师生|出轨|校园|反伦常|恋爱|2024|胃痛",
  501493: "",
  509334: "设定集",
  534727: "Galgame|纯爱|汉化|iMel|变身|PC|2025|R18|奇幻|魔法少女|萌拔",
  536498: "日本|小说|轻小说|web文|2023"
};
