// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.28.50
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  31972: "漫画|安倍夜郎|美食|治愈|深夜食堂|人生百态|生活|单元剧|料理|小学館|日本",
  32491: "漫画|丧女|日常|谷川ニコ|搞笑|百合|不管我怎么去想我不受欢迎这件事都是你们的错!|后宫|校园|漫画系列|2011",
  104586: "Vocaloid|GUMI|164",
  143372: "茶太|同人|2015|日向そら",
  178988: "2016|同人|album|M3-37",
  209535: "漫画|异世界|性转|轻改|すえみつぢっか|穿越|小说改|2016|搞笑|性转换|漫画系列",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|日本漫画|少女漫画|山下知子|一般向漫画|FEELYOUNG|系列",
  225427: "漫画|駕籠真太郎|短篇集|猎奇|太田出版|1995|日本漫画|R18|艺术漫画|エロ|全一卷",
  231163: "漫画|异世界|轻改|奇幻|2017|进化|中曽根ハイジ|轻小说改|丘野優|漫画系列|小说改",
  254651: "雪広うたこ|漫画|一迅社|一般向|侦探|BL|漫画系列|日本漫画|推理|男人|BL2018",
  282735: "漫画|后宫|异世界|轻小说改|恋爱|工口|小島紗|R18|小说改|穿越|奇幻",
  285114: "漫画|奇幻|治愈|樋口彰彦|搞笑|講談社|历史|漫画系列|百合|日常|2019",
  287428: "漫画|春輝|卖肉|忍者|漫画系列|R18|系列|奇幻|青年漫画|擦边球|色情",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  297267: "漫画|恋爱|党争|吉河美希|搞笑|2020|講談社|周刊少年magazine|週刊少年マガジン|日漫|妹",
  306272: "漫画|2020|奇幻|NAOE|战斗|BLコミック|漫画系列|月刊Gファンタジー|一般向|BL",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|日本|糟糕|原创",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  368804: "漫画|战斗|奇幻|講談社|2022|热血|裏那圭|漫画系列|原创|废品",
  370565: "卖肉|漫画|后宫|恋爱|杀必死|漫画系列|小说改|待エロ|色|月刊ドラゴンエイジ|神月洸壱",
  372612: "漫画|奇幻|战斗|轻小说改|异世界|大叔|乍藤和樹|师徒|漫画系列|小说改|连载中",
  391432: "漫画|后宫|卖肉|奇幻|小说改|异世界|一般向|擦边球|校园|日常|搞笑",
  391665: "百合|国漫|漫画|恶役千金|刺猬猫阅读|恋爱|断S|赤色|国产|条漫|中国",
  409402: "百合|漫画|ウオズミアミ|2022|恋爱|漫画ウオズミアミ|NTR|人妻|日本漫画|连载中|系列",
  433251: "泛Vocaloid",
  457574: "泛Vocaloid",
  457575: "泛Vocaloid",
  488880: "百合|漫画|2024|やとさきはる|甜|搞笑|講談社|恋爱|喜剧|コミックDAYS|美食",
  490753: "百合|漫画|异世界|2024|玉崎たま|GL|コミック百合姫|原创|連載中|奇幻|マンガ",
  515527: "RPG|炼金工房|PC|PS5|游戏|2025|PS4|NS|PS|JRPG",
  529432: "falcom|ARPG|NS2|伊苏|游戏|2025|7.5|JRPG|2025+|RPG",
  567647: "奇幻|漫画|吸血鬼|恋爱|少年|连载中|日本|原创|コトヤマ|周刊少年"
};
