// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.07.56
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  30211: "漫画|后宫|卖肉|浜田よしかづ|战斗|热血|怪怪守护神|格斗|肉|搞笑|鬼神",
  54461: "漫画|丸尾末広|猎奇|丸尾末广|全一卷|1984|2003|黑暗|人物|青林工芸舎|青年漫画",
  89143: "漫画|戸流ケイ|タカヒロ|月刊ビッグガンガン|外传|虐妹子|斩妹之瞳|战斗|漫画系列|マンガ",
  193081: "漫画|百合|博|校园|少女|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|日本",
  221296: "和月伸宏|漫画|集英社|少年漫画|2017|ジャンプSQ.|日本漫画|漫画系列|2026-01|黑碕薰|战斗",
  222548: "羅川真里茂|BL|白泉社|BLコミック|花とゆめ|1998",
  238972: "轻小说|小说|转生|松浦|日本|奇幻|已完结|角川BOOKS|异世界|屎|2018",
  254406: "数码宝贝|PC|PS4|Switch|NS|AVG|2019|异世界|2022|digimon|SLG",
  262170: "漫画|搞笑|異世界|穿越|反套路|异世界|殆ど死んでいる|2018|恋爱|精灵|傲娇",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|2021|集英社|JUMP|日本",
  342254: "漫画|藤本タツキ|短篇|藤本树|青春|2021|意犹未尽|集英社|京阿尼|短篇漫画|日本",
  382828: "漫画|小说改|R18|奇幻|卖肉|调教|宫能|后宫|轻小说改|连载中|转生",
  392134: "漫画|卖肉|标签:エロ系|エロ|漫画系列|类型:漫画|系列|标签:待改|日漫|一般向",
  419228: "百合|漫画|ムロマキ|KADOKAWA|画集|漫画单卷|校园|真百",
  426395: "日本|漫画|系列|小说改|已完结",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|小学馆|卖肉|脑洞",
  442107: "轻小说|中西鼎|2023|小说|校园霸凌|ガガガ文庫|成年コミック|7.5|复仇|2025",
  442220: "漫画|百合|tsuke|いのり。|一迅社|コミック百合姫|恶役千金|2023",
  464644: "",
  475239: "轻小说|师生",
  483478: "漫画",
  484353: "轻小说|有象利路|小说系列|小说|2023|恋爱|连载中|狗粮|奇幻|系列",
  513140: "轻小说|凪",
  560497: "百合|轻小说|小说系列|网游|系列|エリーゼ|小说|日本",
  582005: "漫画|日本|2025|芥见下下|集英社|岩崎优次|战斗|日漫|少年|2026|2026-01",
  598205: ""
};
