// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.28.65
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  5418: "TypeMoon|奈須きのこ|Galgame|魔法使いの夜|Type-Moon|型月|PC|AVG|蘑菇使いの坑|GAL|小山广和",
  24410: "小说|虚渊玄|轻小说|黑帮|小说系列|广江礼威",
  65045: "轻小说|后宫|丈月城|盟约的利维坦|完结|插图|小说系列|恋爱|战斗|奇幻|已完结",
  65458: "少女漫画|漫画|白泉社|あきづき空太|恋爱|少女漫|2006|LaLa|少女|秋月空太|奇幻",
  162127: "漫画|性转|百合|伪娘|恋爱|もこやま仁|TS|已完结|伪百合|ヤングエース|2015",
  185804: "FTG|BLAZBLUE|自带格斗的galgame|PC|PS4|ARC|ARCSYSTEMWORKS|STEAM|Galgame|ASW|NS",
  193081: "漫画|博|校园|百合|少女|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|日本",
  227176: "女装|Galgame|キャラメルBOX|伪娘|PC|のり太|2018|嵩夜あや|银发少女（？）|汉化|雰囲気がいい",
  229644: "漫画|治愈|亲情|浅野りん|美食|和菓子|2016|恋爱|KADOKAWA|漫画系列|连载中",
  297341: "轻小说|小说系列|奇幻|舔狗之汪",
  303186: "漫画|赤坂アカ|偶像|横槍メンゴ|转生|悬疑|恋爱|集英社|2020|党争|日本",
  307858: "PC|STEAM|沙盒|2020|XSX|模拟|游戏|神作|奇幻|抄袭",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  323040: "漫画|タヤマ碧|偶像|KPOP|2020|韩团|日本文化趋势观察|日本|新潮社|系列|原创",
  325008: "漫画系列|已完结|全4卷",
  380821: "漫画|恋爱|校园|阿賀沢紅茶|2022|搞笑|少年ジャンプ＋|辣妹|集英社|系列|日本",
  406468: "漫画|搞笑|恋爱|2022|战斗|集英社|千葉侑生|杀手|连载中|原创",
  441435: "Roguelike|横版|ACT|国产|STEAM|PC|动作|2024|独立游戏|单机|Windows",
  449498: "FTG|2024|arcsystem|PS5|PC|游戏|ARC|NS|PS4",
  451364: "時雨沢恵一|轻小说|奇幻|小说系列|短篇小说|公路文",
  451585: "战争|漫画|TS|性转|异世界|恋爱|2023|BL|魔法|まさきたま|KADOKAWA",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|午夜心旋律",
  462533: "漫画|恋爱|战斗|杀手|黑暗|暴力|連載中|2024|大瀬戸陸|分镜爽|黑道",
  468342: "小说|方丈贵惠|推理|方丈貴恵|短篇集",
  486053: "阿泉来堂|小说|系列",
  488392: "推理|魔法少女|悬疑|2025|ADV|AVG|PC|Galgame|STEAM|百合|游戏",
  498299: "轻小说|恋爱|塩本",
  532479: "小说|连载文",
  557439: "百合|调教|漫画|轻小说|单行本|2025|犬甘あんず",
  558657: "Galgame|Laplacian|全年龄|緒乃ワサビ|游戏|ADV|霜降|2025"
};
