// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.2.25.955
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|OP|少年JUMP",
  21418: "漫画|战舰|人工智能|ArkPerformance|苍蓝钢铁的琶音|萝莉|画工赞|热血|动画化|诉述故事能力赞|科幻",
  68509: "特兰克斯|鸟山明|资料书|¬|画集系列",
  114189: "漫画|恋爱|校园|山本崇一朗|搞笑|狗粮|甜|日常|2013|小学馆|闪光弹",
  132067: "漫画|城平京|推理|恋爱|片瀬茶柴|悬疑|鬼神|講談社|2015|少年マガジンR|奇幻",
  134663: "朝森瑞季|漫画|已完结|性感娇妻玛莉亚|VITAMAN|成年コミック|工口|长篇|恋爱|漫画系列|2009",
  140704: "已完结|青年漫画|漫画系列|限制|全21卷|八月薫|漫画|R18",
  141549: "漫画|工口|R18|青年漫画|已完结|漫画系列|成年コミック",
  180060: "漫画|搞笑|公主|奇幻|熊之股鍵次|魔王|小学馆|欢乐向|在魔王城说晚安|2016|欢乐",
  182434: "漫画|超能力|推理|悬疑|るーすぼーい|校园|智斗|古屋庵|2016|斗智|无能的奈奈",
  213924: "卖肉|漫画|搞笑|女教师|恋爱|年上|御姐|蘇募ロウ|週刊ヤングジャンプ|校园|講談社",
  215198: "Galgame|AVG|游戏|PC|文字ADV",
  218701: "漫画|异世界|轻小说改|小说改|轻改|战斗|穿越|转生|日常|2017|日本",
  221460: "CLOCKUP|Galgame|昏式龍也|钟表社|PC|硬核浪漫|狂气|2017|GAL|阿久津亮|ADV",
  226660: "Galgame|秋之回忆|5pb.|Memories-off|GAL|纯爱|最终章|MO|秋之回憶|2018|PC",
  240256: "漫画|恋爱|桜井のりお|校园|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  262884: "漫画|异世界|轻小说改|小说改|后宫|2018|奇幻|异世界转生|恋爱|潮里潤|漫画系列",
  267399: "漫画|搞笑|冒险|末世|丧尸|高田康太郎|2018|僵尸|麻生羽吕|小学館|麻生羽呂",
  269615: "Galgame|秋之回忆|5pb.|最終作|Memories_off|GAL|NS|PS4|5pb|PSV|FD",
  277134: "漫画|恐怖|猎奇|战斗|萝莉|近藤憲一|病娇|2019|惊悚|灵异|集英社",
  282708: "漫画|异世界|后宫|轻改|轻小说改|冒险|小说改|2019|漫画系列|茂村モト|奇幻",
  285452: "吉田秋生|漫画|日常|一般向漫画|系列|小学館|少女漫|生活|治愈|2019|漫画系列",
  296466: "漫画|后宫|搞笑|恋爱|集英社|校园|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  301904: "漫画|搞笑|奇幻|异世界|小说改|轻小说改|2019|轻改|神经病|温馨|るれくちぇ",
  307237: "漫画|体育|热血|运动|竞技|滑冰|つるまいかだ|励志|2020|日本|講談社",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  312057: "漫画|小说改|转生|纯爱|柚アンコ|轻改|奇幻|少女漫|漫画系列|异世界|轻小说改",
  314591: "伊藤明弘|漫画|漫画系列|日本漫画|战斗|已完结|1993|枪械漫画|全3卷",
  321062: "轻小说|野村美月|悬疑|推理|恋爱|小说系列|小说|日本|連載中|2020|日本轻小说",
  324416: "漫画|恋爱|后宫|日常|2021|搞笑|多女主|内藤マーシー|党争|日本",
  327286: "講談社|悬疑|推理|剧情|系列|漫画|漫画系列",
  332202: "Galgame|CLOCKUP|2021|昏式龍也|PC|游戏|ADV|のりざね|2021-08|拔作|さいとうよしえ",
  348344: "漫画|BL|2021|悬疑|惊悚|モクモクれん|耽美|克系|KADOKAWA|BL漫画|日本漫画",
  364960: "craftwork|長岡建蔵|Galgame|狂气|GAL|AVG|旭|猎奇|2022|PC|はましま薫夫",
  373629: "漫画|金田陽介|2022|校园|マガジンポケット|講談社|异世界|奇幻|讲谈社|漫画系列|魔法",
  375801: "师生|なかだまお|开大车|漫画|一般向|反差萌|漫画系列",
  377121: "漫画|辣妹|恋爱|魚住さかな|搞笑|のりしろちゃん|校园|日常|漫画系列|一般向|系列",
  386043: "漫画|百合|科幻|冒险|蒸汽朋克|黒イ森|島崎無印|2022|集英社|生化人|末世后",
  390675: "漫画|日常|恋爱|搞笑|社畜|地主|2022|月刊ビッグガンガン|欢乐|月刊BIGGANGAN|漫画系列",
  399501: "漫画|后宫|异世界|卖肉|福利|工口|zunta|2022|原创|月刊ドラゴンエイジ|日漫",
  403551: "漫画|恋爱|奇幻|漫画系列|ミトガワワタル|日本|集英社|已完结|系列|搞笑|原创",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|系列|連載中|周刊少年JUMP",
  414879: "漫画|搞笑|水無月すう|卖肉|2022|一般向|KADOKAWA|月刊少年エース|天降之物|续作|腰斩",
  433727: "漫画|格斗|热血|2023|百合|MAAM|卖肉|原创|小学馆|サンドロビッチ・ヤバ子|神展开",
  448518: "",
  457028: "轻小说|kakao",
  462533: "漫画|恋爱|战斗|杀手|黑暗|連載中|2024|大瀬戸陸|暴力|分镜爽|黑道",
  466687: "轻小说|四辻いそら",
  507670: "",
  529743: "画集",
  534727: "Galgame|纯爱|汉化|iMel|变身|PC|2025|R18|奇幻|魔法少女|萌拔"
};
