// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.29.87
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3177: "Galgame|方糖社|Lump_of_Sugar|萌木原|真白|萌え|废萌|PC|GAL|汉化|2008年7月",
  4923: "荒川弘|漫画|鋼の煉金術師|热血|等价交换|钢炼|少年漫画|牛姨|感动|战斗|少年GANGAN",
  20629: "轻小说|海冬レイジ|松竜|复数卷",
  25975: "戯画|丸户史明|丸戸史明|Galgame|2002|老物|剧情萌作|丸户大爷|18+|游戏|PC",
  26854: "米泽穗信|轻小说|推理|小说|青春|校园|小市民系列|日常推理|2004|米澤穂信|推理系",
  35410: "轻小说|海冬レイジ|复数卷|海冬|松竜|レイジ|小说系列",
  38736: "OST|水月陵|galgame|はつゆきさくら|初雪樱|fripSide|KOTOKO|2012|结衣菜|游戏",
  45234: "漫画|筱原千绘|女性向|篠原千絵|漫画系列|历史|少女漫画|恋爱|考据|漫画シリーズ|期待度1",
  117115: "漫画系列|少女漫画|成田美名子|日本漫画|青年漫画|MELODY|2001",
  134362: "国漫|搞笑|玄幻|漫画|福利|巨乳|恋爱|中国|国产|修仙|卖肉",
  175459: "国漫|米二|漫画|玄幻|热血|道|国产|中国|2015|战斗|国产漫画",
  186677: "minori|柚子奈ひよ|Galgame|科幻|机器人三定律|石原舞|きのこのみ|2017|汉化|トリノライン|PC",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|2016|黑丝",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  222583: "国漫|一淳|猎奇|漫画|复仇|国产漫画|古代|中长篇",
  240662: "漫画|职场|恋爱|狗粮|しろまんた|一迅社|2018|网络连载|萌|连载中|体型差",
  248630: "推理|今村昌弘|小说|推理小说|丧尸|悬疑|轻小说|2017|奇幻|日本|恋爱",
  270385: "异世界|转生|漫画系列|2018|恶役千金|搞笑|LaLa|恶役|冬夏アキハル|求求快更",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  288048: "漫画|异世界|穿越|冒险|复仇|轻改|鵜吉しょう|龙傲天|漫画系列|2019|轻小说改",
  295589: "轻小说|恋爱|校园|党争|御宮ゆう|角川スニーカー文庫|前任|小说系列|小恶魔|2019年|轻小",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  297179: "漫画|碧蓝航线|漫画系列",
  299943: "恋爱|芳文社|漫画系列|漫画|无聊",
  300938: "漫画|异世界|转生|生存|小林嵩人|求生|高难度|轻小说改|2019年|2019",
  303323: "漫画|日常|百合|成家慎一郎|表情包|萌|漫画系列|KADOKAWA|2020|搞笑|系列",
  323040: "漫画|タヤマ碧|偶像|KPOP|2020|韩团|日本文化趋势观察|日本|新潮社|系列|原创",
  326803: "轻小说|中国",
  327974: "国漫|中国",
  330139: "小说改|漫画|双穿门|轻小说改|倒卖|简单模式|奇幻|兽耳|漫画系列|异世界|弱智",
  330850: "漫画|奇幻|恋爱|一七八ハチ|冒险|亚人|纯爱|御姐x正太|KADOKAWA|色|2021",
  335281: "小说",
  335750: "漫画|后宫|恋爱|杀必死|卖肉|连载中|エロ|2021|原创|漫画系列|工口",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  348056: "百合|漫画|后宫|奥たまむし|恋爱|沙雕|漫画系列|2021|KADOKAWA|系列",
  351510: "漫画|国漫|中国|奇幻|科幻|日常|战斗|中国漫画|灵笼|罕见|2021",
  355164: "小说改|漫画系列|恋爱|异世界",
  357239: "",
  364521: "小说",
  379831: "擦边球|日常|卖肉|エロ|聊天|漫画|あちゅむち|漫画系列|系列|未完结漫画",
  404609: "漫画|后宫|一般向|糟糕|杀必死|校园|卖肉|漫画系列|画风不错|鬼畜|奇幻",
  414879: "漫画|水無月すう|搞笑|卖肉|2022|天降之物|已完结|KADOKAWA|月刊少年エース|一般向|日本",
  416868: "漫画",
  429256: "轻小说",
  433726: "漫画|一般向|小说改",
  438329: "漫画|小说改|恋爱",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  458514: "百合|漫画|日常|魔女|治愈|花|奇幻|2023|连载中|浜弓場双",
  459617: "漫画|校园|恋爱|魔物娘|眼亀|日常|2023|奇幻|漫画系列|芳文社|日本",
  467683: "",
  477849: "漫画|战斗|漫画系列",
  484347: "轻小说|伏見つかさ|TS|搞笑|性转|校园|小说|2024|兄妹|2024年|扶她",
  493495: "轻小说|百合|漫画",
  529662: "漆原雪人|Galgame|FrontWing|全年龄|PC|2025|ADV|妹|游戏|纯爱|待发售",
  537847: ""
};
