// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.1.8.567
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  505: "轻小说|谷川流|凉宫春日|SOS|长门有希|团长|校园|吐槽|萌神|2003|小说",
  3582: "漫画|科学超电磁炮|冬川基|鎌池和馬|百合|科幻|超能力系|月刊Comic电击大王|魔法|某科学的超电磁炮|月刊コミック電撃大王",
  16866: "Galgame|关西腔|废萌|のの赛高|leaf|幼驯染|萝莉|PC|幼馴染|雰囲気がいい|2006",
  24401: "漫画|后宫|萝莉|卖肉|幼女|丧失|未来计划|父X女|肉|178无收藏|关系有点乱",
  29218: "漫画|村上纪香|二战|仁医|历史|1990|系列|超長篇|漫画系列|42卷|剧情",
  49871: "漫画|Type-Moon|同人|Bすけ|搞笑|乱入|2012|日本漫画|搞笑漫画|月世界|搜索用",
  76578: "少女漫画|池山田刚|少女漫|运动|恋爱|年下|漫画|池山田剛",
  94644: "恋爱|漫画|少女向|完结|水泽惠",
  119650: "漫画|奇幻|治愈|樫木祐人|日常|百合|温暖|2012|哈库梅伊与蜜珂析|漫画系列",
  142869: "漫画系列",
  167732: "漫画|异世界|小说改|转生|馬場翁|穿越|かかし朝浩|爽文|轻小说改|练级|奇幻",
  168463: "漫画|游戏改|福利|黒龍眼|卖肉|2016|黑学姐黑屋子|饗庭淵|コミッククリア|恋爱|黑丝",
  187009: "漫画|国漫|战斗|奇幻|魔幻|吸血鬼|爱欧|Bloodline|漫画SHOW|童年|国产",
  188576: "漫画|恋爱|校园|飯田雪子|平尾アウリ|幽灵|小说改|漫画系列|マンガ|已完结|少女漫画",
  208886: "西尾維新|轻小说|小说系列|講談社|美少年|已完结|小说|系列|总|2015|美少年侦探团",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|限制|肉",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|日本漫画|山下知子|系列|日常|FEELYOUNG|一般向漫画",
  220773: "漫画|异世界|轻改|百合|奇幻|轻小说改|凤傲天|女性主人公|冒险|穿越|小说改",
  230297: "小川悦司|漫画|系列|料理|美食|日漫|少年漫画|漫画系列|竞技|料理漫画",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|少年漫画|JUMP|芥見下|週刊少年ジャンプ",
  248914: "漫画|轻小说改|奇幻|异世界|战斗|2017|小说改|数值龙傲天|滝乃大祐|画风|黑妹",
  249726: "漫画|冒险|父控|轻改|异世界|战斗|2018|轻小说改|漆原玖|父女|小说改",
  253720: "Galgame|拔作|とこはな|纯爱|WillPlus|动态CG|萌拔|女仆|猫村ゆき|GAL|PC",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  291344: "漫画|恋爱|高坂曇天|日常|KADOKAWA|漫画系列|日漫|杀手|一般向|恋人",
  296774: "falcom|PS4|轨迹系列|RPG|JRPG|英雄传说|2020|PC|剧情|轨迹|日本ファルコム",
  299096: "漫画|转生|奇幻|异世界|2019|凤傲天|搞笑|小说改|少女漫画|漫画系列|轻改",
  306051: "漫画|搞笑|恋爱|校园|TALI|KADOKAWA|青春|颜艺|已完结|系列|短篇",
  307800: "漫画|恋爱|少女漫画|少女|集英社|漫画系列|2020|マーガレット|日本|少女漫|日下あき",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  311891: "恋爱|漫画|短篇|JUMP|校园|青春|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  313666: "漫画|奇幻|七尾ナナキ|冒险|异世界|搞笑|2020|欢乐向|漫画系列|連載中|小学館",
  345272: "",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|系列|舒服|画风好",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|2022|喜剧|节操|讲谈社",
  384022: "类银河战士恶魔城|2024|PC|独立游戏|赤烛|国产|ACT|横版|台湾|STEAM|科幻",
  411466: "",
  440077: "漫画|日常|青春|恋爱|校园|偶像|矢寺圭太|日本|伪娘|治愈|女装",
  443706: "推理|紙城境介|轻小说|系列|小说|恋爱|学园|新本格|青春|纸城境介|有生之年",
  444392: "轻小说|2023|マキダノリヤ",
  448682: "国产|Galgame|历史|零创游戏|AVG|全年龄|萝莉|公路片|PC|GAL|2024",
  457341: "",
  462140: "轻小说|朝野始|ギャル",
  462200: "Galgame|AVG|meta|全年龄|PC|欢乐|短篇|同人|2023|纯爱|游戏",
  474806: "背筋|小说|恐怖|神鬼|全一卷",
  504703: "轻小说|百合|师生",
  513882: ""
};
