// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.04.05.39
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1908: "Type-Moon|奈须きのこ|Galgame|月姬|武内崇|月世界|PC|奈須きのこ|18X|GAL|同人",
  5510: "轻小说|小木君人|植田亮|重生|小说|后宫|萝莉|ガガガ文庫|一卷全|小说系列|系列",
  9404: "漫画|JUMP|田村隆平|搞笑|热血|恶魔|少年漫画|战斗|集英社|腰斩|恶魔奶爸",
  19795: "轻小说|西尾维新|世界系列|崩坏|西尾維新|妹控|文字游戏|小说|杀人|推理|2003",
  70754: "谷川流|轻小说|小说系列|メディアワークス",
  78964: "漫画|五十嵐あぐり|小林立|百合|麻将|麻雀|月刊ビッグガンガン|校园|咲-Saki-|外传|¬",
  86725: "山下和美|漫画|治愈|强力|完美|漫画系列|日本漫画|系列|超長篇|CC|未完结漫画",
  134684: "轻小说|异世界|藤ちょこ|性转|奇幻|战斗|厕纸|りゅうせんひろつぐ|小说|小説家になろう|マイクロマガジン社",
  144329: "漫画|生存|碧海景|黑暗|已完结|猎奇|恐怖猎奇|漫画系列|2014|和夏弘雨|講談社",
  154116: "历史|战争|漫画系列",
  190718: "漫画|山うた|短篇|恋爱|致郁|寿命论|2015|治愈|已完结|新潮社|奇幻",
  195702: "恋爱|少女|漫画|少女漫画|冒险|鈴木ジュリエッタ|日本漫画",
  196774: "漫画|大今良時|奇幻|讲谈社|週刊少年マガジン|2016|連載中|少年漫画|周刊少年magazine|大今良时|講談社",
  228146: "Galgame|顏艺社|ASa_Project|欢乐|废萌|ASaProject|石原舞|2018|幼なじみ|花澤さくら|纯爱",
  250535: "",
  257531: "少女漫画|漫画|少女|鈴木ジュリエッタ|日本漫画",
  268279: "藤本タツキ|漫画|战斗|邪道|热血|周刊少年JUMP|集英社|自由人|藤本树|2018|少年JUMP",
  295271: "轻小说|性转|战斗|小说系列|ショウセツ|异世界|web小说|热血|TS|我愿称之为厕纸|龙傲天",
  299585: "轻小说|奇幻|后宫|小说系列",
  305429: "漫画|旅行|寿命论|奇幻|治愈|山田鐘人|2020|小学館|勇者|周刊少年sunday|异世界",
  309218: "轻小说|二語十|奇幻|小说系列|MF文庫J|恋爱|2019|小说|うみぼうず|系列|后宫",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|青年",
  326694: "漫画|小说改|漫画系列|B漫|少女漫|异世界|恋爱|日本|日漫|已完结|系列",
  337040: "中国",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|KADOKAWA|燦SUN",
  368804: "漫画|战斗|奇幻|热血|講談社|原创|2022|裏那圭|连载中|日本",
  377761: "漫画|校园|恋爱|轻小说改|雨森たきび|小说改|败犬|いたち|搞笑|小学館|日本",
  378559: "マンガ",
  378773: "漫画|恋爱|战斗|2022|伪娘|超能力|搞笑|集英社|依田瑞稀|原创|日本",
  385739: "漫画|2021|とよ田みのる|小学館|校园|日常|漫画系列|职业|漫画家|小学馆|ゲッサン",
  389637: "轻小说|来栖夏芽|异世界",
  395193: "漫画|台湾|恋爱|青春|校园|姐弟|单相思|百合|中国|系列|社百",
  397403: "小说系列|Eve",
  410916: "漫画|本名ワコウ|卖肉|限制|一般向|糟糕|複数巻|サンデーうぇぶり|マンガ|色|小学館",
  411323: "マンガ|漫画|日本漫画|恋爱|少女漫画|搞笑",
  412640: "战斗|东立|台湾|雅绅",
  412646: "",
  420817: "百合|漫画|校园|暴力|扭曲|2023|くわばらたもつ|恋爱|一迅社|コミック百合姫|真百",
  431460: "漫画|科幻|加藤拓弐|战斗|废土|机器人|2023|妈妈|raw|原创|日本",
  435154: "轻小说|异世界|南野海風|校园|日本|系列|小说|奇幻|连载中|2021",
  448628: "Galgame|妹|萝莉|同人|R18|小波すず|ぱん|PC|高森奈津美|ADV|ぱんみみそふと",
  460878: "恋爱|伪娘|日常|反差|漫画|四爱|金沢真之介|BG|连载中|系列|漫画系列",
  490905: "轻小说|恋爱|織島かのこ|校园|纯爱|小说系列|2024|ただのゆきこ",
  497606: "百合|STEAM|AVG|游戏|全年龄|GL|VN|真百|PC",
  505451: "",
  510664: "轻小说",
  519667: "",
  526509: "八目迷|轻小说|时与四季|恋爱|奇幻|小说|青春|2025|纯爱|单行本|悬疑",
  542035: "",
  604329: "PC|ADV|NS|PS4|游戏|Galgame|2026|神椿",
  611212: "全年龄|Galgame|PC|游戏|ADV"
};
