// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.12.45
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  4923: "荒川弘|漫画|鋼の煉金術師|热血|等价交换|钢炼|少年漫画|牛姨|感动|战斗|少年GANGAN",
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|2005|北欧|战斗|幸村誠|热血",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  89062: "漫画|热血|阴阳师|助野嘉昭|战斗|恋爱|少年漫画|奇幻|2013|ジャンプSQ|搞笑",
  89419: "漫画|大久保圭|文艺复兴|少女漫画|ARTE|励志|月刊コミックゼノン|绘画|一般向漫画|艺术|连载中",
  105074: "Navel|Galgame|伪娘|女装|西又葵|鈴平ひろ|月に寄りそう乙女の作法|GAL|2014|大小姐|PC",
  136477: "CIRCUS|Galgame|2016|马戏团|初音岛|D.C.|PC|白长直|游戏|妹|GAL",
  146063: "轻小说|白鳥士郎|将棋|这本轻小说真厉害！|龙王的工作|萝莉|GA文庫|热血|空银子|2015|しらび",
  163966: "轻小说|异世界|奇幻|北山結莉|战斗|穿越|黑衣剑士|龙傲天|HJ文庫|转生|小说系列",
  168675: "奇幻|漫画|少女|搞笑|Comic|青春|漫画系列|B漫",
  175459: "国漫|米二|漫画|玄幻|热血|道|国产|中国|2015|战斗|国产漫画",
  177997: "轻小说|异世界|香月美夜|穿越|女主视角|种田|奇幻|女性主角|商业|椎名優|2015",
  211736: "",
  212189: "漫画|足球|体育|小林有吾|竞技|运动|小学館|2015|青春|体育漫画|热血",
  213503: "漫画|异世界|轻改|小说改|漫画系列|COMTA|2016|后宫|轻小说改|战斗|樋辻臥命",
  214007: "漫画|异世界|搞笑|安村洋平|反套路|穿越|鬼畜男主|社畜|剧情脱线|2016|欢乐向",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|少女漫画|日本漫画|山下知子|系列|日常|FEELYOUNG",
  221157: "RPG|同人|全年龄|PC|RPGMaker|RM|やかろ|2017|生肉|游戏|日本",
  223845: "漫画|搞笑|小说改|恶役千金|逆后宫|ひだかなみ|恋爱|山口悟|转生|轻小说改|一迅社",
  234489: "异世界|漫画|轻改|轻小说改|2017|穿越|小说改|九我山レキ|转生|漫画系列|战斗",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  241554: "漫画|异世界|小说改|美食|黑皮|轻小说改|穿越|日本漫画|恋爱|Manga|轻改",
  252958: "轻小说|异世界|复仇|龙傲天|穿越|小説家になろう|篠崎芳|厕纸|纯爱|福利|原创",
  254437: "百合|漫画|战斗|寿命论|奇幻|あおのなち|コミック百合姫|一迅社|2018|日本|战争",
  270112: "漫画|恶役千金|恋爱|小说改|轻改|吉村旋|搞笑|柚原テイル|异世界|2018|恶役",
  282324: "漫画|恋爱|轻改|小说改|KADOKAWA|草壁レイ|紙城境介|2019|日常|校园|轻小说改",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|原创|漫画系列",
  292902: "轻小说|裕夢|青春|校园|校园恋爱|弹珠汽水瓶里的千岁同学|恋爱|ガガガ文庫|2019|raemz|小说",
  298144: "百合|漫画|江島絵理|热血|竞技|搞笑|2020|コミックフラッパー|格斗游戏|校园|漫画系列",
  300270: "百合|轻小说|みかみてれん|竹嶋えく|欢乐|后宫|屑粉毛|搞笑|2020|恋爱|小说系列",
  301226: "漫画|搞笑|糸吉了一|漫画系列|2019|ニコニコ静画|父女|KADOKAWA|治愈|已完结",
  305282: "漫画|后宫|异世界|卖肉|轻小说改|轻改|R18|小说改|实用|限制|川田暁生",
  305872: "轻小说|误解系|厨力治国|搞笑|异世界|餅月望|欢乐多|时间回溯|迪化|WEB|小说",
  313079: "轻小说|异世界|穿越|系列|小说系列|转生|校园|恋爱",
  321869: "漫画|恋爱|轻改|忘年恋|東鉄神|搞笑|年上|2020|姐弟恋|漫画系列|小说改",
  324331: "漫画|漫画系列|异世界|轻小说改|小说改|没啥好看|龙娘",
  326686: "小说改|漫画|漫画系列|日本|异世界|已完结|转生|火葬场",
  329860: "轻小说|恋爱|校园|青春|電撃文庫|小说|2021年|小说系列|七菜なな|首饰花艺|党争",
  329957: "轻小说|ぶんころり|异世界|超能力|カントク|小说系列|缝合怪|小说|异世界转移|恋爱|2021",
  334762: "轻小说|科幻|電撃文庫|2021|恋爱|电击文库|小说系列|小说|菊石まれほ|SF|人与机械",
  338969: "百合|漫画|校园|听障|恋爱|くずしろ|2021|细腻|コミック百合姫|37|画风",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|小说系列|KADOKAWA",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  340469: "漫画|搞笑|小说改|江戸屋ぽち|漫画系列|轻改|コミックファイア|校园|2021|江ノ島アビス",
  349274: "漫画|小说改|异世界|穿越|奇幻|轻小说改|プレジ和尚|漫画系列|ぶんころり|轻改|日常",
  354130: "漫画|奇幻|2021|森下真|月刊少年マガジン|講談社|勇者|原创|漫画系列|搞笑|日常",
  375683: "漫画系列",
  376861: "漫画系列|异世界|一般偏无聊",
  388479: "漫画系列",
  389483: "漫画|异世界|厕纸|漫画系列|画工还行",
  398182: "轻小说|白毛|萝莉|小说系列|南野海风|龙傲天|日常|乡村振兴",
  420844: "轻小说",
  436747: "漫画|芳文社|日常|外传|2023|音乐|搞笑|Kirara|日本|日漫|くみちょう",
  443107: "漫画|重女|恋爱|职场|あきやま|搞笑|日常|2023|日本|青年|週刊ヤングジャンプ",
  457000: "轻小说|羊太郎|异世界|小说系列|2023",
  498299: "轻小说|恋爱|塩本",
  506640: "漫画",
  507999: "像素|纯爱|Galgame|视觉小说|短篇|雨|PC|游戏|雰囲気がいい|氛围|R18",
  514896: "轻小说|日本|小说|系列",
  525894: "轻小说|六海刻羽",
  552663: "Galgame|PC|游戏|ADV|NS"
};
