// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.06.29.71
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6604: "手塚治虫|漫画|少女漫画|1953|讲谈社|少女|手冢治虫|少女漫|已完结|講談社|漫画系列",
  25950: "皆川亮二|漫画|漫画系列|科幻|青年漫画|战斗|日本漫画|奇幻|系列|小学館",
  42845: "手塚治虫|漫画|手冢治虫|青年漫画|短篇|1970|系列|讽刺|70年代|全两卷|日本漫画",
  48058: "漫画|美食|长友健筛|王牌酒保|单元剧|调酒师|城安良嬉|清新|2004|已完结|長友健篩",
  64273: "光永康則|漫画|漫画系列|已完结|全20卷|吸血鬼|后宫？|怪物|公主|搜索用",
  77532: "恋爱|漫画|剧情",
  80379: "漫画|手塚治虫|儿童漫画|CC|コミックス|短|四格漫画|1946|日本漫画|短篇集",
  82058: "漫画|手塚治虫|1952|少年漫画|完结|搞笑|纸质书|漫画王|系列|西游记|漫画系列",
  86984: "漫画|手塚治虫|1974|CC|cxcx|搜索用|日本漫画|系列|奇幻|少年漫画",
  89244: "漫画系列|科幻|鈴木みそ|日常|职场|科普|已完结",
  92725: "漫画|手塚治虫|手冢治虫|历史漫画|历史|1981|系列|日本漫画|BIGCOMIC|漫画系列|87",
  98253: "漫画|后宫|恋爱|异世界|めいびい|卖肉|指环王|奇幻|已完结|穿越|2014",
  113759: "漫画|手塚治虫|吸血鬼|搞笑|手冢治虫|漫画系列",
  114766: "手塚治虫|漫画|爱情|青春漫画|反战|週刊少年キング|全三卷|系列|日本|短篇|奇幻",
  121380: "漫画|搞笑|冒险|卖肉|变态|战斗|スバルイチ|奇幻|智障|勇者死了|欢乐向",
  132555: "漫画|Type-Moon|Fate|游戏改|間桐桜|战斗|奇幻|2015|漫画系列|タスクオーナ|动画推销成功",
  136607: "漫画|小野夏芽|已完结|政治|推理漫画|2013|悬疑|オノ・ナツメ|公款旅游|短篇|百合",
  138475: "漫画|恋爱|奇幻|あいだいろ|地缚少年花子君|月刊GFantasy|少女漫画|日本|月刊Gファンタジー|连载中|2014",
  151068: "漫画|手塚治虫|漫画系列|已完结|系列|手冢治虫|典藏版|纸质书|秋田書店|版本|东贩",
  152731: "漫画|科幻|短篇|漫画系列|已完结|系列",
  170868: "漫画|美食|Type-Moon|Fate|TAa|WEB漫画|日常|KADOKAWA|2016|只野まこと|漫画系列",
  199446: "漫画|穿越|小说改|2017|药傲天|异世界|轻小说改|KADOKAWA|連載中|高野聖|漫画系列",
  211379: "漫画|国漫|台湾|国产|少年漫画|中国|周显宗|周顯宗|台漫",
  211410: "漫画|周显宗|国漫|中国|台漫|周顯宗",
  239508: "漫画|轻改|后宫|种田|穿越|异世界|剣康之|内藤騎之介|2018|小说改|轻小说改",
  241896: "恋爱|漫画|少女|蒼木スピカ|怪兽|人外|少女漫画|漫画系列|人兽|少女漫|奇幻",
  274148: "漫画|手冢治虫|手塚治虫|科幻|青年漫画|漫画系列|讽刺|SF|神作|1971|1980",
  274629: "BL|漫画|春園ショウ|BL漫画|漫画系列|校园|恋爱|日漫|2019|春园ショウ|KADOKAWA",
  275445: "漫画|推理|田村由美|小学館|月刊flowers|2017|连载中|思考|一般向漫画|日本漫画|青年",
  293427: "漫画|异世界|后宫|轻改|搞笑|月見隆士|转生|漫画系列|开挂|小说改|真后宫",
  296466: "漫画|后宫|搞笑|恋爱|校园|集英社|沙雕|野澤ゆき子|2019|中村力斗|日本",
  306272: "漫画|2020|奇幻|NAOE|战斗|BLコミック|漫画系列|耽美|一般向|BL",
  342547: "漫画|轻改|转生|小说改|2021|少女|漫画系列|轻小说改|异世界|凤傲天|奇幻",
  353235: "连载中|2025-07|漫画改|日本|漫画|漫画系列|系列|海贼王",
  391396: "漫画系列|都市|科幻|R18|悬疑|透明|战斗|异能|漫画|猎奇|黑道",
  396405: "漫画|大正浪漫|群像|漫画系列|电波|生活|饴石|文艺",
  398073: "漫画|小说改|黑柿子|治愈|恋爱|武富智|黑暗|致郁|系列|漫画系列|日本",
  406440: "漫画|2022|艺术|漫画系列|类型:漫画|标签:待改|日本漫画|BL漫画|ぱらり",
  408796: "漫画|魔法|血腥|猎奇|七沢またり|2022|堤りん|黑暗|战斗|历史相关|漫画系列",
  409402: "百合|漫画|ウオズミアミ|2022|恋爱|NTR|漫画ウオズミアミ|人妻|日本漫画|漫画系列|原创",
  434176: "",
  446434: "奇幻|漫画|异世界|RPG|冒险|2023|日常|アッチあい|搞笑|游戏|KADOKAWA",
  456375: "漫画|战斗|轻改|科幻|外传|魔禁|百合|strelka|日本|鎌池和馬",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|日本|奇幻",
  473405: "漫画|乐队|日常|少年JUMP+|集英社|2024|百合|音乐|日本|搞笑|校园",
  490402: "游戏|STEAM|PC|冒险|美少女",
  499056: "漫画|伪娘|已完结|日本|2024|cos|原创|伪百合|7.2|畫功好|酷儿角色",
  506124: "恋爱|漫画|校园|日常|爱情|小动物|原创|黑长直|系列|连载中|日本",
  510155: "漫画|週刊少年ジャンプ|西修|集英社|魔法|宇佐崎しろ|2024|奇幻|原创|日本|连载中",
  510299: "漫画|集英社|战斗|日本|2024|原创|JUMP|热血|系列|2026-01|连载中",
  517268: "",
  554149: "漫画|系列|原创|日本漫画|连载中|2025-12|講談社|一般向|日本",
  587237: "国产|悬疑|Galgame|民俗|AVG|全年龄|PC|游戏|Windows"
};
