// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.1.10.1032
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  505: "轻小说|谷川流|凉宫春日|SOS|长门有希|团长|校园|吐槽|萌神|2003|小说",
  1713: "漫画|八木教广|大剑|奇幻|热血|CLAYMORE|百合|集英社|漂亮大姐姐|八木教広|战斗",
  2763: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|热血|荒木飞吕彦|战斗|集英社|1987|神设定|超能力鼻祖",
  3582: "漫画|科学超电磁炮|冬川基|鎌池和馬|百合|科幻|超能力系|月刊Comic电击大王|魔法|某科学的超电磁炮|月刊コミック電撃大王",
  16866: "Galgame|关西腔|废萌|のの赛高|leaf|幼驯染|萝莉|PC|幼馴染|雰囲気がいい|2006",
  24401: "漫画|后宫|萝莉|卖肉|幼女|丧失|未来计划|父X女|肉|178无收藏|关系有点乱",
  29218: "漫画|村上纪香|二战|仁医|历史|1990|系列|超長篇|漫画系列|42卷|剧情",
  46627: "高山忍|漫画|奇幻|漫画系列|高山しのぶ|2008|少年漫画|日本漫画|ゼロサムWARD|ゼロサムオンライン",
  49871: "漫画|Type-Moon|同人|Bすけ|搞笑|乱入|2012|日本漫画|搞笑漫画|月世界|搜索用",
  52828: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|热血|战斗|集英社|荒木飞吕彦|1987|JUMP|超能力系",
  52967: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|热血|战斗|荒木飞吕彦|集英社|1989|超能力系|JUMP",
  52968: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|热血|荒木飞吕彦|战斗|集英社|超能力系|1992|JUMP",
  52969: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|热血|荒木飞吕彦|集英社|战斗|1995|超能力系|JUMP",
  119650: "漫画|奇幻|治愈|樫木祐人|日常|百合|温暖|2012|哈库梅伊与蜜珂析|漫画系列",
  142869: "漫画系列",
  144257: "Galgame|拔作|エスクード|妹|escude|后宫|实用|遠野そよぎ|废萌|快餐游戏|Escu:de",
  167732: "漫画|异世界|小说改|转生|馬場翁|穿越|かかし朝浩|爽文|轻小说改|练级|奇幻",
  168463: "漫画|游戏改|福利|黒龍眼|卖肉|2016|黑学姐黑屋子|饗庭淵|コミッククリア|恋爱|黑丝",
  188576: "漫画|恋爱|校园|飯田雪子|平尾アウリ|幽灵|小说改|漫画系列|マンガ|已完结|少女漫画",
  204354: "轻小说|相沢沙呼|轻文学|小说",
  208146: "漫画|恋爱|后宫|春場ねぎ|校园|講談社|搞笑|五等分の花嫁|2017|党争|炒股",
  208886: "西尾維新|轻小说|小说系列|講談社|美少年|已完结|小说|系列|总|2015|美少年侦探团",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|限制|肉",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|日本漫画|山下知子|系列|日常|FEELYOUNG|一般向漫画",
  220773: "漫画|异世界|轻改|百合|奇幻|轻小说改|凤傲天|女性主人公|冒险|穿越|小说改",
  229515: "漫画|恋爱|校园|狗粮|ナナシ|2017|講談社|不要欺负我、长瀞同学|抖S|日常|上岸",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|少年漫画|JUMP|芥見下|週刊少年ジャンプ",
  247867: "漫画|恋爱|小说改|轻改|2018|爱情|しめさば|生活|足立いまる|KADOKAWA|角川",
  248914: "漫画|轻小说改|奇幻|异世界|战斗|2017|小说改|数值龙傲天|滝乃大祐|画风|黑妹",
  249726: "漫画|冒险|父控|轻改|异世界|战斗|2018|轻小说改|漆原玖|父女|小说改",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  291344: "漫画|恋爱|高坂曇天|日常|KADOKAWA|漫画系列|日漫|杀手|一般向|恋人",
  296774: "falcom|PS4|轨迹系列|RPG|JRPG|英雄传说|2020|PC|剧情|轨迹|日本ファルコム",
  299096: "漫画|转生|奇幻|异世界|2019|凤傲天|搞笑|小说改|少女漫画|漫画系列|轻改",
  303186: "漫画|赤坂アカ|横槍メンゴ|偶像|转生|悬疑|恋爱|集英社|2020|党争|週刊ヤングジャンプ",
  306051: "漫画|搞笑|恋爱|校园|TALI|KADOKAWA|青春|颜艺|已完结|系列|短篇",
  306812: "百合|漫画|恋爱|校园|后宫|轻小说改|2020|日常|みかみてれん|漫画系列|むっしゅ",
  310763: "百合|漫画|コミック百合姫|一迅社|エロ|伊月クロ|漫画系列|2020|工口|ガチ百合|露点",
  311891: "恋爱|漫画|短篇|JUMP|校园|青春|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  313379: "百合|漫画|コミック百合姫|舞蹈|2020|漫画系列|うたたね游|校园|一迅社|Manga|细腻",
  313666: "漫画|奇幻|七尾ナナキ|冒险|异世界|搞笑|2020|欢乐向|漫画系列|連載中|小学館",
  324865: "漫画|人妻|卖肉|2021|漫画系列|节操|エロ|一般向|假面骑士W",
  326654: "漫画|开大车|恋爱|轻改|异世界|日本漫画|正太|战斗|黑暗|小说改|漫画系列",
  345272: "",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|系列|舒服|画风好",
  363195: "漫画|日常|恋爱|校园|GAL|卖肉|浪费作画|げしゅまろ|辣妹|漫画系列|倒贴",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|2022|喜剧|节操|讲谈社",
  392095: "漫画|恋爱|小说改|校园|纯爱|漫画系列|2022|轻小说改|轻改|网络连载|講談社",
  408902: "百合|漫画|深海紺|恋爱|短篇|校园|2023|细腻|漫画系列|OGYAAA!!|青春",
  420196: "正太|小说改|漫画|日常|奇幻|搞笑",
  421548: "战斗|异世界|漫画|齋藤勁吾|奇幻|萝莉|热血|2023|KADOKAWA|搞笑|致郁",
  439204: "漫画|异世界|2023|奇幻|杉浦次郎|轻改|厕纸系列|うめ丸|コミックウォーカー|轻小说改|搞笑",
  443706: "推理|紙城境介|轻小说|系列|小说|恋爱|学园|新本格|青春|纸城境介|有生之年",
  444392: "轻小说|2023|マキダノリヤ",
  448682: "国产|Galgame|历史|零创游戏|AVG|全年龄|萝莉|公路片|PC|GAL|2024",
  457341: "",
  462200: "Galgame|AVG|meta|全年龄|PC|欢乐|短篇|同人|2023|纯爱|游戏",
  474806: "背筋|小说|恐怖|神鬼|全一卷",
  496783: "轻小说|恋爱",
  499988: "轻小说|青葉寄|一卷全|青春|2024|伤痛|GAGAGA文库|轻文学|小说|疯狂|完结",
  513882: ""
};
