// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.30.82
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  24410: "小说|虚渊玄|轻小说|黑帮|小说系列|广江礼威",
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|北欧|2005|战斗|幸村誠|热血",
  65045: "轻小说|后宫|丈月城|盟约的利维坦|完结|插图|小说系列|恋爱|战斗|奇幻|已完结",
  65458: "少女漫画|漫画|白泉社|あきづき空太|恋爱|少女漫|2006|LaLa|少女|秋月空太|奇幻",
  162127: "漫画|性转|百合|伪娘|恋爱|もこやま仁|TS|已完结|伪百合|ヤングエース|2015",
  185804: "FTG|BLAZBLUE|自带格斗的galgame|PC|PS4|ARC|ARCSYSTEMWORKS|STEAM|Galgame|ASW|NS",
  193081: "漫画|博|校园|百合|少女|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|日本",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|電撃マオウ|漫画系列",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|肉|限制",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  227176: "女装|Galgame|キャラメルBOX|伪娘|PC|のり太|2018|嵩夜あや|银发少女（？）|汉化|雰囲気がいい",
  229644: "漫画|治愈|亲情|浅野りん|美食|和菓子|2016|恋爱|KADOKAWA|漫画系列|连载中",
  234273: "少女漫画|漫画|恋爱|校园|森野萌|少女漫|狗粮|2017|少女|花野井君和相思病|漫画系列",
  241623: "音游|国产|手游|独立游戏|PC|PeroPeroGames|STEAM|MUG|2018|Android|心动网络",
  249482: "漫画|搞笑|天原|穿越|万太郎|エロ|2017|欢乐|系列|哲学|贞操观",
  297341: "轻小说|小说系列|奇幻|舔狗之汪",
  303186: "漫画|赤坂アカ|偶像|横槍メンゴ|转生|悬疑|恋爱|集英社|2020|党争|日本",
  307858: "PC|STEAM|沙盒|2020|XSX|模拟|游戏|神作|奇幻|抄袭",
  308287: "漫画|神鬼|悬疑|怪谈|奇幻|ぬじま|萝莉|小学館|2019年|漫画系列|女性主人公",
  311833: "百合|漫画|异世界|轻改|轻小说改|2020|奇幻|小说改|南高春告|鴉ぴえろ|KADOKAWA",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  323040: "漫画|タヤマ碧|偶像|KPOP|2020|韩团|日本文化趋势观察|日本|新潮社|系列|原创",
  330222: "少女|漫画|B漫|漫画系列|里村",
  356907: "ASaProject|Galgame|颜艺社|渣男|废萌|幼驯染|2022|大学|纯爱|白毛|搞笑",
  380821: "漫画|恋爱|校园|阿賀沢紅茶|2022|搞笑|少年ジャンプ＋|辣妹|集英社|系列|日本",
  406468: "漫画|搞笑|恋爱|2022|战斗|集英社|千葉侑生|杀手|连载中|原创",
  409684: "漫画|音乐|百合|摇滚|校园|乐队|热血|日本|连载中|数摇|青年",
  441435: "Roguelike|横版|ACT|国产|STEAM|PC|动作|2024|独立游戏|单机|Windows",
  451364: "時雨沢恵一|轻小说|奇幻|小说系列|短篇小说|公路文",
  451585: "战争|漫画|TS|性转|异世界|恋爱|2023|BL|魔法|まさきたま|KADOKAWA",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|午夜心旋律",
  460536: "",
  468342: "小说|方丈贵惠|推理|方丈貴恵|短篇集",
  469394: "PC|PS5|ACT|XSX|游戏|白金|STEAM|龙珠|CC2|童年|格斗",
  477850: "漫画|后宫|搞笑|恋爱|石坂リューダイ|2024|师生|限制|校园|卖肉|福利",
  486053: "阿泉来堂|小说|系列",
  488392: "推理|魔法少女|悬疑|2025|ADV|AVG|PC|Galgame|STEAM|百合|游戏",
  509948: "炼金工房|JRPG|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|STEAM|NS",
  532479: "小说|连载文",
  548132: "PC|NS|打越钢太郎|悬疑|ADV|游戏|NS2|2025|STEAM|推理",
  557439: "百合|调教|漫画|轻小说|单行本|2025|犬甘あんず",
  558657: "Galgame|Laplacian|全年龄|緒乃ワサビ|游戏|ADV|霜降|2025"
};
