// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.14.56
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  103085: "漫画|四格|クール教信者|搞笑|芳文社|恋爱|小森拒不了！|2012|酷教信者|喜剧",
  122272: "百合|漫画|校园|恋爱|高嶋ひろみ|日常|2010|社团|xxxと加瀬さん|牵牛花与加濑同学。|漫画系列",
  130584: "若木民喜|漫画|日常|西点|腰斩|漫画系列|周刊|料理|美食|美食漫画",
  130998: "漫画|异世界|穿越|冒险|小说改|轻改|关于我转生后成为史莱姆的那件事|2015|川上泰樹|轻小说改|小说系列",
  138475: "漫画|恋爱|奇幻|あいだいろ|地缚少年花子君|月刊GFantasy|少女漫画|月刊Gファンタジー|日本|2014|连载中",
  183756: "漫画|搞笑|恋爱|山本アリフレッド|神经病|理科生坠入情网，故尝试证明。|纯爱|2016|日常|校园|计算机科学",
  188271: "漫画|岩本ナオ|少女漫画|短篇|已完结|少女|全一巻|單卷|超短篇|2014|マンガ",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|漫画系列|電撃マオウ",
  207479: "漫画|美食|治愈|小山愛子|小学館|生活|2016|日常|2016年|連載中",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|2017|週刊少年チャンピオン|日常|日本|热血",
  212189: "漫画|足球|体育|小林有吾|竞技|运动|小学館|2015|青春|体育漫画|热血",
  215285: "漫画|异世界|轻改|后宫|恋爱|战斗|2016|白米良|RoGa|小说改",
  225513: "漫画|青年|久世岳|日常|搞笑|漫画系列|成人向|一迅社|真实|青年漫画|中村悠一",
  242942: "漫画",
  248141: "漫画|异世界|轻改|龙傲天|转生|小说改|漫画系列|轻小说改|穿越|战斗|奇幻",
  248885: "漫画|异世界|龙傲天|2018|納都花丸|爽文|轻改|小说改|轻小说改|概念神|藤孝剛志",
  248914: "漫画|轻小说改|异世界|奇幻|战斗|2017|小说改|数值龙傲天|滝乃大祐|黑妹|画风",
  265151: "漫画|异世界|轻改|后宫|无双|真綿|小说改|转生|智商低|穿越|浪费设定",
  272611: "漫画|青春|校园|恋爱|高松美咲|講談社|2018|月刊アフタヌーン|日常|少女漫画|成长",
  272951: "漫画|异世界|转生|小说改|战斗|轻改|皇ハマオ|开挂无敌|轻小说改|漫画系列|日本",
  279136: "漫画|异世界|小说改|轻改|恋爱|龙傲天|漫画系列|轻小说改|总|B漫|吐了",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  279877: "漫画|搞笑|美食|奇幻|春原ロビンソン|集英社|喜剧|ひらけい|沙雕|2019|日常",
  283417: "百合|漫画|入间人间|柚原もけ|校园|安达与岛村|小说改|恋爱|入間人間|2019|清新",
  285100: "漫画|搞笑|异世界|外传|尖端|小说改|系列|toku|日本|已完结|轻改",
  297597: "漫画|性转|轻改|异世界|小说改|搞笑|轻小说改|奇幻|2019|漫画系列|战斗",
  306253: "漫画|异世界|2019|漫画系列|新潮社|とうろう|原创|魔王|マンガ|意义|くらげバンチ",
  307607: "漫画|异世界|左藤真通|网游|奇幻|搞笑|2020|游戏|战斗|連載中|講談社",
  311289: "漫画|网游|战斗|轻小说改|冒险|週刊少年マガジン|不二涼介|2020|热血|轻改|奇幻",
  314528: "同人|全年龄|STEAM|iOS|PS4|2020|悬疑|短篇|纯爱|Galgame|PC",
  317612: "漫画|卖肉|女拳|漫画系列|2021|月刊コミックゼノン|黑暗|看不下去|7.3|悬疑",
  318135: "漫画|异世界|穿越|轻小说改|2020|儿戏|小说改|种田|マガジンポケット|漫画系列|游戏",
  318611: "漫画|战斗|魔法|异世界|大森藤ノ|奇幻|青井聖|漫画系列|热血|2020|小说改",
  319012: "漫画|战斗|鈴木祐斗|周刊少年JUMP|杀手|2020|搞笑|日本|日常|JUMP|週刊少年ジャンプ",
  325588: "异世界|漫画|烈海王|漫画系列|格斗|刃牙|外传|秋田书店|刃牙外传|战斗|秋田書店",
  333519: "小说改|漫画|异世界|开挂无敌|漫画系列|龙傲天|穿越|战斗|魔法|奇幻",
  340073: "日漫|小说改|漫画系列",
  341315: "死亡游戏|NS|PS4|r|Galgame|PS5|AVG|小鳥遊ゆめ|生肉|库存|2022-01",
  342106: "漫画|板垣巴留|2021|搞笑|秋田書店|連載中|热血|漫画系列|マンガ|画风",
  343477: "漫画|恋爱|吸血鬼|吉河美希|搞笑|2021|一般向|漫画系列|异性恋",
  352392: "漫画|恋爱|假小子|伪男|2021|蒼川なな|欢乐|男装丽人|搞笑|漫画系列|伪郎",
  361987: "漫画|エロ|卖肉|小说改|冒险|漫画系列|R18|2021|NTR|奇幻|18X",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|講談社|三簾真也",
  392095: "漫画|恋爱|校园|小说改|轻小说改|纯爱|漫画系列|2022|轻改|講談社|网络连载",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|连载中|杀手|日本",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|卖肉|小学馆|神展开",
  440077: "漫画|校园|青春|日常|恋爱|偶像|矢寺圭太|女装|连载中|先看|在追",
  449427: "漫画|战斗|搞笑|怪兽|小学馆|ヨシアキ|2023|日本|变身|原创|科幻",
  452349: "漫画|周刊少年JUMP|热血|战斗|集英社|日本|日漫|2023|连载中|复仇|外薗健",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|原创",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|奇幻|日本",
  464543: "少女|少女漫画|漫画|伪郎",
  545203: "",
  573899: "牛尾憲輔|OST|电锯人|2025"
};
