// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.11.88
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  94928: "少女漫画|漫画|春田なな|校园|恋爱|少女|少女漫|春田菜菜|日漫|少女マンガ|男二控",
  149172: "漫画|坂本眞一|历史|2015|青年漫画|社会|集英社|黑暗|坂本真一|中篇|系列",
  241011: "治愈|日常|漫画|一般向|桜井海|2018|日本漫画|pixivコミック|ガンガンpixiv|toku",
  243198: "美食|竞技",
  259816: "漫画|棒球|运动|少年JUMP+|竞技|みかわ絵子|2018|热血|集英社|体育漫画|搞笑",
  272768: "漫画|Type-Moon|2019|fgo|游戏改|系列|日本|一迅社|漫画系列|Fate|奇幻",
  277134: "漫画|恐怖|猎奇|战斗|萝莉|近藤憲一|病娇|2019|惊悚|灵异|集英社",
  301622: "轻小说|小说系列|已完结|全2卷|少女|双葉社|恋爱药|魔女",
  315918: "轻小说|小说系列|转生|ハム男|异世界",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|智斗|活下去|反乌托邦|青年",
  324366: "漫画|小说改|恶役千金|2020|女性向|百合|日本|宫廷|连载中|女性主人公|少女漫画",
  326699: "小说改|漫画系列",
  326724: "恋爱|漫画|校园|喜剧|搞笑|原创|久世蘭|逆推|2021|杀必死|连载中",
  330004: "韩漫|韩国|转生|BG|小说改|漫画|恋爱|女性向|条漫|萌系|欧风",
  342547: "漫画|轻改|转生|小说改|轻小说改|异世界|凤傲天|漫画系列|少女|奇幻|女仆",
  355148: "小说改|2021|柊一葉|轻小说改|じろあるば|漫画系列|小学館|主仆|忠犬男|异世界|日漫",
  362541: "轻小说|奇幻|战斗|电击文库|小说系列|2021|電撃文庫|ロケット商会|异世界|热血|连载中",
  364863: "恋爱|漫画|校园|日常|小说改|2022|佐伯さん|芝田わん|漫画系列|轻小说改|邻家天使漫画",
  368830: "漫画|漫画系列|小学館|2022",
  417220: "恋爱|漫画|小学館|2023|少女漫画|原创|连载中|已完结|系列|日漫BG|古代",
  433315: "漫画|日漫|萌系|古典欧风|幼女·萝莉|日本|小说改|女主|欧风",
  437954: "漫画|百合|こるせ|科幻|冒险|轻百合|女性主人公|姐妹|战斗|热血|日漫",
  445870: "轻小说|误解系|搞笑|异世界|后宫|日本|小说|系列|急川回レ",
  447990: "漫画|奇幻|集英社|搞笑|校园|2023|日本|少年|抓鬼|男子高中生日常|一般向",
  465682: "小说改|漫画|兄妹|日本|宅系|一般向|妹系|系列|连载中",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  485030: "小说|轻小说|青年|异世界|贞操逆转",
  492066: "",
  505445: "小说",
  524513: "轻小说|恋爱|扭曲|性爱分离|青梅竹马|雲雀湯|校园|约炮|青春|日常|R18",
  530731: "漫画|日本|奈叶|系列|都築真紀|连载中|川上修一|2025|百合|魔炮",
  535916: "日本|小说|轻小说|てるゆーぬ",
  542030: "轻小说|2024|へいろー|カボチャマスク|奇幻|战斗|恋爱|异世界|web文",
  556816: "轻小说|电击文库|2025|星野星野|校园|恋爱|后宫",
  562638: "轻小说|百合|扭曲|恋爱|2025|校园|日本|电击文库|小说|出轨|Akeo",
  573423: "轻小说|葵关南|恋爱喜剧|深崎暮人|恋爱|日本|小说|青春|2025|误解系|系列",
  631540: ""
};
