// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.18.58
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  48816: "格斗|PS3|leaf|ARCADE|ADV|街机|游戏|FTG|Aquaplus|PC",
  66368: "漫画|恋爱|集英社|アミュー|少年漫画|音乐|古筝|热血|竞技|桜アミュー|连载中",
  70196: "百合|Galgame|病娇|姐妹|双子|eye★phon|R18|汉化|ADV|PC|GAL",
  84495: "Galgame|FLAT|纯爱|さかき傘|恋爱观测|我们仍未知道那年望远镜里的纸条是谁放的|GAL|愿得一人心|2014|PC|妹",
  134064: "漫画|搞笑|校园|Gファンタジー|漫画系列|连载中|田中まい|★マンガ|日常|重复|☆主条目",
  217552: "漫画|推理|古风|轻改|小说改|少女漫画|日向夏|2017|恋爱|少女|搞笑",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  236926: "漫画|恋爱|畑健二郎|狗粮|日常|2018|总之就是非常羡慕|周刊少年sunday|爱情|恋爱漫画|总之就是非常酸",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  241491: "PS4|ACT|传颂之物|Aquaplus|leaf|2018|割草无双|PC|游戏|PS5",
  292589: "漫画|推理|2019|系列|小说改|漫画系列|悬疑|京極夏彦|连载中|志水アキ|收藏",
  305429: "漫画|旅行|寿命论|奇幻|治愈|山田鐘人|2020|小学館|勇者|周刊少年sunday|异世界",
  307237: "漫画|运动|体育|滑冰|热血|励志|竞技|日本|つるまいかだ|2020|原创",
  317314: "漫画|日常|百合|日本|兴趣类|连载中|2019|原创|渋谷圭一郎|系列|科普",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  328376: "漫画|校园|エロ|福利|卖肉|搞笑|色情|糟糕|ムラタコウジ|漫画系列|2020",
  336906: "漫画|恋爱|日常|namo|科普|职业|幼驯染|治愈|日本|KADOKAWA|漫画系列",
  340296: "漫画|轻小说改|漫画系列|异世界|凤傲天|小说改|2021|恋爱|日本|连载中",
  346060: "漫画|奇幻|2021|江野スミ|江野朱美|战斗|神鬼|漫画系列|猎奇|怪异|热门",
  347553: "BLコミック|漫画|BL|BL漫画|赤河左岸|2021|リブレ|实体|短篇|腐|耽美",
  348056: "百合|漫画|后宫|奥たまむし|恋爱|沙雕|漫画系列|2021|KADOKAWA|日本",
  355555: "恋爱|漫画|校园|青春|三香見サカ|講談社|日本|2021|画风好|漫画系列|连载中",
  373153: "漫画|后宫|稲葉みのり|恋爱|成年コミック|2022|NTR|职场|离婚|绿帽男？",
  373629: "漫画|2022|金田陽介|奇幻|异世界|校园|講談社|マガジンポケット|讲谈社|原创|日本",
  385970: "ACT|PC|PS5|恋爱模拟|恋爱|STEAM|PS4|Galgame|韩国|StudioSai|2023",
  413366: "Galgame|シルキーズプラス|きみしま青|拔作|PC|纯爱|2024|悬疑|ADV|续作|悬疑推理",
  416714: "Cygames|FTG|PC|格斗|2023|PS5|碧蓝幻想|PS4|STEAM|日系",
  433526: "BL|日本|漫画|系列|连载中",
  453555: "漫画|已完结|小说改|恋爱|校园|奇幻|日本|7.8|轻小说|系列",
  466654: "轻小说|白井ムク|2023|小说|连载文|双子",
  467924: "",
  487772: "漫画|日常|搞笑|石ト悠良|百合|2024|系列|已完结|忍者|腰斩|原创",
  493365: "性转|漫画|校园|三角恋|TS|2024|百合|日本|恋爱|系列",
  509947: "JRPG|falcom|RPG|轨迹系列|PC|2025|游戏|PS5|STEAM|英雄传说|NS",
  509955: "传说系列|JRPG|RPG|PS5|2025|PC|PS4|Switch|NS|普通游戏",
  510108: "百合|漫画|伊月クロ|日本|焔すばる|日野アラシ|焼肉定食|結野ちり|本子|成年コミック|校园",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  522187: "Galgame|后宫|SLG|妹|拔作|PC|R18|同人|游戏|纯爱|动态CG",
  522390: "whirlpool|Galgame|FD|近江谷宥|拔作|生肉|废萌|2024|鷹乃ゆき|兽耳|纯爱",
  545934: "Galgame|ensemble|伪娘|魔法少女|女装|PC|R18|废萌|Windows|ADV|游戏",
  547340: "日本|漫画|短篇集|系列",
  569608: "游戏|NS2|ACT|PC|NS",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4",
  579477: "PC|PS5|2025|JRPG|RPG|XSX|NAMCO|游戏|NS"
};
