// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.04.62
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6210: "BL|渡瀬悠宇|BL漫画|大正|漫画|虐|耽美|BE|亂倫|渡濑悠宇|獵奇",
  6673: "高永ひなこ|BL|女王受|BL漫画|耽美|恋する暴君|傲娇受|漫画|绿川光|掰彎|海王社",
  120999: "轻小说|野村美月|轻小说系列|系列|看书计划",
  198385: "百合|漫画|tMnR|コミック百合姫|百合姬|爱上嫂子|虐|漫画系列|社会人|家庭伦理|嫂子文学",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  234032: "漫画|マンガ",
  241026: "轻小说|后宫|复仇|月夜涙|小说系列|调教|垃圾|角川スニーカー文庫|异世界|厕纸|web小说",
  292001: "漫画|漫画系列|养女儿|轻改|轻小说改|日常|异世界|美食|奇幻|搞笑|小说改",
  292874: "BL|はらだ|BL漫画|BLコミック|漫画|2019|竹書房|漫画系列|连载中|触手|日本漫画",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  306812: "百合|漫画|恋爱|后宫|校园|轻小说改|2020|日常|みかみてれん|むっしゅ|漫画系列",
  307793: "恋爱|漫画|漫画系列|已完结",
  308152: "百合|漫画|七路ゆうき|みかみてれん|三角关系|已完结|2020|校园|恋爱|漫画系列|奇幻",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|漫画系列|女装",
  330890: "漫画|漫画系列",
  336628: "轻小说|恋爱|青梅|七烏未奏|傲娇|校园|纯糖|講談社|小说|小说系列",
  355540: "恋爱|漫画|校园|日常|一般向|已完结|漫画系列|青年|逆推|日本|完结",
  360070: "漫画|恋爱|小说改|后宫|轻小说改|2021|日常|御宮ゆう|香澤陽平|前任|倒贴",
  361988: "漫画|校园霸凌|致郁|奇幻|短篇|タイザン5|外星人|2021|日本|科幻|萝莉",
  367226: "恋爱|漫画|少女漫|偶像|少女|2021|少女漫画|搞笑|花とゆめ|白泉社|師走ゆき",
  377761: "漫画|校园|恋爱|いたち|雨森たきび|轻小说改|小说改|败犬|搞笑|小学館|日本",
  404495: "AVG|游戏|PC|同人|freegame|Web|DJ|2021|短篇",
  425921: "轻小说|恋爱|类型:轻小说|标签:待改",
  453555: "漫画|已完结|奇幻|日本|恋爱|校园|系列|小说改",
  489436: "轻小说|3pu",
  496474: "轻小说|香月美夜",
  499056: "漫画",
  509948: "炼金工房|JRPG|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|STEAM|NS",
  519645: "轻小说|小说系列|恋爱|白毛|日本|日常|2024|校园|系列|GA文庫|小说",
  519667: "",
  530159: "Fragaria|同人|Galgame|PC|游戏|STEAM|世界观|ADV|科幻|待发售",
  531887: "同人|NANTEDOW",
  537847: "轻小说|恋爱",
  562159: "Galgame|R18|废萌|2020|合集|Windows|纯爱|游戏|校园|ADV|NanaWind"
};
