// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.11.46
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|OP|少年JUMP",
  26033: "轻小说|吸血鬼|森田季節|已完结|尾崎弘宜|妹|插图|GA文庫|wiki|复数卷",
  29275: "轻小说|百合|遗作|绝笔|科幻|小说系列|角川书店",
  48678: "军事|科幻|潜艇|战争|漫画|海上自卫队|モーニング|講談社|川口开治|系列|超長篇",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  62130: "都築真紀|小説|小说|魔法少女奈叶|魔炮|2005|200x|日本小说-总|日本轻小说|ノベル",
  123263: "Novectacle|同人|AVG|PC|全年龄|GAL|生肉|一般向|悬疑|Galgame|縹けいか",
  180064: "漫画|年上|高田桂|腰斩|姐系|姐|KADOKAWA|奇幻|角川書店|兄弟|姐弟",
  201954: "",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  237704: "漫画|日常|钓鱼|小坂泰之|校园|搞笑|海洋|2017|科普|连载中|秋田書店",
  239254: "异世界|漫画|小说改|穿越|FUNA|百合|奇幻|轻小说改|轻改|モトエ恵介|2017",
  241623: "音游|国产|手游|独立游戏|PC|PeroPeroGames|STEAM|MUG|2018|Android|心动网络",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|つきや|日本|少女漫|连载中",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  299985: "漫画|异世界|NTR|卖肉|R18|穿越|小说改|轻改|NTL|奇幻|漫画系列",
  300431: "漫画|峰浪りょう|恋爱|青春|阴间|病娇|胃药|2020|青年漫|集英社|扭曲",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|未完结漫画|2020",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|糟糕|GAL|限制",
  328376: "漫画|校园|卖肉|福利|エロ|色情|搞笑|ムラタコウジ|糟糕|漫画系列|青春",
  336489: "百合|漫画|NTR|扭曲|岩見樹代子|コミック百合姫|2021|一迅社|恋爱|校园|日本",
  352808: "漫画|短篇|2020|眞藤雅興|奇幻|日漫|JUMP|漫画短篇|超短篇|2020年12月|单篇",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|日本|画风好|系列",
  373629: "漫画|金田陽介|2022|マガジンポケット|校园|异世界|講談社|奇幻|讲谈社|魔法|搞笑",
  377761: "漫画|校园|恋爱|いたち|小说改|轻小说改|雨森たきび|败犬|小学館|搞笑|2022",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|2022|节操|喜剧|日本",
  387177: "漫画|恋爱|校园|はぐはぐ|倒贴|上岸|漫画系列|JK|杀必死|NTR|JC",
  395984: "异世界|漫画|正太|种田流|奇幻|漫画系列|青色まろ|赤池宗|轻小说改|B漫|日本漫画",
  410916: "漫画|本名ワコウ|卖肉|一般向|限制|糟糕|已完结|NTR|マンガ|複数巻",
  414664: "漫画|卖肉|守月史貴|講談社|成年コミック|ヤンマガWeb|2023",
  424562: "",
  439727: "漫画|爱情|校园",
  439771: "漫画|异世界|小说改|奇幻|战斗|网游|なろう系|ながワサビ64|7.1|2021|异世界转生",
  441435: "Roguelike|ACT|横版|国产|STEAM|动作|PC|2024|独立游戏|单机|游戏",
  450650: "百合|漫画|コダマナオコ|2023|コミック百合姫|一迅社|2024|日语版|前线作战|姬恋双|20话以内",
  469394: "PC|PS5|ACT|XSX|游戏|白金|STEAM|龙珠|CC2|童年|格斗",
  499874: "小高和刚|打越钢太郎|PC|悬疑|ADV|AVG|战棋|SRPG|游戏|STEAM|NS",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  509948: "JRPG|炼金工房|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|NS|STEAM",
  527267: "PC|悬疑|游戏|ADV"
};
