// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.21.40
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3821: "绿川幸|治愈|漫画|白泉社|夏目友人帳|温暖画风|妖怪志|催泪弹|緑川ゆき|治愈系|怪谈",
  6133: "漫画|贞本义行|EVA|科幻|貞本義行|新世纪福音战士|1994|角川书店|漫画系列|角川|日本",
  16324: "福本伸行|漫画|热血|2000|无赖|孤立せよ|マンガ|日本漫画|人性|中篇",
  54168: "漫画|赤松中学|轻改|轻小说改|战斗|漫画系列|轻小说|奇幻|全16卷|日本|已完结",
  60285: "漫画|よしづきくみち|已完结|治愈|奇幻|マンガ|推荐治愈|2009|爱情|多卷漫画|科幻",
  78670: "漫画|棒球|中原裕|运动|2004|上代務|体育|智斗|小学馆|竞技|已完结",
  81127: "漫画|一色まこと",
  98114: "漫画|小学馆|永井豪|性启蒙|漫画系列|已完结|魔法少女|搞笑|变身",
  109978: "治愈|漫画|恋爱|搞笑|剧情|柴门文|已完结|漫画系列",
  110731: "漫画|恋爱|校园|小说改|渡航|伊緒直道|轻改|青春|2012|小学館|漫画系列",
  125225: "恋爱|漫画",
  126883: "漫画|一般向|日常|腰斩|小说改",
  134926: "小说系列",
  149421: "漫画|池野恋|1982|漫画系列|恋爱|少女漫|少女漫画|日本漫画|已完结|ribon",
  163879: "漫画|肉|たなかかなこ",
  169907: "漫画|日漫|小學館|超短篇|單卷",
  177064: "恋爱|漫画|校园|少女漫|漫画系列|作楽ロク|少女|搞笑|已完结|日本|全12卷",
  183647: "漫画|恋爱|校园|纯情辣妹|連載中|搞笑|第一次的Gal|纯爱|吐槽|マンガ|后宫",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  236624: "漫画|轻改|异世界|战斗|奇幻|轻小说改|2018|ありかん|小说改|日本",
  275361: "漫画|黑暗|复仇|异世界|小说改|勇者|2019|轻改|价值观扭曲|轻小说改|系列",
  285054: "百合|漫画|扭曲|猎奇|性癖|SM|恋爱|百合姫コミックス|一迅社|2019|校园",
  287385: "",
  289342: "漫画|科幻|轻改|战斗|增强现实|2019|纳米机器|赛博格|小说改|綾村切人|枪战",
  291882: "漫画|异世界|穿越|野田宏|若松卓宏|轻小说改|小学馆|轻改|搞笑|系列|战斗",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|漫画系列|2019|半月板損傷|穿越|ヒーローズ",
  300534: "漫画|漫画系列|异世界|策略|小说改|轻小说改|轻改|军事政治|2020|鳥羽徹|战斗",
  306888: "百合|漫画|小说改|异世界|コミック百合姫|恶役千金|恋爱|青乃下|2020|漫画系列|轻改",
  320214: "漫画|异世界|轻改|小说改|战斗|2020|网游|策略|穿越|奇幻|鉄田猿児",
  328235: "漫画|小说改|進行諸島|漫画系列|异世界|COIN|打斗很好|画功非常好|@|万解|8.2",
  341418: "漫画|搞笑|女儿|恋爱|系列|发糖|日本|机器人|2021|已完结|狗粮",
  360070: "漫画|恋爱|小说改|后宫|轻小说改|日常|2021|御宮ゆう|前任|香澤陽平|一般向",
  372172: "百合|漫画|川内|短篇集|日常|2卷|マンガ|漫画系列|短篇|青春|单行本",
  375683: "漫画系列",
  381864: "漫画|足球|运动|热血|講談社|金城宗幸|蓝色监狱|2022|漫画系列|卖腐|原创",
  398117: "漫画|文豪野犬|轻小说|外传|热血|漫画系列|春河35|已购漫画|王道|战斗",
  401449: "漫画",
  402824: "漫画|短篇集",
  403205: "漫画",
  409402: "百合|漫画|ウオズミアミ|2022|漫画ウオズミアミ|恋爱|NTR|人妻|日本漫画|GL|集英社",
  432211: "漫画|猎奇|百合|小说改|一般向|大逃杀|战斗|连载中|轻小说改|恶趣味|美少女",
  435772: "漫画|原创|系列|漫画系列|日本|连载中",
  454851: "漫画|后宫|卖肉|佐原玄清|校园|2023|穿越|奇幻|恋爱|一般向|漫画系列",
  456375: "漫画|轻改|科幻|战斗|外传|strelka|魔禁|百合|鎌池和馬|KADOKAWA",
  467935: "轻小说|萬屋久兵衛|桃子|絵葉ましろ",
  469146: "轻小说|甲田学人|奇幻|小说|校园|猎奇|2024|恐怖|小说系列|系列|悬疑",
  475241: "轻小说",
  492219: "",
  501181: "",
  505472: "轻小说|逢縁奇演|小说|恋爱|荻pote|奇幻|電撃文庫|校园|搞笑|KADOKAWA|青春",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  569608: "游戏|NS2|ACT|PC|NS",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4",
  570430: "PC|NS|JRPG|游戏|工作室|PS4|RPG|NS2|PS5",
  570431: "PS5|RPG|NS2|Switch|PC|游戏|PS4|工作室|NS|JRPG"
};
