// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.21.21
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  26942: "轻小说|擦边球|已完结|泰迪熊恶魔|AKUMAで少女|恶魔少女|换身|女流小说家|很有意思的样子|交换灵魂|无厘头",
  38925: "alcot|Galgame|桐谷华|燃，桐谷华，杏子御津，清水爱，远野そよぎ|中の人などいない！|GAL|欢乐|PC|萌|2012|汉化",
  41633: "轻小说|清水マリコ|一卷|田仓トヲル",
  73892: "轻小说|松山剛|一卷全|小说|科幻|雨雪冰三部曲|パセリ|2013|这本轻小说真厉害!|電撃文庫|单卷完",
  148464: "藤崎竜|集英社|漫画|小说改|田中芳樹|科幻|藤崎龙|連載中|系列|银河英雄传说|漫画系列",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|转生|异世界|R18|KADOKAWA",
  237342: "百合|漫画|猎奇|奇幻|小说改|怪谈|冒险|异世界|2018|悬疑|月刊少年ガンガン",
  245920: "漫画|花沢健吾|忍者|搞笑|无厘头|2018|欢乐向|講談社|連載中|绷|连载中",
  287723: "漫画|恋爱|吸血鬼|奇幻|コトヤマ|2019|小学館|那徜徉在夜晚的歌声|漫画系列|已完结|恋爱漫画",
  299227: "漫画|热血|战斗|集英社|周刊少年JUMP|戸塚慶文|奇幻|超能力|2020|恋爱|JUMP",
  300431: "漫画|峰浪りょう|恋爱|青春|阴间|病娇|胃药|2020|扭曲|青年漫|集英社",
  310827: "漫画|恋爱|日常|女仆|漫画系列|小学館|2020|原创|しょたん|B漫|纯爱",
  313766: "轻小说|小说",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|2020|未完结漫画",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  344647: "小说系列|已完结|全2卷",
  365699: "Galgame|伪娘|PC|女装|ensemble|生肉|2022-04|Go-1|2022|GAL",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|講談社|三簾真也",
  386098: "漫画|佐乃夕斗|集英社|神怪|2022|漫画系列|战斗|少年|少年漫画|日本",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|推理|日本漫画|連載中",
  427473: "集英社|漫画|杀手|2023|校园|搞笑|藤巻忠俊|柯南同款|日常|日漫|东立出版社",
  431560: "漫画|悬疑|服部未定|邪教|惊悚|恐怖|黑暗|已完结|2021|週刊漫画ゴラク|奇幻",
  433726: "漫画|一般向|小说改",
  460819: "漫画|日常|青年|生活|意识流|上班族|2023|小学馆|鍋倉夫|原创|平静",
  469081: "",
  483044: "",
  496527: "STEAM|AVG|PC|解谜|游戏|全年龄|云过|冒险",
  509947: "falcom|JRPG|RPG|2025|轨迹系列|PC|Switch|NS|PS5|游戏|待发售",
  511869: "背筋|小说|恐怖|2024",
  524576: "国产|Galgame|全年龄|视觉小说|电波|PC|meta|短篇|AVG|ADV|2024"
};
