// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.13.99
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  26033: "轻小说|吸血鬼|森田季節|已完结|尾崎弘宜|妹|插图|GA文庫|wiki|复数卷",
  29275: "轻小说|百合|遗作|绝笔|科幻|小说系列|角川书店",
  62130: "都築真紀|小説|小说|魔法少女奈叶|魔炮|2005|200x|日本小说-总|日本轻小说|ノベル",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  201954: "",
  239254: "异世界|漫画|小说改|穿越|FUNA|百合|奇幻|轻小说改|轻改|モトエ恵介|2017",
  241623: "音游|国产|手游|独立游戏|PC|PeroPeroGames|STEAM|MUG|2018|Android|心动网络",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|つきや|日本|少女漫|连载中",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  299985: "漫画|异世界|NTR|卖肉|R18|穿越|小说改|轻改|NTL|奇幻|漫画系列",
  300431: "漫画|峰浪りょう|恋爱|青春|阴间|病娇|胃药|2020|青年漫|集英社|扭曲",
  316809: "漫画|恋爱|美食|ハナツカシオリ|爱情|日常|講談社|日漫|2020|漫画系列|日本",
  320214: "漫画|异世界|轻改|2020|战斗|小说改|网游|策略|穿越|奇幻|漫画系列",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|糟糕|GAL|限制",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  336489: "百合|漫画|NTR|扭曲|岩見樹代子|コミック百合姫|2021|一迅社|恋爱|校园|日本",
  349866: "漫画|恋爱|小说改|倒贴|一般向|椀田くろ|氷高悠|日常|桃子|漫画系列|2022",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|日本|画风好|系列",
  373629: "漫画|金田陽介|2022|マガジンポケット|校园|异世界|講談社|奇幻|讲谈社|魔法|搞笑",
  377761: "漫画|校园|恋爱|いたち|小说改|轻小说改|雨森たきび|败犬|小学館|搞笑|2022",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|2022|节操|喜剧|日本",
  395984: "异世界|漫画|正太|种田流|奇幻|漫画系列|青色まろ|赤池宗|轻小说改|B漫|日本漫画",
  410916: "漫画|本名ワコウ|卖肉|一般向|限制|糟糕|已完结|NTR|マンガ|複数巻",
  414664: "漫画|卖肉|守月史貴|講談社|成年コミック|ヤンマガWeb|2023",
  424562: "",
  441435: "Roguelike|ACT|横版|国产|STEAM|动作|PC|2024|独立游戏|单机|游戏",
  450650: "百合|漫画|コダマナオコ|2023|コミック百合姫|一迅社|2024|日语版|前线作战|姬恋双|20话以内",
  469394: "PC|PS5|ACT|XSX|游戏|白金|STEAM|龙珠|CC2|童年|格斗",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  509948: "JRPG|炼金工房|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|NS|STEAM",
  520060: "ARPG|PC|游戏|PS5|XSX"
};
