// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.25.38
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19597: "伪娘|漫画|神吉|女装少年|2011|わぁい!|一迅社|瑞穂|恋爱|コミックス|成年コミック",
  38807: "漫画|岩明均|历史|战争|2003|古希腊|青年漫画|坑|军事|传记|講談社",
  40064: "安达充|漫画|棒球|月刊少年SUNDAY|2012|校园|运动|あだち充|恋爱|小学馆|日本漫画",
  48094: "漫画|千叶彻弥|热血|拳击|明日之丈|周刊少年magazine|1968|体育|竞技|运动|讲谈社",
  72689: "1986|寺沢大介|漫画|週刊少年マガジン|料理|美食|日本漫画|竞技|美食漫画",
  88870: "漫画|山下和美|一般向漫画|剧情|日本漫画|漫画系列|单元剧|日漫|人性|奇幻|系列",
  130998: "漫画|异世界|穿越|冒险|轻改|小说改|关于我转生后成为史莱姆的那件事|2015|川上泰樹|轻小说改|小说系列",
  131504: "漫画|后宫|战斗|恋爱|神崎かるな|校园|2014|漫画系列|已完结|黒神遊夜|推荐格斗",
  134910: "沙村広明|漫画|职场|搞笑|广播|講談社|2014|月刊アフタヌーン|沙村广明|漫画大赏2016|连载中",
  138986: "恋爱|漫画|小说改|田口一|もっつん|全5卷|已完结|2011|后宫|福利|短篇",
  159865: "漫画|萝莉|穿越|异世界|轻改|后宫|奇幻|网游|2014|漫画系列|KADOKAWA",
  172279: "漫画|漫画系列",
  180932: "漫画|搞笑|轻小说改|番外|漫画系列|完结|惠惠|日常|素晴|小说改|日本",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|週刊少年チャンピオン|2017|日常|热血|日本",
  211665: "漫画|异世界|穿越|轻改|骸骨骑士|奇幻|漫画系列|龙傲天|骨王小号|战斗|轻小说",
  221531: "漫画|搞笑|官方同人|2017|柯南|名探偵コナン|かんばまゆこ|小学館|犯罪|日常|青山刚昌",
  225278: "漫画|小说改|漫画系列",
  227220: "漫画|成田良悟|奇幻|反穿|群像剧|超能力|藤本新太|战斗|2017|异世界|漫画系列",
  227347: "連打一人|茶道|漫画|ジャンプ改|全4卷|吾为利休",
  236624: "漫画|轻改|异世界|战斗|轻小说改|奇幻|2018|ありかん|小说改|B漫",
  236926: "漫画|恋爱|畑健二郎|狗粮|日常|2018|总之就是非常羡慕|周刊少年sunday|爱情|恋爱漫画|总之就是非常酸",
  239656: "异世界|小说改|漫画系列|奇幻|人外|后宫|人外娘|母猩猩",
  247798: "漫画|异世界|小说改|抽卡|轻改|穿越|晴野しゅー|后宫|2018|コミックライド|轻小说改",
  252452: "漫画|宮永麻也|可爱|奇幻|已完结|日本|旅行|治愈|原创|公路|公路片",
  266498: "漫画|足球|講談社|2018|金城宗幸|ノ村優介|运动|週刊少年マガジン|体育漫画|中二|连载中",
  267222: "漫画|恐怖|搞笑|泉朝树|2018|百合|泉朝樹|日本漫画|ニコニコ静画|KADOKAWA|角川书店",
  270324: "漫画|治愈|森川侑|日常|一般向|2018|少女漫画|漫画系列|日本漫画|女性向|熊猫",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  286140: "漫画|悬疑|乃木坂太郎|犯罪|颜艺|恋爱|小学館|2019|漫画系列|现代|已完结",
  292706: "异世界|漫画|小说改|战斗|漫画系列",
  293664: "漫画|恋爱|轻改|小说改|2019|校园|二丸修一|井冬良|KADOKAWA|后宫|轻小说",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  307237: "漫画|运动|体育|滑冰|热血|竞技|励志|つるまいかだ|日本|2020|原创",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|科幻|少年向|連載中",
  322890: "漫画|搞笑|战斗|脑洞|2020|桜谷シュウ|猎奇|日本漫画|漫画系列|コミプレ",
  328640: "漫画|国产|网文改|中国",
  328644: "中国",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  338544: "漫画|搞笑|杀手|南勝久|2021|战斗|日常|黑道|青年漫画|犯罪|扮猪吃老虎",
  342106: "漫画|板垣巴留|2021|連載中|搞笑|漫画系列|热血|秋田書店|マンガ|画风",
  348689: "日常|マンガ|KADOKAWA",
  352114: "恋爱|漫画|吸血鬼|狗粮|2020|校园|奇幻|套路|已完结|2021年|正太",
  352392: "漫画|恋爱|伪男|假小子|蒼川なな|2021|欢乐|男装丽人|搞笑|系列|伪郎",
  357433: "轻小说|小说系列|2021|立川浦々|立川浦",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|漫画系列|校园|講談社|日本|原创|nonco",
  397619: "漫画|异世界|B漫|漫画系列|欢乐|龙傲天|2022|冬月光輝|た介|comicブースト",
  406468: "漫画|搞笑|恋爱|2022|战斗|集英社|千葉侑生|连载中|杀手|漫画系列",
  409817: "漫画|短篇集|大白小蟹|一般向|日本漫画|リイド社|2022|一般向漫画|全一卷|短篇|コミックス",
  426302: "百合|漫画|2023|完结|漫画系列|恋爱|20话以内|图书|百合漫画|コミックス|4.5分",
  433727: "漫画|格斗|热血|百合|2023|MAAM|卖肉|原创|サンドロビッチ・ヤバ子|小学馆|神展开",
  486509: "",
  492138: "轻小说|百合|2024|SF|奇幻|童话|公路文|轻百合|小说|电击文库|小说系列",
  515936: "漫画|国漫|中国漫画",
  551639: "Galgame|百合|全年龄|和风传奇"
};
