// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.07.57
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6496: "漫画|PEACH‐PIT|蔷薇少女|哥特|奇幻|战斗|2002|PEACH-PIT|哥特萝莉|漫画系列|少女漫画",
  26944: "石黒正数|漫画|推理|科幻|神展开|短篇|伦理|石黑正数|2011|講談社|黑暗",
  31469: "漫画|矢吹健太朗|后宫|卖肉|校园|喜剧|長谷見沙貴|搞笑|2006|集英社|摔跤技能书",
  41093: "漫画|热血|美食|岛袋光年|冒险|JUMP|战斗|集英社|2008|週刊少年ジャンプ|少年JUMP",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|日常|椿泉",
  58644: "漫画|悬疑|生存|科幻|マンガ|漫画系列|已完结",
  72580: "漫画|鏡貴也|山本ヤマト|集英社|奇幻|战斗|ジャンプスクエア|动画化|JumpSquare|漫画系列|マンガ",
  83914: "皮皮传|漫画|口袋妖怪|搞笑|穴久保幸作|冒险|已完結|搞笑漫画|pokemon|toku",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|黑丝|2016",
  212535: "百合|漫画|文尾文|校园|日常|已完结|コミック百合姫|2016|ヤングアニマル|漫画系列|系列",
  249482: "漫画|搞笑|天原|穿越|エロ|万太郎|2017|欢乐|系列|糟糕|贞操观",
  249726: "漫画|冒险|父控|异世界|战斗|轻改|漆原玖|2018|轻小说改|父女|小说改",
  270190: "漫画|漫画系列|异世界|轻改|2018|B漫|春乃えり|竹書房|转生|小说改|轻小说改",
  274821: "漫画|狗血|NTR|R18|宮崎摩耶|人妻|婊子|恋爱|マンガ|系列|限制",
  313876: "百合|漫画|日常|幼女|治愈|漫画系列|吉村佳|2020|原创|萝莉|黑丝连裤袜",
  347848: "漫画|轻小说改|恋爱|校园|2021|日常|小说改|一般向|日本|カメーリエ|搞笑",
  348390: "漫画|小说改|校园|恋爱|轻小说改|2021|青梅竹馬|没啥好看|一般向|ドラドラふらっと|雲雀湯",
  349898: "百合|漫画|搞笑|日常|一迅社|恋爱|已完结|tsuke|2021|コミック百合姫|漫画系列",
  351360: "東方|东方|同人音乐|合集|2021|秋季例大祭8",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|热血|集英社|大女主|週刊少年ジャンプ|连载中|日本",
  372262: "漫画系列|日本|漫画|短篇集|小说改|系列",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|講談社|三簾真也",
  378564: "系列|漫画系列",
  392095: "漫画|恋爱|校园|小说改|轻小说改|纯爱|漫画系列|2022|轻改|講談社|网络连载",
  408209: "百合|漫画|かしわぎつきこ|2022|日常|一迅社|校园|漫画系列|7|真百",
  411115: "小说改|已完结",
  434727: "漫画|恋爱|校园|川田大智|系列|集英社|連載中|纯爱|未完结漫画|一般向|2023",
  440077: "漫画|校园|青春|日常|恋爱|偶像|矢寺圭太|女装|连载中|先看|在追",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|原创",
  455423: "浅野いにお|漫画|杀手|2023|系列|浅野一二|战斗|青年漫画|浅野一二〇|政治|未完结漫画",
  486042: "Galgame|民俗|CARNELIAN|ROOT|重置|2025|拔作|PC|悬疑|ADV|游戏",
  504636: "卖肉|后宫|漫画|工口|异世界|R18|恋爱|閃凡人|修女|2024|穿越",
  523908: "Galgame|CIRCUS|全年龄|初音岛|妹|废萌|萝莉|2025|DC|幼驯染"
};
