// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.3.7.542
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  232: "key|麻枝准|Galgame|air|鸟之诗|催泪|泣きゲー|观铃|神作|国歌|PC",
  1125: "KID|infinity|打越刚太郎|Galgame|Never7|悬疑|AVG|中泽工|PC|轮回开山作|PSP",
  1126: "Galgame|KID|Ever17|悬疑|神作|打越鋼太郎|infinity|科幻|打越刚太郎|AVG|PC",
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|OP|少年JUMP",
  6580: "漫画|杉基イクラ|动画改|夏日大作战|細田守|全三卷|原创动画改编漫画|複数巻|マンガ|漫画シリーズ|コミックス",
  9849: "ヤマイ|KANAN",
  11992: "轻小说|機巧少女は傷つかない|后宫|海冬レイジ|人机|机娘|校园|夜夜|幻想|るろお|机巧少女不会受伤",
  24596: "冨樫義博|漫画|富坚义博|HunterXHunter|坑|热血|JUMP|少年漫画|少年JUMP|集英社|富奸",
  39332: "轻小说|伪娘|搞笑|恋爱|明坂つづり|已完结|男扮女装|小说|小说系列|系列",
  54887: "轻小说|后宫|柑橘|ゆすら|完结|しゅがすく|插图|复数卷|短篇|搞笑|2013",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  80400: "历史|漫画|宮下英樹|講談社|週刊ヤングマガジン|漫画系列",
  144564: "漫画|智斗|超能力|生存游戏|战斗|2015|みやこかしわ|谋略|小学馆|悬疑|生存",
  167732: "漫画|异世界|小说改|转生|馬場翁|穿越|かかし朝浩|爽文|轻小说改|练级|奇幻",
  185741: "漫画|龙珠|日本|連載中|鸟山明|拯救世界|とよたろう|战斗|热血|Vジャンプ|特兰克斯",
  185875: "漫画|漫画系列|永生|吸血鬼|奇幻|人外",
  187009: "漫画|国漫|战斗|奇幻|魔幻|吸血鬼|爱欧|Bloodline|漫画SHOW|童年|国产",
  196164: "漫画|成田良悟|2016|讲谈社|恋爱|已完結|日本漫画|狗粮|講談社|已完结|2010s",
  198591: "漫画|卖肉|异世界|奇幻|后宫|R18|战斗|佐藤健悦|穿越|連載中|吸奶",
  214607: "少年漫画|漫画系列|日本漫画|已完结|2002|桜野みねね|全6卷",
  220090: "漫画|后宫|刀剑神域|恋爱|奇幻|日常|小说改|SAO|一般向",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|异世界|转生|R18|KADOKAWA",
  230858: "漫画|格斗|奇幻|梅村真也|动作|战斗|2017|アジチカ|漫画系列|コアミックス|日本",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|JUMP|少年漫画|芥見下|週刊少年ジャンプ",
  247623: "轻小说|异世界|狗粮|勇者|妹|小说系列|角川スニーカー文庫|实妹|隐居|日常|ざっぽん",
  279871: "百合|漫画|魔法少女|卖肉|搞笑|SM|战斗|恶堕|小野中彰大|2019|反英雄",
  287720: "漫画|搞笑|误解系|日常|已完结|2019|父爱|久川はる|漫画系列|大叔|全3卷",
  288315: "漫画|少女漫画|森下suu|2019|講談社|少女漫|恋爱|少女|デザート|校园|漫画系列",
  290456: "漫画|轻小说改|奇幻|异世界|战斗|小说改|轻改|2019|阿倍野ちゃこ|漫画系列|SE",
  293355: "漫画|搞笑|百合|欢乐|电波|轻百合|沙雕|日常|抽象|2019|講談社",
  306272: "漫画|2020|奇幻|NAOE|BLコミック|战斗|漫画系列|BL|耽美|一般向",
  307237: "漫画|体育|热血|运动|竞技|滑冰|つるまいかだ|励志|2020|日本|講談社",
  308778: "轻小说|间谍|竹町|战斗|小说系列|小说|日本轻小说|系列|热血|2020",
  318351: "RPG|HRPG|黄油|同人|萝莉|RPGMaker|R18|U-ROOM|2020|PC|怀孕",
  319309: "漫画|安田佳澄|科幻|悬疑|連載中|2020|青年漫画|活下去|智斗|マンガ|反乌托邦",
  324366: "漫画|2020|小说改|恶役千金|女性向|百合|宫廷|恶役令嬢|灵魂互换|大女主|女性主人公",
  326058: "异世界|转生|恶役千金|漫画系列|漫画|搞笑|2020|白黒|ニコニコ漫画",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  337561: "Galgame|NanaWind|2024年|奶子|废萌|分割商法|巨乳|ADV|PC|2024-06|GPT机翻",
  341886: "画集|画集・設定資料集",
  347780: "Galgame|Qruppo|倉骨治人|监狱|2022|PC|搞笑|骨折王子|GAL|等汉化|R18",
  349845: "漫画系列|搞笑|漫画|小说改|异世界",
  361988: "漫画|校园霸凌|致郁|奇幻|タイザン5|短篇|外星人|2021|科幻|萝莉|少年JUMP+",
  369847: "漫画|科幻|末世|废土|岩中治生|2022|废土风|冒险|灾难|日本|女性主人公",
  376352: "百合|漫画|幼驯染|恋爱|搞笑|矢坂しゅう|漫画系列|竹書房|2022|校园|日常",
  380653: "搞笑|漫画|魔法少女|魔法大妈|三倉ゆめ|2022|魔法少妇|少年画報社|魔法阿姨|魔法大姐",
  381400: "轻小说|奇幻|小说系列|战斗|黑暗|白金透|渣男|2022|小说",
  390675: "漫画|日常|恋爱|搞笑|社畜|地主|2022|月刊ビッグガンガン|欢乐|月刊BIGGANGAN|漫画系列",
  397789: "漫画|百合|偶像|芳文社|2022|漫画系列|FUZコミックス|系列|得能正太郎|连载中|マンガ",
  399753: "小说系列",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  409715: "AVG|STEAM|剧情|PC|解谜|游戏|iOS|Android",
  432211: "漫画|猎奇|小说改|百合|一般向|轻小说|漫画系列|白毛",
  433234: "漫画|搞笑|性转|大武政夫|萝莉|2023|KADOKAWA|战斗|养女儿|系列|ハルタオルタ",
  462533: "漫画|恋爱|战斗|杀手|黑暗|連載中|2024|大瀬戸陸|暴力|分镜爽|黑道",
  501493: "",
  536088: "",
  536498: "日本|小说|轻小说|web文|2023"
};
