// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2024.12.26.514
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1488: "minori|Galgame|七尾奈留|新海诚|ef|天门|御影|纯爱|ef_-_the_first_tale.|PC|鏡遊",
  4066: "leaf|丸户史明|Galgame|三角恋|WA2|PC|神作|郁系|脱宅神作|丸戸史明|GAL",
  34225: "藍井エイル|FATE|角色歌|2012|动漫印象集|重永亮介|アニメ|IM|井上日徳|安田貴広|印象曲",
  42232: "漫画|热血|少年JUMP|古馆春一|运动系|排球|运动|ハイキュー!!|集英社|JUMP|古舘春一",
  46090: "ELF|蛭田昌人|Galgame|土天冥海|NTR|悬疑|PC|R18|暖人心田|灰暗系|GAL",
  47646: "板垣恵介|漫画|格斗|1991|周刊少年Champion|漫画系列|燃|战斗|已完结|刃牙",
  66451: "漫画|SF|小说改|道原かつみ|银河英雄传说|田中芳树|经典|太空歌剧|古早漫|银英|田中芳樹",
  69358: "ED|日笠陽子|進撃の巨人|进击的巨人|2013|anime|single|动画|日笠阳子|根岸貴幸|动漫主题曲",
  118165: "搞笑|漫画|井上堅二|颜艺|吉岡公威|裸体|智障|潜水|講談社|恋爱|2014",
  137806: "漫画|あfろ|百合|同人|搞笑|脑洞|芳文社|已完结|日常|漫画系列|四格",
  165241: "同人|Galgame|2016|哲学|离开的人们|PC|K2Cee|电波|等等等|ウツクシキ|AVG",
  177863: "轻小说|駱駝|搞笑|電撃文庫|ブリキ|KADOKAWA|2016|漫画|小说|恋爱|轻小说改",
  182057: "百合|漫画|漫画系列",
  193081: "漫画|博|校园|少女|治愈|百合|2016|集英社|明日酱的水手服|我他妈舔爆！",
  214685: "漫画|恋爱|甜|和武はざの|萌|狗粮|日常|講談社|2017|奇幻|少女漫画",
  236467: "マンガ",
  236926: "漫画|恋爱|畑健二郎|狗粮|日常|2018|总之就是非常羡慕|周刊少年sunday|爱情|恋爱漫画|总之就是非常酸",
  242942: "漫画",
  272951: "异世界|漫画|转生|轻改|小说改|战斗|皇ハマオ|开挂无敌|漫画系列|轻小说改|2019",
  277134: "漫画|恐怖|猎奇|战斗|萝莉|近藤憲一|病娇|2019|惊悚|灵异|对战",
  295217: "轻小说|河野裕|智斗|架見崎系列|科幻|幻想|小说|系列|神作|越島はぐ|小说系列",
  296457: "漫画|性转|异世界|恋爱|搞笑|冒险|2019|穿越|池澤真|津留崎優|小学館",
  306284: "小说改|漫画系列|輕改|2020|大木戸いずみ|保志あかり|轻改|恶役千金|异世界|恶役",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|2020年|画风",
  316280: "漫画|恋爱|漫画系列|三星めがね|色|白毛|萝莉|妹妹|卖肉|雪女",
  316809: "漫画|恋爱|美食|ハナツカシオリ|爱情|日常|講談社|2020|日漫|漫画系列|甜",
  320214: "漫画|异世界|轻改|小说改|2020|网游|策略|穿越|战斗|奇幻|搞笑",
  327060: "轻小说|恋爱|青梅竹马|狗粮|纯爱|小说系列|桃子|小说|笨蛋情侣|未知后续|青梅",
  328458: "漫画|BL|奇幻|BL漫画|漫画系列|喜剧|BLコミック|腐|耽美|R18|2021",
  332250: "漫画|龍幸伸|战斗|怪谈|集英社|奇幻|JUMP+|搞笑|少年ジャンプ＋|龙幸伸|2021",
  347240: "漫画|龙傲天|战斗|异世界|奇幻|不要动脑！",
  360070: "漫画|恋爱|小说改|后宫|轻小说改|2021|香澤陽平|御宮ゆう|一般向|日常|日本",
  372294: "轻小说|百合|异世界|战斗|小说系列|女主|轻小说改|漫画|春の日びより|web小说|轻百",
  375145: "漫画|BL|BL漫画|BLコミック|志木見ビビ",
  375683: "漫画系列",
  376200: "轻小说|恋爱|校园|小说|前任|轻书架|前女友|wenku8|哩哔",
  377765: "卖肉|漫画|伪限制|搞笑|あおむし|搾精研究所|单行本|前篇|系列|日本|重口",
  406361: "Rhythm|アンノウンX|STG|PC|金发教会|NS|东方|游戏|音乐",
  406538: "龙|漫画系列|战斗|神话|悬疑|奇幻|异世界|致郁|女性主人公",
  417054: "轻小说|异世界|流水账|あるくひと|厕纸",
  425732: "轻小说|ファンタジア文庫|后宫|WEB|异世界|2022",
  430016: "漫画|后宫|兽耳|成年コミック|工口|限制",
  431400: "搞笑|漫画|色气|纯爱|日常|恋爱|松林佑|压枪|18X|ero|杀必死",
  432940: "漫画|川原砾|刀剑神域",
  437765: "轻小说|KAZU",
  453125: "漫画|恋爱|科幻|猎奇|校园|悬疑|ハミタ|奇幻|扭曲|漫画系列|マンガ",
  460743: "Galgame|CRYSTALiA|白毛|2024|废萌|妹|萝莉|秋野花|PC|纯(谈恋)爱|2024-02",
  464648: "Galgame|PC|AVG|STEAM|纯爱|游戏|EROGE|动态CG",
  476445: "轻小说",
  480469: "2023|宮迫宗一郎",
  484353: "轻小说|小说系列|有象利路|2023",
  498287: "日本|小说|原创|纸质书",
  511412: "FrontWing|Galgame|灰色系列|PC|2024|恋爱|游戏|ADV|合集|后宫|学园",
  512180: "PC|游戏|ADV|8",
  512789: "Galgame|小说改|2024|ADV|性转|PC|VA|腾讯游戏|Visual|游戏|Arts"
};
