// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.10.07.02
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19289: "末次由紀|漫画|少女漫画|热血|讲谈社|少女|青春|燃|少女漫|講談社|ちはやふる",
  38542: "国产|Galgame|PC|STEAM|洋红工房|AVG|2011|中国|GAL|游戏|百合",
  89134: "轻小说|战争|小说|世界观|小说系列|战斗|系列|水野良|深遊|日本",
  129557: "漫画|搞笑|百合|鈴木健也|搞笑漫画|2014|台灣角川|KADOKAWA|漫画シリーズ|10年代|校园",
  141545: "轻小说|入間人間|珈琲貴族|一卷全|入间人间|小说|2015",
  176089: "漫画|校园|恋爱|生活|漫画系列|NTR|日漫|打工|B漫|pua",
  184047: "国产|Galgame|洋红工房|国产Galgame|PC|百合|生死观|3D渲染|STEAM|AVG|GAL",
  186792: "STEAM|国产|乙女向|AVG|PC|Galgame|大白腿|游戏|2015|VN|Mac",
  219836: "国产|Galgame|七彩绘色|遥望彼方|GAL|妹控|PC|ADV|Windows|游戏",
  223845: "漫画|搞笑|小说改|恶役千金|逆后宫|ひだかなみ|恋爱|山口悟|转生|轻小说改|一迅社",
  237704: "漫画|日常|小坂泰之|校园|搞笑|钓鱼|海洋|2017|连载中|画风|青春",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|芥見下|2018|JUMP|少年漫画|週刊少年ジャンプ",
  248883: "漫画|恋爱|校园|搞笑|狗粮|肉番|丈|喜剧|2018|快结婚|KADOKAWA",
  262170: "漫画|搞笑|異世界|穿越|反套路|异世界|2018|殆ど死んでいる|恋爱|精灵|傲娇",
  265141: "漫画|异世界|轻改|转生|小说改|漫画系列|大堀ユタカ|弱智|日本|系列|奇幻",
  272611: "漫画|青春|校园|恋爱|高松美咲|講談社|2018|月刊アフタヌーン|日常|少女漫画|成长",
  273493: "Galgame|Qruppo|拔作岛|剧情作|续作|沙雕不要停下来|2019|倉骨治人|FD|PC|搞笑",
  273590: "轻小说|异世界|转生",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  289826: "国产|ADV|Galgame|PC|全年龄|DOTA|STEAM|GAL|青羽|AVG|游戏",
  291900: "少女漫画|恋爱|漫画|リカチ|2019|日本漫画|宫廷|漫画系列|战斗|魔法|冒险",
  298144: "百合|漫画|江島絵理|热血|竞技|2020|搞笑|コミックフラッパー|格斗游戏|2023|买",
  299985: "漫画|异世界|NTR|卖肉|R18|穿越|小说改|轻改|NTL|奇幻|漫画系列",
  305429: "漫画|旅行|寿命论|奇幻|治愈|山田鐘人|2020|小学館|勇者|周刊少年sunday|异世界",
  318168: "漫画|少女漫|水曜日のシリウス|漫画系列|少女漫画|狗粮|マツモトケンゴ|恋爱|一般向|日常",
  320977: "小说改|漫画|异世界|漫画系列|恋爱|正太",
  321869: "漫画|恋爱|轻改|忘年恋|東鉄神|搞笑|年上|2020|姐弟恋|漫画系列|小说改",
  324366: "漫画|2020|小说改|恶役千金|女性向|百合|日本|连载中|宫廷|尾羊英|B漫",
  333285: "漫画|日常|真造圭伍|治愈|2021|小学館|慢生活|一般向漫画|现实|日本",
  335456: "轻小说|杉井光|音乐|校园|后宫|小说|小说系列|日本|杉井光的音乐轻小说不得不品|2020|电击文库",
  336489: "百合|漫画|NTR|扭曲|岩見樹代子|コミック百合姫|2021|一迅社|恋爱|校园|日本",
  340182: "百合|轻小说|平坂読|小说系列|上垒|GA文库|小说|2020",
  349842: "小说改|漫画系列|漫画|日本|异世界|奇幻|系列|连载中|2021.",
  364561: "小说系列|轻小说|龙傲天",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|集英社|热血|大女主|週刊少年ジャンプ|连载中|漫画系列",
  372262: "漫画系列",
  388039: "漫画|恋爱|校园|小说改|倒贴|八神鏡|轻小说改|きぐるみ|マイクロマガジン社|轻改|2022",
  388852: "漫画|恋爱|校园|日常|漫画系列|阴角|碇マナツ",
  390325: "漫画|兄妹|2022年|恋爱|小说改|漫画系列|轻小说改|校园|KADOKAWA|中性角色|堺しょうきち",
  392483: "漫画系列|科幻|2022|游戏改|法国原作改编",
  393233: "漫画|悬疑|浅見理都|漫画系列|推理|2022|已完结|社会派|系列|KISS|原创",
  397777: "漫画|一般向|漫画系列|魔木|日漫|灰刃ねむみ|软绵绵汉化|7.4|伪化",
  403992: "百合|漫画|漫画系列|ろここ|2022|KADOKAWA|コミックフラッパー|校园|短篇集|恋爱|真百",
  424917: "漫画",
  425732: "轻小说|后宫|2022|WEB|ファンタジア文庫|异世界",
  427143: "百合|漫画|田口囁一|日常|吸血鬼|2023|少年ジャンプ＋|欢乐|搞笑|2024|轻百合",
  446065: "系列|一般向|連載中|NTR|复仇|监禁|マンガ",
  447981: "漫画|系列|講談社|NTR|恋爱|マンガ|负反馈大于正反馈|2023|无聊|生肉|連載中",
  466654: "轻小说|白井ムク|2023|小说|双子|连载文",
  475214: "小说|轻小说|校园|西幻",
  482879: "",
  484353: "轻小说|小说系列|小说|2023|有象利路|连载中|狗粮|系列|奇幻",
  485035: "",
  489490: "冬茜トム|Galgame|きゃべつそふと|しらたま|CabbageSoft|PC|游戏|萝莉|兽耳|FD|2025",
  498301: "",
  505952: "Galgame|全年龄|PC|Aquaplus|2025|ADV|游戏|重制|NS|GAL|アクアプラス",
  508124: "轻小说|后宫|催眠|催眠侠|WEB|みょん|搞笑|已完结|奇幻|2024|校园",
  509947: "falcom|JRPG|RPG|2025|轨迹系列|PC|Switch|NS|PS5|游戏|待发售",
  511746: "PC|游戏|韩国|iOS|Android",
  523498: "Galgame|拔作|Escu:de|FD|PC|2025|ADV|R18|民俗|银趴|游戏",
  530454: "ADV|NS|PC|游戏|2025",
  541044: "",
  562302: ""
};
