// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.09.18.37
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19899: "轻小说|田尾典丈|GalGame|完结|真后宫|恋爱|幻想|有河サトル|ファミ通文庫|后宫|复数卷",
  25684: "轻小说|日日日|蟲と眼球|致郁|治愈|小说|悬疑|奇幻|恋爱|轻小说系列|小説&ラノベ",
  128971: "轻小说|七沢またり|小说系列|女主人公|已完结|七泽またり|小说|系列|ライトノベル|战记|全2卷",
  144482: "轻小说|异世界|后宫|穿越|白米良|小说|web改|龙傲天|平凡职业造就世界最强|奇幻|WEB",
  170184: "APH|漫画|日本|2024-03|鸡Q屋|已完结|漫画系列|2014|系列|搞笑|黑塔利亚",
  170411: "七沢またり|轻小说|战记|全3卷|已完结|女主人公|奇幻|系列|小说系列|日本轻小说|女性向",
  197051: "",
  230297: "漫画|小川悦司|美食|竞技|料理|系列|少年漫画|2017|连载中|料理漫画",
  253339: "漫画|治愈|奇幻|小说改|童话|轻小说改|宝島社|日常|アマラ|搞笑|猫と竜",
  295563: "轻小说|后宫|小说|漫画|小说系列|リュート|なろう系",
  300270: "百合|轻小说|みかみてれん|后宫|竹嶋えく|欢乐|恋爱|屑粉毛|小说|日本|校园",
  326285: "漫画|奇幻|講談社|铃木央|漫画系列|2021|战斗|系列|原创|少年漫画|热血",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|党争|2021|集英社|漫画系列",
  335248: "轻小说|恋爱|校园|大小姐|狗粮|未完结小说|小说系列|小说|2021|桃文|2021年",
  343554: "轻小说|龙傲天|战斗|小说|厕纸|异世界|小说系列",
  350210: "轻小说|推理|紙城境介|校园|恋爱|侦探|悬疑|小说|小说系列|2021|系列",
  351765: "小说系列|HJ文库|紺野千昭",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|节操|日本|2022|喜剧",
  435154: "轻小说|异世界|日本|系列|连载中|南野海風|校园|小说|小说系列|奇幻|2021",
  448262: "2023|オーバーラップ文庫|轻小说|相模優斗",
  476077: "轻小说|駄犬|奇幻|2024",
  505540: "漫画|日本|连载中|系列|少女|日漫|未完结|漫画系列|2025",
  510427: "轻小说|恋爱|后宫|小说|桃文|暁貴",
  528792: "日本|小说",
  533039: "漫画|少女|原创|系列|台漫BG|台湾",
  540113: "日本|轻小说|小说|连载中|月島秀一|纸质书|OVERLAP文库|2024",
  547603: "奇幻|漫画|百合|2025|温馨|已完结|真木蛍五|腰斩|现代|电子版|可爱",
  640496: "轻小说|系列|小说|日本|小说系列|GA文庫|2026"
};
