// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.04.45
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11157: "alicesoft|Galgame|SLG|地域制压|大系列|PC|GAL|AS的双保险|多周目|扶她|岳画殺",
  11255: "Galgame|伊东杂音|异世界|伊東雑音|水月陵|2007|游戏|PC",
  17078: "綾辻行人|悬疑|Another|轻小说|推理|小说|超自然系|猎奇|角川書店|绫辻行人|不能算推理吧",
  23915: "轻小说|吸血鬼|あざの耕平|幻想|奇幻|已完结|小说系列|富士见书房|系列|小说",
  42435: "漫画|战争|原泰久|热血|历史|集英社|青年漫画|2006|历史漫画|古代",
  148732: "漫画|芳文社|百合|日常|治愈|露营|あfろ|摇曳露营Δ|2015|轻百合|漫画系列",
  180841: "CLAMP|漫画|魔法少女|讲谈社|少女漫|2016|少女|小樱|奇幻|连载|少女漫画",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|電撃マオウ|漫画系列",
  199446: "漫画|穿越|药傲天|小说改|2017|异世界|轻小说改|連載中|KADOKAWA|高野聖|轻改",
  212917: "漫画|搞笑|日常|校园|2014|ビーノ|KADOKAWA|百合|青年漫画|B漫|总",
  220843: "漫画|Type-Moon|游戏改|fgo|系列|白峰|一迅社|日本|连载中|漫画系列|連載中",
  221759: "漫画|特摄|佐藤まさき|三条陸|2017|小学館|假面骑士|少年漫画|连载中",
  228216: "Galgame|纯爱|JK|年龄差|黑长直|治愈|PC|ADV|表外甥女|唯唯月",
  230591: "漫画|石黑正数|悬疑|科幻|石黒正数|2018|講談社|脑洞|公路|战斗|末世",
  235575: "",
  242129: "小池一夫|漫画系列|青年漫画|漫画|叶精作|日本|犯罪|日本漫画|科幻|福利|单元剧",
  248141: "漫画|异世界|轻改|龙傲天|转生|小说改|轻小说改|漫画系列|穿越|奇幻|搞笑",
  248885: "漫画|异世界|龙傲天|納都花丸|2018|爽文|轻改|轻小说改|小说改|概念神|藤孝剛志",
  248914: "漫画|轻小说改|奇幻|异世界|战斗|2017|小说改|数值龙傲天|滝乃大祐|画风|黑妹",
  255324: "漫画系列|搞笑|漫画|轻小说|异世界|轻小说改|小说改|B漫",
  259303: "BL|BL漫画|漫画系列|豊田悠|2018|漫画|pixivコミック",
  265749: "",
  266498: "漫画|足球|講談社|ノ村優介|2018|金城宗幸|运动|週刊少年マガジン|体育漫画|中二|连载中",
  270190: "漫画|漫画系列|异世界|轻改|2018|B漫|春乃えり|竹書房|转生|小说改|轻小说改",
  270199: "漫画|异世界|中二|搞笑|龙傲天|小说改|轻小说改|转生|2018|轻改|KADOKAWA",
  276317: "性转|漫画|恋爱|巨乳|校园|卖肉|搞笑|福利|漫画系列|擦边球|跨性别者",
  283417: "百合|漫画|入间人间|柚原もけ|校园|安达与岛村|小说改|恋爱|入間人間|月刊コミック電撃大王|2019",
  302212: "恋爱|漫画|机器人|日常|杉浦次郎|连载中|科幻|漫画系列|治愈|2019|B漫",
  310827: "漫画|恋爱|日常|女仆|漫画系列|小学館|2020|原创|しょたん|B漫|纯爱",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  316594: "动画改|漫画|悬疑|漫画系列|マンガ",
  320981: "小说改|漫画系列",
  321062: "轻小说|野村美月|推理|悬疑|恋爱|竹岡美穂|小说系列|2020|小说|系列|連載中",
  332947: "漫画|轻小说改|异世界|奇幻|战争|战斗|小说改|灾难|猎奇|漫画系列|黑暗",
  333519: "小说改|异世界|漫画|开挂无敌|漫画系列|龙傲天|魔法|战斗|穿越|奇幻",
  338635: "漫画|NTR|单行本|R18|强迫|水島空彦|狗血|乱交|姐妹|マンガ|恋爱",
  339372: "key|Galgame|全年龄|涼元悠一|短篇|PC|2021|駒都えーじ|水月陵|戸越まごめ|催泪",
  341658: "漫画",
  358187: "轻小说|恋爱|校园|重置|HJ文庫|小说|小说系列|青春|ラブコメ|雨宮和希|连载中",
  365249: "白井智之|小说|推理|猎奇|悬疑|2019|日本|已购|单行本|推理小说|2025年3月",
  369080: "轻小说|恋爱|义妹|妹系|白井ムク|小说系列|校园|妹|桃文|纯爱|小说",
  384717: "轻小说|三萩せんや|轻书架|日本|系列|小说|GA文庫|2025年2月|哩哔|wenku8",
  387554: "轻小说|大森藤ノ|小说系列|2022|已完结|全3卷",
  403689: "小说|小说系列|已完结|全2卷|知念実希人",
  408753: "漫画|One|战斗|热血|奇幻|2022|講談社|あずま京太郎|异世界|讲谈社|穿越",
  410317: "轻小说|恋爱|青春|水鏡月聖|轻厉|角川スニーカー文庫|小说|小说系列|ぽりごん|2023|sin",
  424653: "白井智之|推理|小说|悬疑|猎奇|轻小说|短篇集",
  432319: "轻小说|战斗|奇幻|异世界|原純",
  437529: "小说|推理|米澤穂信|悬疑|米泽穗信|文艺春秋|推理之神",
  448259: "",
  451195: "轻小说|底花",
  457931: "轻小说",
  476862: "小说|森见登美彦|森見登美彦|全一卷",
  499874: "AVG|PC|悬疑|ADV|游戏|NS|STEAM|小高和刚|幼驯染|RPG|Switch",
  505457: "轻小说|2024",
  512796: "ASaProject|颜艺社|Galgame|2025|PC|废萌|游戏|ADV|喜剧|八日なのか|天使"
};
