// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.16.56
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1095: "alicesoft|RPG|Galgame|游戏性|燃え|2008|世界観がいい|战斗|GAL|エロい|汉化",
  12592: "和泉万夜|猎奇|Galgame|BLACKCYC|触手|虫使|战斗|PC|2006|感动|拔作",
  13982: "漫画|热血|加藤和惠|青驱|JUMP|集英社|青之驱魔师|恶魔|战斗|青の祓魔師|加藤和恵",
  73356: "漫画|官方同人|已完结|全3卷|打工战士|科幻|时空穿越|漫画系列|穿越|游戏改|¬",
  108095: "百合|漫画|搞笑|海月れおな|2011|已完结|百合飞舞的日子|短篇|无厘头|真百|甜",
  113866: "画集|湯浅政明|公式书|画集公式书",
  119366: "漫画|春輝|成年コミック|R18|集英社|成人漫画|工口|后宫|多卷H漫|日本|マンガ",
  130998: "漫画|异世界|穿越|冒险|小说改|轻改|关于我转生后成为史莱姆的那件事|2015|川上泰樹|轻小说改|日本",
  143597: "漫画|异世界|轻小说改|奇幻|穿越|無職転生|轻改|后宫|フジカワユカ|2014|人生",
  175222: "漫画|百合|芳文社|运动|マウンテンプクイチ|2016|竞技|原创|棒球|有英化版|Kirara",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|電撃マオウ|漫画系列",
  218701: "漫画|异世界|轻小说改|轻改|小说改|战斗|搞笑|2025-07|秋風緋色|穿越|系列",
  221531: "漫画|搞笑|官方同人|2017|名探偵コナン|柯南|かんばまゆこ|日常|犯罪|小学館|青山刚昌",
  236546: "漫画|轻改|2017|异世界|小说改|穿越|奇幻|管理国家|政治|漫画系列|传送",
  249058: "漫画|井上敏樹|横島一|石ノ森章太郎|假面骑士|2014|特摄|青年漫画|日本漫画|空我|漫画系列",
  272961: "漫画|恋爱|竞技|运动|热血|珈琲|街舞|舞蹈|2019|原创|日本",
  273389: "漫画|异世界|小说改|龙傲天|漫画系列|轻改|轻小说改|搞笑|大量魔改原作剧情|画风|吞设定",
  278054: "漫画系列|少女与战车",
  292324: "漫画|恋爱|吉北ぽぷり|校园|纯爱|2019|KADOKAWA|师生|杀必死|逆推|腰斩",
  296610: "轻小说|恋爱|小说系列|日本|ガガガ文庫|猿渡かざみ|厕纸|桃文|1～4分",
  313964: "Galgame|みなとそふと|タカヒロ|CV阵容爆炸|夏和小|Minato|2021|伊藤静|GAL|浅川悠|PC",
  318135: "漫画|异世界|轻小说改|穿越|2020|小说改|种田|儿戏|漫画系列|游戏|マガジンポケット",
  319012: "漫画|战斗|鈴木祐斗|杀手|2020|周刊少年JUMP|搞笑|日本|日常|JUMP|集英社",
  326285: "漫画|奇幻|講談社|铃木央|漫画系列|2021|战斗|日漫|系列|原创|少年漫画",
  333519: "小说改|漫画|异世界|开挂无敌|漫画系列|龙傲天|魔法|穿越|战斗|奇幻|マンガ",
  337234: "漫画|漆原侑来|2020|漫画系列|少年漫画|日本漫画|日本|战斗|连载中|原创",
  339887: "漫画|赌博|炭酸だいすき|恐怖|2021|赌狗|投资|炒外汇|惊悚|KADOKAWA|萌系画风",
  348908: "漫画|后宫|卖肉|倒贴|エロ|恋爱|杀必死|奇幻|擦边球|R15|姐妹丼",
  349243: "Galgame|みなとそふと|FD|ADV|PC|纯爱|wagi|2021|年上|RPG|2021-09",
  350855: "轻小说|背德系|扭曲|恋爱|党争|白学|官能|西条陽|修罗场|小说|2021",
  368650: "漫画|落语|末永裕樹|2022|馬上鷹将|集英社|热血|週刊少年ジャンプ|大女主|连载中|日本",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|三簾真也|講談社",
  377761: "漫画|校园|恋爱|轻小说改|雨森たきび|小说改|败犬|いたち|搞笑|小学館|日本",
  382508: "漫画|漫画系列|搞笑|2025-08",
  401544: "漫画|短篇集|日漫|其他",
  411905: "百合|漫画|かめじろ|奇幻|2023|日本|轻百合|KADOKAWA",
  414664: "漫画|卖肉|2023|守月史貴|ヤンマガWeb|直播|成年コミック|2025-09|系列|日本|连载中",
  423212: "百合|漫画|校园|恋爱|日常|なうち|2023|甜作",
  431033: "漫画|田村隆平|外星人|科幻|2023|小学馆|战斗|奇幻|原创|连载中|月刊サンデーGX",
  435772: "原创|漫画|2023|漫画系列|连载中|2025-09|系列|日本",
  441435: "Roguelike|ACT|国产|横版|PC|STEAM|动作|独立游戏|2024|单机|游戏",
  445269: "轻小说|上村夏樹|社畜|恋爱|6-|糖精|狗糧|戀愛|純愛|同居",
  452349: "漫画|周刊少年JUMP|热血|战斗|集英社|日本|复仇|日漫|2023|连载中|原创",
  460819: "漫画|日常|青年|生活|意识流|上班族|2023|思考|鍋倉夫|小学馆|原创",
  469840: "恋爱|漫画|搞笑|青春|纯爱|日常|电车上|吐槽|2024|吃瓜群众|増田英二",
  470297: "key|Galgame|全年龄|松山剛|萝莉|短篇|PC|科幻|2025|游戏|ADV",
  503019: "轻小说|奇幻|小说|异世界|駄犬|悬疑|连载中|2023|toi8|日本|7",
  503055: "漫画|百合|运动|连载中|青春",
  504636: "卖肉|后宫|工口|漫画|R18|异世界|恋爱|2024|閃凡人|修女|ヤンマガWeb",
  508124: "轻小说|后宫|催眠|催眠侠|搞笑|WEB|日本|已完结|2024|みょん|小说",
  511646: "漫画|系列|日本|原创|连载中|2025-12",
  515527: "JRPG|炼金工房|RPG|2025|Gust|PS5|PC|游戏|PS4|工作室|STEAM",
  520346: "ACT|PC|Platform|NS|小原好美|游戏|STEAM|2025|ADV",
  530016: "轻小说|橘公司|约会大作战|時崎狂三|百合",
  531925: "轻小说|生姜寧也",
  555423: "已购|画集",
  608580: "画集"
};
