// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.01.10.00
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|少年JUMP|OP",
  12852: "少女漫画|仲村佳树|漫画|白泉社|偶像|好想急死你|京子|2002|仲村佳樹|莲|少女漫",
  21418: "漫画|战舰|人工智能|ArkPerformance|苍蓝钢铁的琶音|萝莉|画工赞|热血|科幻|动画化|诉述故事能力赞",
  24207: "漫画|肉|后宫|佐藤ショウジ|战斗|校园|卖肉|恋爱|福利|漫画系列|日本",
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|北欧|2005|战斗|幸村誠|热血",
  32290: "漫画|樋口朝|棒球|月刊アフタヌーン|大振|青春|体育|热血|2003|运动竞技|少年漫画",
  42435: "漫画|热血|战争|原泰久|历史|集英社|青年漫画|2006|历史漫画|古代|连载中",
  54032: "漫画|机巧少女|小说改|高城計|漫画系列|一般向|海冬レイジ|マンガ|奇幻|複数巻|夜夜",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  112396: "漫画|搞笑|百合|日常|ユキヲ|邪神与厨二病少女|人外娘|血腥|COMICメテオ|萝莉|2012",
  127653: "百合|漫画|治愈|和风|已完结|一迅社|2009|全2卷|Comic百合姬S|漫画系列|日常",
  137323: "百合|PC|同人|游戏|2002||Yuri|||YNN||yuri_",
  200472: "百合|韩漫|漫画|韩国|Lezhin|GL|成年コミック|R18|成人向|肉|韓漫",
  209858: "漫画|柊裕一|河本ほむら|赌博|已完结|搜索用|マンガ|漫画系列|校园|悬疑|猎奇",
  226859: "巫女|短篇|同人|Galgame|游戏|PC",
  230731: "异世界|漫画|美食|小说改|奇幻|2017|轻改|治愈|搞笑|颜艺女神|漫画系列",
  238756: "漫画|小说改|推理|日向夏|古风|倉田三ノ路|小学馆|漫画系列|小学館|2017",
  241011: "治愈|日常|漫画|桜井海|一般向|2018|pixivコミック|ガンガンpixiv|连载化|toku",
  267544: "BL|漫画|BLコミック|みか|连载中|漫画系列|BL漫画|角川書店|耽美|幼驯染|2018",
  270385: "异世界|转生|恶役千金|漫画系列|2018|搞笑|恶役|LaLa|冬夏アキハル|求求快更|少女漫画",
  272967: "漫画|奇幻|猪熊しのぶ|R18|搞笑|卖肉|工口|2018|限制|异世界|日本文芸社",
  274367: "林田球|漫画|猎奇|奇幻|小学館|青年漫画|2019|科幻|原创|日本",
  282324: "漫画|恋爱|小说改|轻改|KADOKAWA|草壁レイ|紙城境介|2019|校园|日常|轻小说改",
  288038: "漫画|异世界|小说改|轻改|冒险|漫画系列|战斗|2019|病娇|割内タリサ|轻小说改",
  297409: "漫画|十日草輔|2017|国王排名|童话绘本|奇幻|角川|群像剧|夹带私货|漫画系列|日漫",
  304293: "漫画|恋爱|校园|漫画系列|青春|2020|轻小说|小说改|ボブキャ|マンガUP！裕夢",
  305876: "漫画|小说改|转生|轻小说改|悪役|搞笑|迪化|2019|餅月望|漫画系列|连载中",
  306339: "漫画|恐怖|猎奇|百合|田口翔太郎|搞笑|小学館|2020|黑暗|悬疑|未完结漫画",
  319347: "画集|画集・設定資料集|2020|kukka",
  338969: "百合|漫画|校园|恋爱|听障|くずしろ|2021|细腻|コミック百合姫|画风|37",
  376258: "漫画|偶像|少女|日本|原创|系列|现代|已完结|漫画系列",
  376422: "漫画|恐怖|漫画系列|萝莉|灵异|原创|可爱|女主|百合太郎|日本",
  388241: "百合|漫画|卖肉|微エロ|cosplay|漫画系列|已完结|系列|日本|原创",
  391665: "百合|国漫|漫画|恶役千金|恋爱|刺猬猫阅读|断S|赤色|国产|条漫|中国",
  394485: "漫画|内藤泰弘|少年漫画|漫画系列|战斗|系列|吸血鬼|2015|日漫|日本",
  404231: "漫画|校园|黑暗|吸血鬼|悬疑|漫画系列|画风",
  408208: "百合|漫画|姐妹|日常|偶像|恋爱|漫画系列|搞笑|2022|コミック百合姫|病娇",
  422635: "漫画|奇幻|恋爱|B漫",
  425858: "",
  431033: "漫画|田村隆平|外星人|科幻|2023|小学馆|战斗|原创|月刊サンデーGX|奇幻|悬疑",
  438349: "恋爱|穿越|奇幻|搞笑|异世界|糟糕",
  452814: "画集",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|奇幻|日本",
  462338: "漫画|栖夜まろみ|轻小说改|辣妹|校园|倒贴|日常|小说改|ギャル|陸奥こはる|緋月ひぐれ",
  465251: "押見修造|漫画|2024|短篇|マンガ|コミックス|校园|全一巻|已完结|猎奇|黑暗",
  472037: "画集|遠坂あさぎ|已购",
  495187: "恋爱|漫画|日常|校园|ぺんたごん|緑川葉|ネコクロ|连载中|2024|小说改|幼女",
  497420: "百合|漫画|校园|サスケ|2024|搞笑|系列|青春|日本|已完结",
  497884: "画集|画集・設定資料集",
  533293: "漫画|日本|原创|搞笑|连载中|恋爱|奇幻|日常|講談社|安部真弘|2025",
  570430: "PC|NS|JRPG|游戏|工作室|PS4|RPG|NS2|PS5",
  576690: "画集"
};
