// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.17.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  565: "青山刚昌|漫画|推理|万年小学生系列|柯南|小学馆|1994|青山剛昌|名侦探柯南|死神小学生|青山剛昌的長期飯票",
  13982: "漫画|热血|加藤和惠|青驱|JUMP|青之驱魔师|集英社|青の祓魔師|恶魔|战斗|加藤和恵",
  32290: "漫画|樋口朝|棒球|月刊アフタヌーン|大振|青春|体育|热血|运动竞技|2003|ひぐちアサ",
  40064: "安达充|漫画|棒球|月刊少年SUNDAY|2012|校园|运动|恋爱|あだち充|小学馆|日本漫画",
  40643: "漫画|許斐剛|运动|ジャンプSQ.|集英社|少年|2009|2009-04|体育漫画|杀人网球|漫画系列",
  66438: "緒川千世|BL|漫画|BL漫画|BLコミック|耽美|大洋図書|日本|【BL漫画】|ばかカップル|BL大洋図書",
  89062: "漫画|热血|阴阳师|助野嘉昭|战斗|恋爱|少年漫画|奇幻|搞笑|ジャンプSQ|2013",
  115721: "漫画|治愈|あの花|全3卷|漫画系列|已完结|轻小说改|2012|动画衍生|マンガ",
  128839: "漫画|棒球|満田拓也|2015|週刊少年サンデー|系列|体育|热血|竞技|漫画系列",
  180060: "漫画|搞笑|公主|奇幻|熊之股鍵次|魔王|小学馆|2016|欢乐向|在魔王城说晚安|欢乐",
  184894: "漫画|异世界|生存|奈央晃徳|山川直輝|奇幻|2016|穿越|讲谈社|战斗|生存游戏",
  219305: "BLコミック|神田猫|校园|竹書房|BL|女装|漫畫|尖端|BL漫画|神田貓|幼驯染",
  237342: "百合|漫画|猎奇|奇幻|小说改|怪谈|冒险|异世界|2018|悬疑|月刊少年ガンガン",
  239442: "日漫|漫画|镰池和马|タウル深い作品|轻改|轻小说|后宫|小说|25|12月|23年",
  242093: "BLコミック|アッサ|BL漫画|BL|竹书房|竹書房",
  245920: "漫画|花沢健吾|忍者|搞笑|无厘头|2018|欢乐向|講談社|連載中|绷|连载中",
  246317: "BL|BL漫画|BLコミック|フジマコ|BL2017|2017",
  259667: "漫画|悬疑|ソウマトウ|萝莉|集英社|剧情|治愈|黑暗|百合|2018|少女",
  262151: "漫画|真岛浩|热血|上田敦夫|讲谈社|漫画系列|妖精尾巴|系列|连载中|日本|連載中",
  264797: "腐|BLコミック",
  266498: "漫画|足球|講談社|金城宗幸|2018|ノ村優介|运动|週刊少年マガジン|体育漫画|中二|连载中",
  271719: "BLコミック",
  282109: "BL",
  293358: "BLコミック|ゆくえ萌葱|BL|BL漫画|腐|海王社|耽美|漫画|GUSH|2019|律师",
  294762: "BL|BL漫画|森川智之|ドラマ|小野友树",
  294766: "NTR|漫画|柚木N|卖肉|R18|漫画系列|寝取られ|限制|成年コミック|一般向|2019",
  299227: "漫画|热血|战斗|集英社|周刊少年JUMP|戸塚慶文|奇幻|超能力|2020|恋爱|JUMP",
  304390: "漫画|漫画系列|マンガ|已完结|系列|原创|日本|一般向|エロ|連載中|全5卷",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|科幻|少年向|連載中",
  310827: "漫画|恋爱|日常|女仆|漫画系列|小学館|2020|原创|しょたん|B漫|纯爱",
  311106: "腐|漫画|BL|BLコミック",
  314332: "BLコミック|BL|BL漫画|腐|卐",
  336442: "",
  354775: "限制",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|講談社|三簾真也",
  386098: "漫画|佐乃夕斗|集英社|神怪|2022|漫画系列|战斗|少年|少年漫画|日本",
  394485: "漫画|内藤泰弘|少年漫画|漫画系列|系列|战斗|日本|群像剧|猎奇|连载中|奇幻",
  401972: "漫画|已完结|美少女|治愈|青春|搞笑|温柔|全一卷",
  402972: "百合|漫画|なうち|校园|恋爱|GL|KADOKAWA|漫画系列",
  427473: "集英社|漫画|杀手|2023|校园|搞笑|藤巻忠俊|柯南同款|日常|日漫|东立出版社",
  445721: "あざらしそふと|PC|FD|纯爱|Galgame|游戏|GAL|ADV|2017-12|生肉",
  455423: "漫画|浅野いにお|2023|杀手|系列|浅野一二|战斗|青年漫画|浅野一二〇|未完结漫画|连载",
  460819: "漫画|日常|青年|生活|意识流|上班族|2023|小学馆|鍋倉夫|原创|平静",
  464609: "",
  471368: "恋爱|漫画|成人|短篇",
  492705: "漫画|大暮维人|講談社|2024|週刊少年マガジン|大暮維人|漫画系列|系列|神话|少年漫画|战斗",
  500429: "百合|漫画|搞笑|轻百合",
  536972: "国产|PC|Galgame|STEAM|游戏|AVG|2025|AI插图|VN|视觉小说|冒险"
};
