// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.21.76
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1594: "林田球|漫画|奇幻|血腥|幽默|黑色|猎奇|青年漫画|小学馆|2000|ドロヘドロ",
  40064: "安达充|漫画|棒球|月刊少年SUNDAY|2012|运动|校园|恋爱|あだち充|小学馆|日本漫画",
  45278: "漫画|河野史代|こうの史代|系列|漫画系列|日本漫画|2004",
  48816: "格斗|PS3|leaf|ARCADE|ADV|街机|游戏|FTG|Aquaplus|PC",
  66368: "漫画|恋爱|集英社|アミュー|少年漫画|音乐|古筝|热血|竞技|桜アミュー|连载中",
  70196: "百合|Galgame|病娇|姐妹|双子|eye★phon|R18|汉化|ADV|PC|GAL",
  84495: "Galgame|FLAT|纯爱|さかき傘|恋爱观测|我们仍未知道那年望远镜里的纸条是谁放的|GAL|愿得一人心|2014|PC|妹",
  90813: "二之宫知子|漫画|少女漫画|2013|二ノ宮知子|恋爱|少女漫|漫画系列|少女|生活|少女マンガ",
  134064: "漫画|搞笑|校园|Gファンタジー|漫画系列|连载中|田中まい|★マンガ|日常|重复|☆主条目",
  148464: "漫画|集英社|藤崎竜|小说改|田中芳樹|科幻|藤崎龙|系列|银河英雄传说|連載中|历史漫画",
  182434: "漫画|推理|超能力|悬疑|るーすぼーい|校园|智斗|古屋庵|2016|斗智|无能的奈奈",
  187871: "漫画|白浜鴎|奇幻|魔法|2016|讲谈社|画力|日常|温馨|講談社|精致",
  217552: "漫画|推理|古风|轻改|小说改|少女漫画|日向夏|2017|恋爱|少女|搞笑",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  227220: "漫画|成田良悟|奇幻|群像剧|反穿|超能力|藤本新太|战斗|2017|异世界|正太",
  230297: "漫画|小川悦司|料理|美食|竞技|系列|日漫|漫画系列|2017|料理漫画",
  234799: "漫画|恋爱|色气|校园|福田晋一|cosplay|辣妹|日常|2018|爱情|日本",
  236926: "漫画|恋爱|畑健二郎|狗粮|日常|2018|总之就是非常羡慕|周刊少年sunday|爱情|恋爱漫画|总之就是非常酸",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  241491: "PS4|ACT|传颂之物|Aquaplus|leaf|2018|割草无双|PC|游戏|PS5",
  248086: "漫画|搞笑|穿越|馬場康誌|异世界|普京|战斗|脑洞|2018|大统领|奇幻",
  262161: "えすとえむ|コミックタタン",
  266498: "漫画|足球|講談社|金城宗幸|2018|ノ村優介|运动|週刊少年マガジン|体育漫画|中二|连载中",
  273389: "漫画|异世界|小说改|龙傲天|漫画系列|轻改|轻小说改|搞笑|大量魔改原作剧情|画风|吞设定",
  285882: "漫画|后宫|恋爱|校园|搞笑|cosplay|2019|卖肉|肉|橋本悠|集英社",
  292589: "漫画|推理|2019|系列|小说改|漫画系列|悬疑|京極夏彦|连载中|志水アキ|收藏",
  302980: "漫画|性转|异世界|轻小说改|小说改|微エロ|あし|日本|2020|流水账|水曜日のシリウス",
  305429: "漫画|旅行|寿命论|奇幻|治愈|山田鐘人|2020|小学館|勇者|周刊少年sunday|异世界",
  306212: "漫画|石塚真一|青年漫画|2020|音乐|爵士乐|小学館|漫画系列|BIGCOMIC|小学馆|日本漫画",
  311891: "漫画|恋爱|短篇|校园|JUMP|青春|三浦糀|2020|週刊少年ジャンプ|运动|励志",
  316635: "国漫|漫画|第年秒|因果|奇幻|三线叙事|国产|玄幻|唯物主义|胡伟作品（第年秒）|2020",
  320981: "小说改|漫画系列",
  322890: "漫画|搞笑|战斗|脑洞|桜谷シュウ|2020|猎奇|日本漫画|コミプレ|Comiplex",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  336906: "漫画|恋爱|日常|namo|科普|职业|幼驯染|治愈|日本|KADOKAWA|漫画系列",
  340296: "漫画|轻小说改|漫画系列|异世界|凤傲天|小说改|2021|恋爱|日本|连载中",
  347553: "BLコミック|漫画|BL|BL漫画|赤河左岸|2021|リブレ|实体|短篇|腐|耽美",
  355555: "恋爱|漫画|校园|青春|三香見サカ|講談社|日本|2021|画风好|漫画系列|连载中",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|漫画系列|校园|原创|講談社|日本|週刊少年マガジン",
  385211: "漫画|恋爱|漫画系列|2020",
  385970: "ACT|PC|PS5|恋爱模拟|恋爱|STEAM|PS4|Galgame|韩国|StudioSai|2023",
  406424: "漫画|搞笑|百合|漫画系列",
  408753: "漫画|One|战斗|热血|奇幻|2022|講談社|异世界|あずま京太郎|讲谈社|日本",
  409281: "黑暗|智斗|犯罪|漫画|悬疑|战斗|少年|杀手",
  409402: "百合|漫画|ウオズミアミ|2022|漫画ウオズミアミ|恋爱|NTR|人妻|日本漫画|GL|集英社",
  413366: "Galgame|シルキーズプラス|きみしま青|拔作|PC|纯爱|2024|悬疑|ADV|续作|悬疑推理",
  414664: "漫画|卖肉|2023|守月史貴|ヤンマガWeb|6.5|直播|講談社|成年コミック",
  453555: "漫画|已完结|小说改|恋爱|校园|奇幻|日本|7.8|轻小说|系列",
  466654: "轻小说|白井ムク|2023|小说|连载文|双子",
  467924: "",
  469407: "SMEE|Galgame|妹|废萌|纯爱|欢乐|PC|青梅竹马|GAL|2024|甜",
  487772: "漫画|日常|搞笑|石ト悠良|百合|2024|系列|已完结|忍者|腰斩|原创",
  502328: "漫画|后宫|卖肉|校园|搞笑|日本|奇幻|已完结|修女|腰斩|高中生",
  506124: "校园|恋爱|漫画|爱情|日常|黑长直|日本|7.3|小动物|伊藤京介|连载中",
  509947: "JRPG|falcom|RPG|轨迹系列|PC|2025|游戏|PS5|STEAM|英雄传说|NS",
  509955: "传说系列|JRPG|RPG|PS5|2025|PC|PS4|Switch|NS|普通游戏",
  510108: "百合|漫画|伊月クロ|日本|焔すばる|日野アラシ|焼肉定食|結野ちり|本子|成年コミック|校园",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  522187: "Galgame|后宫|SLG|妹|拔作|PC|R18|同人|游戏|纯爱|动态CG",
  522390: "whirlpool|Galgame|FD|近江谷宥|拔作|生肉|废萌|2024|鷹乃ゆき|兽耳|纯爱",
  545934: "Galgame|ensemble|伪娘|魔法少女|女装|PC|R18|废萌|Windows|ADV|游戏",
  547340: "日本|漫画|短篇集|系列",
  569608: "游戏|NS2|ACT|PC|NS",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4"
};
