// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.10.04.48
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19289: "末次由紀|漫画|少女漫画|热血|讲谈社|少女|青春|燃|少女漫|講談社|ちはやふる",
  32491: "漫画|丧女|日常|谷川ニコ|搞笑|百合|不管我怎么去想我不受欢迎这件事都是你们的错!|后宫|校园|漫画系列|2011",
  38542: "国产|Galgame|PC|STEAM|洋红工房|AVG|2011|中国|GAL|游戏|百合",
  104586: "Vocaloid|GUMI|164",
  143372: "茶太|同人|2015|日向そら",
  184047: "国产|Galgame|洋红工房|国产Galgame|PC|百合|生死观|3D渲染|STEAM|AVG|GAL",
  186792: "STEAM|国产|乙女向|AVG|PC|Galgame|大白腿|游戏|2015|VN|Mac",
  219836: "国产|Galgame|七彩绘色|遥望彼方|GAL|妹控|PC|ADV|Windows|游戏",
  237704: "漫画|日常|小坂泰之|校园|搞笑|钓鱼|海洋|2017|连载中|画风|青春",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|芥見下|2018|JUMP|少年漫画|週刊少年ジャンプ",
  248883: "漫画|恋爱|校园|搞笑|狗粮|肉番|丈|喜剧|2018|快结婚|KADOKAWA",
  262170: "漫画|搞笑|異世界|穿越|反套路|异世界|2018|殆ど死んでいる|恋爱|精灵|傲娇",
  265141: "漫画|异世界|轻改|转生|小说改|漫画系列|大堀ユタカ|弱智|日本|系列|奇幻",
  273493: "Galgame|Qruppo|拔作岛|剧情作|续作|沙雕不要停下来|2019|倉骨治人|FD|PC|搞笑",
  285114: "漫画|奇幻|治愈|樋口彰彦|搞笑|講談社|历史|漫画系列|百合|日常|2019",
  289826: "国产|ADV|Galgame|PC|全年龄|DOTA|STEAM|GAL|青羽|AVG|游戏",
  299985: "漫画|异世界|NTR|卖肉|R18|穿越|小说改|轻改|NTL|奇幻|漫画系列",
  305429: "漫画|旅行|寿命论|奇幻|治愈|山田鐘人|2020|小学館|勇者|周刊少年sunday|异世界",
  306272: "漫画|2020|奇幻|NAOE|战斗|BLコミック|漫画系列|月刊Gファンタジー|一般向|BL",
  324366: "漫画|2020|小说改|恶役千金|女性向|百合|日本|连载中|宫廷|尾羊英|B漫",
  336489: "百合|漫画|NTR|扭曲|岩見樹代子|コミック百合姫|2021|一迅社|恋爱|校园|日本",
  337711: "漫画|日本|系列|原创|少女|人外|Furry|连载中|优先|限制",
  349842: "小说改|漫画系列|漫画|日本|异世界|奇幻|系列|连载中|2021.",
  372262: "漫画系列",
  397777: "漫画|一般向|漫画系列|魔木|日漫|灰刃ねむみ|软绵绵汉化|7.4|伪化",
  418009: "恋爱",
  427143: "百合|漫画|田口囁一|日常|吸血鬼|2023|少年ジャンプ＋|欢乐|搞笑|2024|轻百合",
  446065: "系列|一般向|連載中|NTR|复仇|监禁|マンガ",
  447981: "漫画|系列|講談社|NTR|恋爱|マンガ|负反馈大于正反馈|2023|无聊|生肉|連載中",
  489490: "冬茜トム|Galgame|きゃべつそふと|しらたま|CabbageSoft|PC|游戏|萝莉|兽耳|FD|2025",
  505952: "Galgame|全年龄|PC|Aquaplus|2025|ADV|游戏|重制|NS|GAL|アクアプラス",
  509947: "falcom|JRPG|RPG|2025|轨迹系列|PC|Switch|NS|PS5|游戏|待发售",
  511746: "PC|游戏|韩国|iOS|Android",
  515527: "RPG|炼金工房|PC|PS5|游戏|2025|PS4|NS|PS|JRPG",
  523498: "Galgame|拔作|Escu:de|FD|PC|2025|ADV|R18|民俗|银趴|游戏",
  530454: "ADV|NS|PC|游戏|2025"
};
