// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.01.62
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  9344: "草間さかえ|BL|BL漫画|漫画|BLコミック|2010|リブレ|神作★|耽美|想入手|日本",
  13388: "漫画|相田裕|战斗|神枪少女|治愈|萝莉|意大利风情|2002|青年漫画|感人|殉情",
  63308: "克・亜樹",
  80141: "BL|ヨネダコウ|耽美|BL漫画|漫画|攻铁|鸣鸟不飞|BLコミック|黑道|大洋図書|基漫",
  87033: "BL|井上佐藤|漫画|舞蹈|BLコミック|国标舞|【BL漫画－系列】|BL漫画|『井上佐藤』|漫画系列|恋爱",
  122776: "漫画|治癒|徳間書店|今井哲也|連載中|超能力|マンガ|漫画系列|短篇|@7.5",
  146872: "草間さかえ|BL|BL漫画|漫画|リブレ|2015|BLコミック|耽美|2012|Be×boy|シトロン",
  154700: "BLコミック|大洋図書|明治カナ子",
  155802: "BL|ZAKK|悬疑|耽美|茜新社|漫画系列|腐|BL漫画|已完结|漫画|3人",
  163847: "异世界|漫画|轻改|魔物娘|穿越|轻小说改|后宫|木野コトラ|漫画系列|搞笑|双女主",
  207711: "BL|彩景でりこ|BL漫画|祥伝社|BLコミック|R18|耽美|实体|onBLUE|漫画|BL2016",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  231030: "座裏屋蘭丸|BL|BL漫画|漫画|耽美|日本漫画|Canna|座里屋兰丸|R18|女性向|2019",
  231262: "漫画|异世界|后宫|卖肉|氷樹一世|轻改|后宫异世界|2017|轻小说改|漫画系列|战斗",
  241334: "漫画|搞笑|卖肉|エロ|糟糕|喜剧|脑洞|肉番|都市|R15|漫画系列",
  282923: "百合|漫画|酒|塀|2019|日本|秋田書店|原创|漫画系列|系列|连载中",
  288048: "漫画|异世界|穿越|复仇|冒险|轻改|鵜吉しょう|龙傲天|漫画系列|轻小说改|2019",
  314450: "漫画|异世界|恋爱|轻小说改|后宫|奇幻|职场|2020|转生|小说改|えむあ",
  340402: "BL|BL漫画|汀えいじ|秒で分かる|连载中|福利|日漫|漫画|腐|意犹未尽|2022",
  347066: "百合|漫画|コミック百合姫|きぃやん|恋爱|一迅社|2021|漫画系列|2022|短篇|已完结",
  353859: "漫画|魔法少女|战斗|奇幻|职场|2021|集英社|青木裕|少年ジャンプ＋|岩田雪花",
  378805: "百合|美食|漫画|搞笑|2019|梵辛|漫画系列|KADOKAWA|连载中|日本",
  388241: "百合|漫画|卖肉|微エロ|cosplay|漫画系列|已完结|系列|日本|原创",
  390237: "百合|漫画|偶像|棘尾どろしー|灵异|幽灵|校园|2022|连载|汉化|日漫",
  395372: "漫画|日常|雌小鬼|2022|养女儿|漫画系列|系列|萝莉|日本|原创",
  408211: "漫画|校园|连载中|原创|恋爱|7.7|xp|擦边|黑丝|系列|老师",
  425417: "漫画|校园|病态|朝賀庵|已完结|系列|SM|有雷点|2023|一般向|マンガ",
  477650: "BL|漫画|BLコミック|鶴亀まよ|新書館|已完结|亲情|极道",
  485817: "",
  490883: "鬼頭莫宏|雰囲気がいい"
};
