// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.25.44
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3600: "漫画|河野史代|こうの史代|全一巻|历史|2004|双叶社|治愈|マンガ|夕岚之街樱之国|夕凪の街",
  6133: "漫画|贞本义行|EVA|科幻|貞本義行|新世纪福音战士|1994|角川书店|漫画系列|角川|日本",
  13388: "漫画|相田裕|战斗|神枪少女|治愈|萝莉|意大利风情|2002|青年漫画|感人|殉情",
  16324: "福本伸行|漫画|热血|2000|无赖|孤立せよ|マンガ|日本漫画|人性|中篇",
  19333: "漫画|狂欢节|カーニヴァル|御巫桃也|官方让同人无路可走|腐|基|合不拢腿的节奏|科幻|咖喱鸡|2007",
  53399: "搞笑|漫画|ソウ|東立出版社|2009|心理学|少年画報社|月刊YOUNG|ゆうきゆう",
  54236: "猎奇|暴力|猿渡哲也|血腥|日本漫画|格斗漫画|日漫|漫画系列|已完结漫画|1987",
  66843: "爱情|耽美|高口里純|穂波ゆきね|凄美|多角恋",
  69772: "漫画|科幻|松本次郎|战斗|2011|猎奇|脑洞|新潮社|系列|科幻漫画",
  75094: "漫画|新海誠|恋爱|清家雪子|青春|秒速5厘米|2010|催泪|新海诚|講談社|日本",
  80141: "BL|ヨネダコウ|耽美|BL漫画|漫画|攻铁|鸣鸟不飞|BLコミック|黑道|大洋図書|基漫",
  81127: "漫画|一色まこと",
  87033: "BL|井上佐藤|漫画|舞蹈|BLコミック|国标舞|【BL漫画－系列】|BL漫画|『井上佐藤』|漫画系列|恋爱",
  98114: "漫画|小学馆|永井豪|性启蒙|漫画系列|已完结|魔法少女|搞笑|变身",
  143597: "漫画|异世界|轻小说改|奇幻|穿越|無職転生|后宫|轻改|フジカワユカ|2014|无职转生",
  153560: "王道",
  160949: "漫画|战斗|热血|恋爱|民俗|已完结|奇幻|2014|纯爱|完结|漫画系列",
  163879: "漫画|肉|たなかかなこ",
  211626: "已完结|漫画|漫画系列|女仆|マンガ|限制级|複数巻|全3卷",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  231262: "漫画|异世界|后宫|卖肉|氷樹一世|轻改|后宫异世界|2017|轻小说改|漫画系列|战斗",
  241334: "漫画|搞笑|卖肉|エロ|糟糕|喜剧|脑洞|肉番|都市|R15|漫画系列",
  241855: "青年漫画|已完结|科幻|奇幻|星野之宣|实体",
  259816: "漫画|棒球|みかわ絵子|少年JUMP+|运动|竞技|体育漫画|集英社|2018|搞笑|热血",
  270199: "漫画|异世界|中二|搞笑|龙傲天|小说改|轻小说改|转生|2018|轻改|KADOKAWA",
  285054: "百合|漫画|扭曲|猎奇|性癖|SM|恋爱|百合姫コミックス|一迅社|2019|校园",
  288315: "漫画|少女漫画|恋爱|2019|森下suu|講談社|少女漫|デザート|少女|校园|日本漫画",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|漫画系列|2019|半月板損傷|穿越|ヒーローズ",
  306888: "百合|漫画|小说改|异世界|コミック百合姫|恶役千金|恋爱|青乃下|2020|漫画系列|轻改",
  314450: "漫画|异世界|恋爱|轻小说改|后宫|奇幻|职场|2020|转生|小说改|えむあ",
  340402: "BL|BL漫画|汀えいじ|秒で分かる|连载中|福利|日漫|漫画|腐|意犹未尽|2022",
  341648: "漫画|和山やま|日常|角川|校园|漫画系列|BL|2021|KADOKAWA|日本",
  360070: "漫画|恋爱|小说改|后宫|轻小说改|日常|2021|御宮ゆう|前任|香澤陽平|一般向",
  364863: "恋爱|漫画|校园|日常|小说改|2022|佐伯さん|轻小说改|芝田わん|漫画系列|邻家天使漫画",
  375683: "漫画系列",
  395372: "漫画|日常|雌小鬼|2022|养女儿|漫画系列|系列|萝莉|日本|原创",
  408211: "漫画|校园|连载中|原创|恋爱|7.7|xp|擦边|黑丝|系列|老师",
  409402: "百合|漫画|ウオズミアミ|2022|漫画ウオズミアミ|恋爱|NTR|人妻|日本漫画|GL|集英社",
  412013: "漫画|奇幻|轻小说改|小说改|异世界|已完结|轻改|白金透|一般向|2022|きぃやん",
  421548: "异世界|漫画|战斗|齋藤勁吾|萝莉|奇幻|热血|2023|KADOKAWA|搞笑|ニコニコ静画",
  432211: "漫画|猎奇|百合|小说改|一般向|大逃杀|战斗|连载中|轻小说改|恶趣味|美少女",
  435772: "漫画|原创|系列|漫画系列|日本|连载中",
  439204: "漫画|异世界|奇幻|2023|轻改|杉浦次郎|奴隶|厕纸系列|うめ丸|画功好|コミックウォーカー",
  453358: "漫画|异世界|已完结|后日谈|战斗|日本|系列|老年勇者|7.8|没打赢魔王|画功不错",
  454851: "漫画|后宫|卖肉|佐原玄清|校园|2023|穿越|奇幻|恋爱|一般向|漫画系列",
  456375: "漫画|轻改|科幻|战斗|外传|strelka|魔禁|百合|鎌池和馬|KADOKAWA",
  477650: "BL|漫画|BLコミック|鶴亀まよ|新書館|已完结|亲情|极道",
  501181: "",
  508307: "画集"
};
