// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.28.63
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  8432: "四格|漫画|百合|搞笑|日常|傲嬌殺手不夠冷|轻百合|カヅホ|無鐵炮八嘎|只有两个人|2007",
  56358: "漫画|石黒正数|石黑正数|家庭|治愈|2010|日常|短篇|全一巻|徳間書店|コミックス",
  83476: "wac|bemani|2012|album|OST|音游|KONAMI|电子乐",
  167732: "漫画|异世界|小说改|转生|穿越|馬場翁|かかし朝浩|爽文|轻小说改|奇幻|练级",
  184894: "漫画|异世界|生存|奈央晃徳|奇幻|山川直輝|2016|战斗|穿越|讲谈社|生存游戏",
  214346: "漫画|百合|四格|校园|川村拓|河本ほむら|2017|日常|狂赌之渊|漫画系列",
  223238: "漫画|搞笑|日常|欢乐向|奇幻|昆布わかめ|漫画系列|黑皮|萌|魔法|百合",
  233030: "Galgame|FAVORITE|漆原雪人|F社|幼女|司田カズヒロ|魔法少女|马猴烧酒|PC|忍|2019",
  241554: "漫画|异世界|小说改|美食|黑皮|穿越|轻小说改|漫画系列|Manga|日本漫画|轻小说",
  291900: "少女漫画|恋爱|リカチ|漫画|2019|战斗|魔法|宫廷|日本漫画|漫画系列|致郁",
  312057: "漫画|小说改|转生|轻改|纯爱|柚アンコ|奇幻|少女漫|异世界|漫画系列|轻小说改",
  320214: "漫画|异世界|轻改|战斗|2020|网游|小说改|穿越|策略|奇幻|魔法",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|奇幻|御姐x正太|正太|となりける",
  333872: "画集",
  337711: "漫画|少女|连载中|人外|原创|擦边|纯爱|系列|优先|2025-09",
  345997: "画集・設定資料集|设定集",
  368804: "漫画|战斗|奇幻|热血|講談社|原创|2022|裏那圭|连载中|日本",
  379787: "漫画|ユイザキカズヤ|萝莉|全年龄|yuizaki|恋爱|少女|和风|日常|漫画系列|茧",
  382269: "轻小说|重生流|校园|纯爱|恋爱|小说系列|重生|慶野由志|败者转换|爱情|角川スニーカー文庫",
  397403: "小说系列|Eve",
  402768: "漫画系列|gal改|游戏改|漫画|2023|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  408206: "百合|漫画|さかさな|扭曲|2022|萝莉|反伦常|悬疑|恐怖|コミック百合姫|完结",
  409788: "画集|设定集",
  450297: "漫画|原创|日本|KADOKAWA|児島青|生活|系列|ハルタ|连载中|青年漫画|日本漫画",
  460312: "漫画|百合|异世界|性转|搞笑|工口|奇幻|涩涩|巫女|连载中",
  475953: "百合|漫画|2024|コミック百合姫|已完结|欢乐|日本|恋爱|奇幻|そめちめ|日常",
  476442: "轻小说|萝莉|恋爱|西条陽|GAGAGA文库|西条阳|奇幻|小说|2023|悬疑|日轻",
  476978: "轻小说|恋爱|青梅|2023|病娇|日本|连载中|overlap|系列|小说系列|OVERLAP文库",
  492268: "百合|漫画|校园|千種みのり|连载中|日本|日常|系列|角川|KADOKAWA|2023",
  611882: ""
};
