// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.05.45
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|少年JUMP|OP",
  16057: "漫画|甲斐谷忍|短篇|智斗|コミックス|短篇集|全一卷|系列|讲谈社|2008|短",
  24207: "漫画|肉|后宫|佐藤ショウジ|战斗|校园|卖肉|恋爱|福利|漫画系列|日本",
  26944: "石黒正数|漫画|推理|科幻|神展开|短篇|伦理|石黑正数|2011|講談社|黑暗",
  31469: "漫画|矢吹健太朗|后宫|卖肉|校园|喜剧|長谷見沙貴|搞笑|2006|集英社|摔跤技能书",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|日常|椿泉",
  58644: "漫画|悬疑|生存|科幻|マンガ|漫画系列|已完结",
  72580: "漫画|鏡貴也|山本ヤマト|集英社|奇幻|战斗|ジャンプスクエア|动画化|JumpSquare|漫画系列|マンガ",
  80299: "搞笑|漫画|姐弟|清末邦彦|日常|治愈|日本漫画|2011|コミックハイ!|实姐|德国骨科",
  83914: "皮皮传|漫画|口袋妖怪|搞笑|穴久保幸作|冒险|已完結|搞笑漫画|pokemon|toku",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|黑丝|2016",
  249482: "漫画|搞笑|天原|穿越|エロ|万太郎|2017|欢乐|系列|糟糕|贞操观",
  270190: "漫画|漫画系列|异世界|轻改|2018|B漫|春乃えり|竹書房|转生|小说改|轻小说改",
  274821: "漫画|狗血|NTR|R18|宮崎摩耶|人妻|婊子|恋爱|マンガ|系列|限制",
  313876: "百合|漫画|日常|幼女|治愈|漫画系列|吉村佳|2020|原创|萝莉|黑丝连裤袜",
  324883: "マンガ",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  347848: "漫画|轻小说改|恋爱|校园|2021|日常|小说改|一般向|日本|カメーリエ|搞笑",
  349898: "百合|漫画|搞笑|日常|一迅社|恋爱|已完结|tsuke|2021|コミック百合姫|漫画系列",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|热血|集英社|大女主|週刊少年ジャンプ|连载中|日本",
  372262: "漫画系列|日本|漫画|短篇集|小说改|系列",
  378189: "漫画|战斗|少年漫画|漫画系列|少年|一般向|晴川シンタ|2021",
  378564: "系列|漫画系列",
  408209: "百合|漫画|かしわぎつきこ|2022|日常|一迅社|校园|漫画系列|7|真百",
  434727: "漫画|恋爱|校园|川田大智|系列|集英社|連載中|纯爱|未完结漫画|一般向|2023",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|原创",
  455423: "浅野いにお|漫画|杀手|2023|系列|浅野一二|战斗|青年漫画|浅野一二〇|政治|未完结漫画",
  486042: "Galgame|民俗|CARNELIAN|ROOT|重置|2025|拔作|PC|悬疑|ADV|游戏",
  497897: "漫画|搞笑|原创|外星人|系列|日常|日本|一般向|卖肉|泽田コウ|连载中",
  504636: "卖肉|后宫|漫画|工口|异世界|R18|恋爱|閃凡人|修女|2024|穿越",
  523908: "Galgame|CIRCUS|全年龄|初音岛|妹|废萌|萝莉|2025|DC|幼驯染"
};
