// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.01.24.76
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  7644: "麻枝准|AngelBeats!|GDM|神曲|Monster|KSL|INST|插入曲|アニメ|Angel|Dead",
  76385: "漫画|异世界|芊尾悟|漫画系列|轻改|柳内たくみ|小说改|改编|日本|轻小说改|アルファポリス",
  122776: "漫画|治癒|徳間書店|今井哲也|超能力|連載中|漫画系列|系列|短篇|マンガ|治愈",
  128202: "漫画|百合|废土|末日|科幻|公路|つくみず|治愈|2014|致郁|新潮社",
  137427: "同人|羊おじさん倶楽部|狂气|Galgame|电波|2015|猎奇|生肉|爱猫|汉化|2015-06",
  180060: "漫画|搞笑|公主|奇幻|熊之股鍵次|魔王|小学馆|欢乐向|2016|在魔王城说晚安|欢乐",
  181018: "漫画系列|已完结|落合尚之|漫画",
  193851: "漫画|悬疑|智斗|河本ほむら|吉村英明|生存游戏|生存|推理|已完结|2015|漫画系列",
  211728: "漫画|日常|クール教信者|木村光博|漫画系列|百合|月刊Action|月刊アクション|萝莉|轻百合|连载中",
  212997: "小说",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  220361: "漫画|龙傲天|轻小说改|异世界|轻改|战斗|转生|冒险|画风|奇幻|没啥好看",
  242129: "漫画|叶精作|小池一夫|漫画系列|青年漫画|1977|福利|单元剧|已完结|GORO|日本",
  242602: "漫画|种田|穿越|历史|小说改|轻小说改|2017|沢田一|轻改|日本|连载中",
  245274: "漫画|小说改|转生|轻改|异世界|恶役千金|少女漫画|ビス|2018|玉岡かがり|恋爱",
  250520: "国漫|搞笑|漫画|童年|中国|彩漫|国产|2008|补标|日常|喜剧",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|日本|つきや|少女漫|连载中",
  270190: "漫画|异世界|漫画系列|轻小说改|轻改|春乃えり|B漫|2018|小说改|竹書房|转生",
  272026: "漫画系列|漫画|短篇|完结|系列",
  286892: "轻小说|性转|小说系列|BS|あし|WEB|无聊|垃圾",
  289602: "漫画|恋爱|搞笑|校园|少女漫画|木内ラムネ|2018|年下|少女|集英社|少女漫",
  293355: "漫画|搞笑|百合|欢乐|电波|轻百合|沙雕|日常|2019|抽象|講談社",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  300270: "百合|轻小说|みかみてれん|竹嶋えく|后宫|欢乐|恋爱|屑粉毛|小说|日本|校园",
  307721: "漫画|异世界|轻改|小说改|搞笑|日本|奇幻|マンガ|6.8|轻小说改",
  308287: "漫画|神鬼|悬疑|怪谈|奇幻|ぬじま|萝莉|小学館|女性主人公|漫画系列|2019年",
  308976: "漫画|伦理|科幻|講談社|剧情|うめざわしゅん|战斗|連載中|连载中|系列|日本",
  311834: "百合|轻小说|异世界|奇幻|战斗|恋爱|WEB|鴉ぴえろ|小说|小说系列|2020",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|2020|未完结漫画",
  326724: "漫画|恋爱|校园|喜剧|搞笑|原创|久世蘭|杀必死|连载中|逆推|2021",
  343241: "轻小说|恋爱|校园|败犬|搞笑|雨森たきび|青春|恋爱喜剧|日本|小说|GAGAGA文库",
  347240: "漫画|战斗|龙傲天|奇幻|异世界|误解系|不要动脑！|酷儿角色|搞笑|灾难|畫功好",
  355888: "已完结|全3卷|生存|生存遊戲",
  358187: "轻小说|恋爱|校园|重置|小说|HJ文庫|青春|小说系列|ラブコメ|雨宮和希|连载文",
  362117: "治愈|日常|动物|漫画|可爱|奇幻|已完结|8|日本|生活|漫画系列",
  376422: "漫画|恐怖|灵异|漫画系列|萝莉|原创|可爱|日本|日漫|女主|百合太郎",
  426967: "轻小说|七沢またり|狂气|小说|白毛|奇幻|战记|小说系列|系列|日本轻小说|女性向",
  433726: "漫画|青春|奇幻|校园|JK|小说改|复制人|一般向|日常|画功好|7.4",
  453000: "Web|PC|游戏|独立游戏|ADV|dw|2023",
  476978: "轻小说|恋爱|青梅|2023|病娇|日本|连载中|overlap|系列|小说系列|OVERLAP文库",
  489436: "轻小说|恋爱|3pu",
  493365: "性转|漫画|TS|三角恋|校园|2024|百合|恋爱|日本|异性恋|畫功好",
  497178: "轻小说|后宫|小说",
  501181: "漫画改|日本|漫画|系列|已完结",
  505355: "轻小说|2024|單卷|恋爱",
  527456: "",
  529128: "同人|全年龄|病娇|生肉|Galgame|超短篇",
  570431: "JRPG|PS5|2025|NS2|RPG|NS|Gust|游戏|PC|工作室|Switch"
};
