// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.02.49
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  4923: "荒川弘|漫画|鋼の煉金術師|热血|等价交换|钢炼|少年漫画|牛姨|感动|战斗|少年GANGAN",
  26854: "米泽穗信|轻小说|推理|小说|青春|校园|小市民系列|日常推理|2004|米澤穂信|推理系",
  35572: "漫画|国产|有妖气|热血|国漫|许辰|少年漫画|战斗|国产漫画|2012|奇幻",
  38736: "OST|水月陵|galgame|はつゆきさくら|初雪樱|fripSide|KOTOKO|2012|结衣菜|游戏",
  45234: "漫画|筱原千绘|女性向|篠原千絵|漫画系列|历史|少女漫画|恋爱|考据|漫画シリーズ|期待度1",
  49153: "漫画|井上淳哉|生存游戏|生存|战斗|爆炸的艺术|已完结|月刊|新潮社|青年|漫画系列",
  61671: "InnocentGrey|Galgame|杉菜水姫|猎奇|PC|2006|AVG|GAL|悬疑|R18|白河綾音",
  90813: "二之宫知子|漫画|少女漫画|2013|恋爱|少女漫|二ノ宮知子|少女|漫画系列|生活|少女マンガ",
  117115: "漫画系列|少女漫画|成田美名子|日本漫画|青年漫画|MELODY|2001",
  134362: "国漫|搞笑|玄幻|漫画|福利|巨乳|恋爱|中国|国产|修仙|卖肉",
  175459: "国漫|米二|漫画|玄幻|热血|道|国产|中国|2015|战斗|国产漫画",
  186677: "minori|柚子奈ひよ|Galgame|科幻|机器人三定律|石原舞|きのこのみ|2017|汉化|トリノライン|PC",
  193910: "漫画|少女漫画|少女|村田真優|校园|漫画系列|少女漫|狗粮|りぼん|恋爱|青春校园，胃疼",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  222583: "国漫|一淳|猎奇|漫画|复仇|国产漫画|古代|中长篇",
  225513: "漫画|青年|日常|搞笑|久世岳|一迅社|漫画系列|成人向|青年漫画|真实|社畜",
  240662: "漫画|职场|恋爱|狗粮|しろまんた|一迅社|2018|网络连载|萌|连载中|体型差",
  270407: "百合|漫画|小说改|战斗|南方纯|猎奇|异世界|kiki|2018|冒险|奇幻",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  292001: "漫画|漫画系列|轻改|轻小说改|日常|美食|异世界|养女儿|搞笑|后宫|マンガ",
  295589: "轻小说|恋爱|校园|党争|御宮ゆう|角川スニーカー文庫|前任|小说系列|小恶魔|2019年|轻小",
  300938: "漫画|异世界|转生|生存|小林嵩人|求生|高难度|轻小说改|2019年|2019",
  305869: "漫画",
  307237: "漫画|运动|体育|滑冰|热血|竞技|励志|つるまいかだ|日本|2020|原创",
  327974: "国漫|中国",
  330850: "漫画|奇幻|恋爱|一七八ハチ|冒险|亚人|纯爱|御姐x正太|KADOKAWA|色|2021",
  335750: "漫画|后宫|恋爱|杀必死|卖肉|连载中|エロ|2021|原创|漫画系列|工口",
  340296: "漫画|轻小说改|异世界|漫画系列|小说改|2021|凤傲天|恋爱|日本|轻改|未完结",
  348056: "百合|漫画|后宫|奥たまむし|恋爱|沙雕|漫画系列|2021|KADOKAWA|系列",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|日本|画风好|系列",
  379831: "擦边球|日常|卖肉|エロ|聊天|漫画|あちゅむち|漫画系列|系列|未完结漫画",
  401749: "漫画|中国|科幻|国漫|网文改|2014|国产",
  404609: "漫画|后宫|一般向|糟糕|杀必死|校园|卖肉|漫画系列|画风不错|鬼畜|奇幻",
  416868: "漫画",
  422182: "系列|漫画系列",
  442710: "",
  443569: "PC|STEAM|AVG|游戏|ADV|Horror|Linux",
  446647: "冒险|漫画|后宫|异世界|穿越|ヤンマガWeb|小说改|一般向|异世界转移|絢乃|聖橋蘭",
  452281: "悬疑|@|小说改|7.5|結城真一郎|第一个故事有意思",
  459617: "漫画|校园|恋爱|魔物娘|眼亀|日常|2023|奇幻|漫画系列|芳文社|日本",
  467683: "",
  481730: "漫画|連載中|在追|漫画系列|NON|运动|マンガ",
  497214: "百合|Galgame|PC|游戏|AVG|GL|VN",
  515211: "PC|ARPG|银河恶魔城|PS5|ACT|PS4|单机游戏|游戏|XboxOne|Platform",
  529662: "漆原雪人|Galgame|FrontWing|全年龄|PC|2025|ADV|妹|游戏|纯爱|待发售"
};
