// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.01.12.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|少年JUMP|OP",
  21418: "漫画|战舰|人工智能|ArkPerformance|苍蓝钢铁的琶音|萝莉|画工赞|热血|科幻|动画化|诉述故事能力赞",
  24207: "漫画|肉|后宫|佐藤ショウジ|战斗|校园|卖肉|恋爱|福利|漫画系列|日本",
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|北欧|2005|战斗|幸村誠|热血",
  32290: "漫画|樋口朝|棒球|月刊アフタヌーン|大振|青春|体育|热血|2003|运动竞技|少年漫画",
  42435: "漫画|热血|战争|原泰久|历史|集英社|青年漫画|2006|历史漫画|古代|连载中",
  54032: "漫画|机巧少女|小说改|高城計|漫画系列|一般向|海冬レイジ|マンガ|奇幻|複数巻|夜夜",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  137323: "百合|PC|同人|游戏|2002||Yuri|||YNN||yuri_",
  143597: "漫画|异世界|轻小说改|奇幻|穿越|無職転生|后宫|轻改|フジカワユカ|2014|无职转生",
  144135: "山下和美|漫画|奇幻|2014|末世|10年代|マンガ|未完结漫画|完结|モーニング|7分",
  196753: "漫画|集英社|中村光|黑暗|マンガ|搞笑|系列|日本|連載中|漫画系列|连载中",
  209858: "漫画|柊裕一|河本ほむら|赌博|已完结|搜索用|マンガ|漫画系列|校园|悬疑|猎奇",
  218425: "漫画|百合|日常|轻改|异世界|小说改|奇幻|2017|搞笑|シバユウスケ",
  238996: "漫画|搞笑|日常|黑道|おおのこうすけ|美食|欢乐|新潮社|2018|極主夫道|日本",
  240279: "漫画|异世界|龙傲天|小说改|穿越|战斗|轻改|漫画系列|2018|轻小说改|天羽銀",
  250385: "漫画|小说改|漫画系列|B漫",
  260111: "漫画|异世界|转生|小说改|轻小说改|搞笑|轻改|史莱姆|彭傑|开挂无敌|无敌",
  272351: "格斗|漫画|战斗|2019|漫画系列|格斗漫画|だろめおん|打斗|小学館|老年痴呆|搞笑",
  272967: "漫画|奇幻|猪熊しのぶ|R18|搞笑|卖肉|工口|2018|限制|异世界|日本文芸社",
  274367: "林田球|漫画|猎奇|奇幻|小学館|青年漫画|2019|科幻|原创|日本",
  282324: "漫画|恋爱|小说改|轻改|KADOKAWA|草壁レイ|紙城境介|2019|校园|日常|轻小说改",
  304293: "漫画|恋爱|校园|漫画系列|青春|2020|轻小说|小说改|ボブキャ|マンガUP！裕夢",
  308287: "漫画|神鬼|悬疑|怪谈|奇幻|ぬじま|萝莉|小学館|漫画系列|女性主人公|2019年",
  309007: "恋爱|漫画|奇幻|异世界|漫画系列|小说改",
  329376: "小说改|转生|病娇|少女漫画|少女漫|系列|少女|连载中|漫画系列|女性主角|恶役千金",
  338969: "百合|漫画|校园|恋爱|听障|くずしろ|2021|细腻|コミック百合姫|画风|37",
  376422: "漫画|恐怖|漫画系列|萝莉|灵异|原创|可爱|女主|百合太郎|日本",
  388241: "百合|漫画|卖肉|微エロ|cosplay|漫画系列|已完结|系列|日本|原创",
  391665: "百合|国漫|漫画|恶役千金|恋爱|刺猬猫阅读|断S|赤色|国产|条漫|中国",
  394485: "漫画|内藤泰弘|少年漫画|漫画系列|战斗|系列|吸血鬼|2015|日漫|日本",
  408208: "百合|漫画|姐妹|日常|偶像|恋爱|漫画系列|搞笑|2022|コミック百合姫|病娇",
  425858: "",
  431033: "漫画|田村隆平|外星人|科幻|2023|小学馆|战斗|原创|月刊サンデーGX|奇幻|悬疑",
  438349: "恋爱|穿越|奇幻|搞笑|异世界|糟糕",
  457692: "漫画|恋爱|身份交换|校园|搞笑|岸川瑞樹|前任文学|少年ジャンプ＋|2024|奇幻|日本",
  462338: "漫画|栖夜まろみ|轻小说改|辣妹|校园|倒贴|日常|小说改|ギャル|陸奥こはる|緋月ひぐれ",
  465251: "押見修造|漫画|2024|短篇|マンガ|コミックス|校园|全一巻|已完结|猎奇|黑暗",
  495187: "恋爱|漫画|日常|校园|ぺんたごん|緑川葉|ネコクロ|连载中|2024|小说改|幼女",
  497420: "百合|漫画|校园|サスケ|2024|搞笑|系列|青春|日本|已完结",
  511943: "key|Galgame|续篇|AVG|PC|游戏|2024|已购|短篇|重制版|悬疑",
  533293: "漫画|日本|原创|搞笑|连载中|恋爱|奇幻|日常|講談社|安部真弘|2025",
  570430: "PC|NS|JRPG|游戏|工作室|PS4|RPG|NS2|PS5"
};
