// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.05.42
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6784: "橘皆無|漫画系列|擦边球|少女|怀旧|转世|漫画|已完结",
  9344: "草間さかえ|BL|BL漫画|漫画|BLコミック|2010|リブレ|神作★|耽美|想入手|日本",
  32818: "漫画|浅野一二〇|音乐|青春|浅野いにお|浅野一二|2005|短篇|青春漫画|小学館|现实",
  122776: "漫画|治癒|徳間書店|今井哲也|連載中|超能力|マンガ|漫画系列|短篇|@7.5",
  146872: "草間さかえ|BL|BL漫画|漫画|リブレ|2015|BLコミック|耽美|2012|Be×boy|シトロン",
  163847: "异世界|漫画|轻改|魔物娘|穿越|轻小说改|后宫|木野コトラ|漫画系列|搞笑|双女主",
  221946: "漫画|奇幻|人外|战斗|异世界|別冊少年マガジン|萌|一般向|連載中|2017|童话",
  231030: "座裏屋蘭丸|BL|BL漫画|漫画|耽美|日本漫画|Canna|座里屋兰丸|R18|女性向|2019",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  282923: "百合|漫画|酒|塀|2019|日本|秋田書店|原创|漫画系列|系列|连载中",
  302050: "麻生ミツ晃|BLコミック|BL|ABO|海王社|BL漫画|2020|警察|GUSH|コミック",
  304270: "漫画|小说改|搞笑|异世界|舞铲阶级|浪费作画|漫画系列|日本|系列|节操|已完结",
  353859: "漫画|魔法少女|战斗|奇幻|职场|2021|集英社|青木裕|少年ジャンプ＋|岩田雪花",
  380653: "搞笑|漫画|魔法少女|三倉ゆめ|魔法大妈|2022|魔法少妇|颜艺|少年画報社|魔法阿姨|魔法大姐",
  401778: "百合|漫画|花咲まにお|コミック百合姫|2022|一迅社|恋爱|工口|地雷系|漫画系列|双恋无",
  425417: "漫画|校园|病态|朝賀庵|已完结|系列|SM|有雷点|2023|一般向|マンガ",
  435044: "性转|漫画|变百|恋爱|TS|百合",
  470936: "漫画|伪娘|恋爱|校园|日常|2023|ウルトラジャンプ|搞笑|日漫|日本|しなぎれ",
  485817: "",
  490883: "鬼頭莫宏|雰囲気がいい",
  495164: "漫画|成年コミック|后宫|调教|养成|本子|三飞|アルデヒド|大长篇|性好奇|R18",
  506840: "漫画|恋爱|校园|搞笑|2024|青春|原创|週刊少年サンデー|日本|少女|晴川シンタ",
  513940: "Galgame|FrontWing|全年龄|浅生咏|松本文纪|前翼社|短篇|ゆさの|浅生詠|游戏|GAL"
};
