// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.13.65
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  149172: "漫画|坂本眞一|历史|2015|青年漫画|社会|集英社|黑暗|坂本真一|中篇|系列",
  241011: "治愈|日常|漫画|一般向|桜井海|2018|日本漫画|pixivコミック|ガンガンpixiv|toku",
  272768: "漫画|Type-Moon|2019|fgo|游戏改|系列|日本|一迅社|漫画系列|Fate|奇幻",
  301622: "轻小说|小说系列|已完结|全2卷|少女|双葉社|恋爱药|魔女",
  315918: "轻小说|小说系列|转生|ハム男|异世界",
  362541: "轻小说|奇幻|战斗|电击文库|小说系列|2021|電撃文庫|ロケット商会|异世界|热血|连载中",
  445870: "轻小说|误解系|搞笑|异世界|后宫|日本|小说|系列|急川回レ",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  485030: "小说|轻小说|青年|异世界|贞操逆转",
  492066: "",
  505445: "小说",
  524513: "轻小说|恋爱|扭曲|性爱分离|青梅竹马|雲雀湯|校园|约炮|青春|日常|R18",
  542030: "轻小说|2024|へいろー|カボチャマスク|奇幻|战斗|恋爱|异世界|web文",
  556816: "轻小说|电击文库|2025|星野星野|校园|恋爱|后宫",
  562638: "轻小说|百合|扭曲|恋爱|2025|校园|日本|电击文库|小说|出轨|Akeo",
  573423: "轻小说|葵关南|恋爱喜剧|深崎暮人|恋爱|日本|小说|青春|2025|误解系|系列"
};
