// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.1.5.82
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  4092: "轻小说|松智洋|老湿|完结|已完结|小说|小说系列|系列|かにビーム",
  12818: "小野不由美|十二国記|轻小说|坑|神作|架空历史|小说|东方玄幻|神坑|大坑|講談社",
  24401: "漫画|后宫|萝莉|卖肉|幼女|丧失|未来计划|父X女|肉|178无收藏|关系有点乱",
  28818: "画集|集英社",
  29218: "漫画|村上纪香|二战|仁医|历史|1990|系列|超長篇|漫画系列|42卷|剧情",
  34977: "漫画|樋口橘|少女漫画|白泉社|少女漫|超能力|花とゆめ|爱丽丝学园|少女|校园|漫画系列",
  37044: "轻小说|宅居的她是神的说|みえはる|复数卷|すえばしけん",
  55981: "系列|漫画系列",
  76578: "少女漫画|池山田刚|少女漫|运动|恋爱|年下|漫画|池山田剛",
  94644: "恋爱|漫画|少女向|完结|水泽惠",
  187009: "漫画|国漫|战斗|奇幻|魔幻|吸血鬼|爱欧|Bloodline|漫画SHOW|童年|国产",
  188576: "漫画|恋爱|校园|飯田雪子|平尾アウリ|幽灵|小说改|漫画系列|マンガ|已完结|少女漫画",
  193910: "漫画|少女漫画|少女|村田真優|校园|漫画系列|恋爱|りぼん|少女漫|狗粮|青春校园，胃疼",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|日本漫画|山下知子|系列|日常|FEELYOUNG|一般向漫画",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|pixiv",
  220773: "漫画|异世界|轻改|百合|奇幻|轻小说改|凤傲天|女性主人公|冒险|穿越|小说改",
  230297: "小川悦司|漫画|系列|料理|美食|日漫|少年漫画|漫画系列|竞技|料理漫画",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|少年漫画|JUMP|芥見下|週刊少年ジャンプ",
  248914: "漫画|轻小说改|奇幻|异世界|战斗|2017|小说改|数值龙傲天|滝乃大祐|画风|黑妹",
  249726: "漫画|冒险|父控|轻改|异世界|战斗|2018|轻小说改|漆原玖|父女|小说改",
  253720: "Galgame|拔作|とこはな|纯爱|WillPlus|动态CG|萌拔|女仆|猫村ゆき|GAL|PC",
  254437: "百合|漫画|战斗|寿命论|あおのなち|奇幻|コミック百合姫|一迅社|2018|悬疑|战争",
  275492: "漫画|搞笑|恋爱|杀必死|已完结|漫画系列|エロ|全6卷|恋爱喜剧|日本漫画|擦边球",
  280628: "漫画|后宫|校园|恋爱|轻小说改|漫画系列|倒贴|R15|杀必死|一般向|卖肉",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  299096: "漫画|转生|奇幻|异世界|2019|凤傲天|搞笑|小说改|少女漫画|漫画系列|轻改",
  307800: "漫画|恋爱|少女漫画|少女|集英社|漫画系列|2020|マーガレット|日本|少女漫|日下あき",
  308152: "百合|漫画|七路ゆうき|みかみてれん|三角关系|2020|已完结|校园|漫画系列|恋爱|奇幻",
  308570: "漫画|百合|奇幻|双見酔|双葉社|WEB|webアクション|原创|战斗|漫画系列|系列",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  313666: "漫画|奇幻|七尾ナナキ|冒险|异世界|搞笑|2020|欢乐向|漫画系列|連載中|小学館",
  323876: "松本陽介|漫画|百合|全4卷|漫画系列|集英社|已完结|2020|JUMP+",
  343350: "漫画|恋爱|像素风|なるめ|悬疑|日漫|虚构|2020|已完结|现实|科幻",
  354130: "漫画|奇幻|2021|森下真|講談社|月刊少年マガジン|漫画系列|勇者|原创|搞笑|日常",
  355555: "恋爱|漫画|校园|講談社|三香見サカ|青春|2021|漫画系列|系列|舒服|画风好",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|2022|喜剧|节操|讲谈社",
  384022: "类银河战士恶魔城|2024|PC|独立游戏|赤烛|国产|ACT|横版|台湾|STEAM|科幻",
  397208: "漫画系列|已完结|エロ|全2卷",
  411466: "",
  440077: "漫画|日常|青春|恋爱|校园|偶像|矢寺圭太|日本|伪娘|治愈|女装",
  442374: "NS|赛马娘|PC|热血|STEAM|派对游戏|Switch|2024|游戏|PS4|iOS",
  462140: "轻小说|朝野始|ギャル",
  504703: "轻小说|百合|师生",
  513882: ""
};
