// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.09.19.79
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3821: "绿川幸|治愈|漫画|白泉社|夏目友人帳|温暖画风|妖怪志|催泪弹|緑川ゆき|治愈系|怪谈",
  19899: "轻小说|田尾典丈|GalGame|完结|真后宫|恋爱|幻想|有河サトル|ファミ通文庫|后宫|复数卷",
  25684: "轻小说|日日日|蟲と眼球|致郁|治愈|小说|悬疑|奇幻|恋爱|轻小说系列|小説&ラノベ",
  128971: "轻小说|七沢またり|小说系列|女主人公|已完结|七泽またり|小说|系列|ライトノベル|战记|全2卷",
  134910: "沙村広明|漫画|职场|搞笑|广播|講談社|2014|月刊アフタヌーン|沙村广明|连载中|漫画大赏2016",
  170184: "APH|漫画|日本|2024-03|鸡Q屋|已完结|漫画系列|2014|系列|搞笑|黑塔利亚",
  170411: "七沢またり|轻小说|战记|全3卷|已完结|女主人公|奇幻|系列|小说系列|日本轻小说|女性向",
  182434: "漫画|超能力|推理|悬疑|智斗|校园|るーすぼーい|古屋庵|2016|斗智|无能的奈奈",
  197051: "",
  215285: "漫画|异世界|后宫|轻改|恋爱|战斗|2016|RoGa|白米良|漫画系列",
  218561: "漫画|轻改|冒险|异世界|2017|小说改|月刊ドラゴンエイジ|魔法|KADOKAWA|轻小说改|鯖夢",
  227320: "漫画|泉光|奇幻|冒险|讲谈社|少年漫|2017|图书馆|日本|原创|連載中",
  240279: "漫画|异世界|龙傲天|穿越|小说改|战斗|轻改|漫画系列|2018|天羽銀|轻小说改",
  253339: "漫画|治愈|奇幻|小说改|童话|轻小说改|宝島社|日常|アマラ|搞笑|猫と竜",
  265515: "漫画|异世界|轻改|冒险|2018|奇幻|末世流|战斗|ラルサン|マンガUP！|轻小说改",
  267399: "漫画|搞笑|冒险|丧尸|末世|高田康太郎|2018|僵尸|麻生羽吕|小学館|麻生羽呂",
  282708: "漫画|异世界|后宫|轻改|轻小说改|冒险|小说改|漫画系列|2019|茂村モト|奇幻",
  295492: "漫画|漫画系列|转生|小说改编|异世界|小说改|日本|2026-02|战斗|连载中",
  295563: "轻小说|后宫|小说|漫画|小说系列|リュート|なろう系",
  297409: "漫画|十日草輔|2017|国王排名|童话绘本|奇幻|夹带私货|群像剧|角川|漫画系列|日漫",
  299585: "轻小说|奇幻|后宫|小说系列",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|穿越|半月板損傷|漫画系列|2019|ヒーローズ",
  308990: "轻小说|理不尽な孫の手|异世界|朝凪|小说系列|误解系|小说|标签:恋爱|搞笑|系列|未完结轻小说",
  310983: "漫画|少女漫画|恋爱|校园|やまもり三香|2020|少女|講談社|デザート|连载中|少女漫",
  317087: "漫画|奇幻|恋爱|轻小说改|轻改|魔女|狗粮|古宮九時|越水ナオキ|2020|异世界",
  318611: "漫画|战斗|魔法|异世界|大森藤ノ|奇幻|2020|青井聖|漫画系列|热血|校园",
  319012: "漫画|战斗|鈴木祐斗|杀手|周刊少年JUMP|2020|搞笑|日常|JUMP|日本|週刊少年ジャンプ",
  326285: "漫画|奇幻|講談社|铃木央|漫画系列|2021|战斗|系列|原创|少年漫画|热血",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|党争|2021|集英社|漫画系列",
  343554: "轻小说|龙傲天|战斗|小说|厕纸|异世界|小说系列",
  350210: "轻小说|推理|紙城境介|校园|恋爱|侦探|悬疑|小说|小说系列|2021|系列",
  351765: "小说系列|HJ文库|紺野千昭",
  372294: "轻小说|异世界|战斗|百合|女主|小说系列|狂气|奇幻|小说|轻百|日本",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|节操|日本|2022|喜剧",
  385211: "漫画|恋爱|职场恋|2020|日本|漫画系列",
  398259: "轻小说|大逃杀|战斗|鵜飼有志|猎奇|白毛|日本|小说|死亡游戏|原创|悬疑",
  433428: "轻小说|web小说|萝莉|日本|小说|系列|小说系列|纸质书",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|小学馆|卖肉|脑洞",
  435154: "轻小说|异世界|日本|系列|连载中|南野海風|校园|小说|小说系列|奇幻|2021",
  448262: "2023|オーバーラップ文庫|轻小说|相模優斗",
  476077: "轻小说|駄犬|奇幻|2024",
  503945: "轻小说|恋爱",
  505540: "漫画|日本|连载中|系列|少女|日漫|未完结|漫画系列|2025",
  510427: "轻小说|恋爱|后宫|小说|桃文|暁貴",
  528792: "日本|小说",
  533039: "漫画|少女|原创|系列|台漫BG|台湾",
  540113: "日本|轻小说|小说|连载中|月島秀一|纸质书|OVERLAP文库|2024",
  547603: "奇幻|漫画|百合|2025|温馨|已完结|真木蛍五|腰斩|现代|电子版|可爱",
  640496: "轻小说|系列|小说|日本|小说系列|GA文庫|2026"
};
