// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2024.12.6.594
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  502: "久米田康治|漫画|絕望先生|黑色幽默|绝望|讽刺|愤青|讲谈社|2005|治愈系|講談社",
  2867: "轻小说|緋弾のアリア|赤松中学|后宫|色狼体质|开洞|福尔摩斯|扯远了吧|乱入|MF文庫J|已全弃",
  6068: "",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|椿泉|日常",
  48620: "漫画|松井优征|暗殺教室|校园|JUMP|少年JUMP|集英社|搞笑|松井優征|欢乐|殺老師",
  91572: "少女漫画|漫画|校园|少女漫|りぼん|兄妹|双子|恋爱|槙ようこ|少女マンガ|集英社",
  102457: "濑户口廉也|小说|唐辺葉介|轻小说|虚无感|自传|2013|瀬戸口廉也|致郁|私小说|重小说",
  108809: "BL|BLコミック|耽美|漫画系列|BL漫画|漫畫系列|漫画|日本漫画|爱情|一般向|★マンガ",
  127364: "漫画|日日日|真西まり|轻小说|百合|漫画系列",
  132528: "新島夕|Galgame|恋×シンアイ彼女|水月陵|暖人心田|Us:track|新岛夕|きみしま青|PC|治愈|2015",
  132823: "轻小说|衣笠彰梧|校园|欢迎来到实力至上主义的教室|MF文庫J|智斗|トモセシュンサク|斗智|2015|男主演帝|小说系列",
  162097: "轻小说|瀬戸口廉也|唐辺葉介|小说|鬼神|濑户口廉也|犯罪|2009|Tiv|心理",
  177598: "科幻|单元剧|漫画|已完结|漫画系列|マンガ|山田胡瓜|進撃の巨人|人机|系列|全8卷",
  182429: "少女漫画|漫画|小说改|漫画系列",
  201197: "少女|已完结",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|限制|肉",
  236546: "漫画|小说改|轻改|异世界|2017|穿越|奇幻|管理国家|漫画系列|政治",
  236624: "漫画|轻改|异世界|战斗|轻小说改|奇幻|2018|ありかん|B漫|小说改",
  239508: "漫画|轻改|后宫|种田|异世界|穿越|剣康之|内藤騎之介|2018|小说改|流水账",
  242602: "漫画|种田|穿越|历史|小说改|轻小说改|轻改|漫画系列|日本|日漫|系列",
  267222: "漫画|恐怖|搞笑|泉朝树|2018|百合|泉朝樹|ニコニコ静画|日本漫画|KADOKAWA|角川书店",
  267399: "漫画|搞笑|冒险|末世|丧尸|高田康太郎|2018|僵尸|麻生羽吕|小学館|麻生羽呂",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  291965: "漫画|高达|漫画系列|2013|全9卷|已完结",
  297818: "BL|BLコミック",
  297824: "漫画|BL|BL漫画",
  297825: "",
  303246: "小说改|恋爱|少女|少女漫|轻小说改|漫画系列",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|少年向|科幻|連載中",
  310215: "百合|轻小说|小说|终末",
  317087: "漫画|奇幻|恋爱|轻改|轻小说改|狗粮|异世界|魔女|小说改|越水ナオキ|2020",
  318247: "漫画|福利|后宫|搞笑|2020|奇幻|卖肉|西游|性转|小学館|裸露",
  320495: "百合|漫画|校园|桜木蓮|芳文社|恋爱|日常|2020|Kirara|漫画系列",
  322890: "漫画|搞笑|战斗|桜谷シュウ|2020|脑洞|猎奇|Comiplex|漫画系列|日本漫画",
  332250: "漫画|龍幸伸|战斗|怪谈|集英社|奇幻|JUMP+|搞笑|少年ジャンプ＋|龙幸伸|2021",
  337920: "百合|漫画|自爆卡车|こすずめ|废萌|女性主角|2021|搞笑|漫画系列|WEB|GANMA!",
  343657: "漫画|异世界|奇幻|小说改|轻小说改|漫画系列|少年漫|門司雪|战斗|アルト",
  349339: "恋爱|漫画|人妻|巨乳|卖肉|搞笑|漫画系列|ねこ末端|杀必死|一般向|伪后宫",
  354774: "校园|漫画|轻小说改|轻小说|漫画系列|KADOKAWA|紗々音シア|2021|衣笠彰梧",
  368650: "漫画|末永裕樹|馬上鷹将|落语|2022|大女主|集英社|週刊少年ジャンプ|连载中|漫画系列|热血",
  372015: "百合|Galgame|全年龄|幼驯染|2023|GAL|PC|ADV|仰木サヤ|フカヒレ|1000-REKA",
  372523: "百合|Galgame|全年龄|LYCORIS|GAL|2023|PC|塩こうじ|STEAM|2022-10|系统不行",
  380004: "BL|BL漫画",
  392895: "奇幻|漫画系列|漫画|治愈",
  398897: "百合|漫画|搞笑|校园|姐妹百合|漫画系列|姐妹|2022|连载中",
  403129: "RPG",
  403637: "漫画|校园|恋爱|肉丸|原创|圈乱|NTR？|贵乱|谜|一般向|婊子",
  408208: "百合|漫画|姐妹|日常|偶像|漫画系列|搞笑|恋爱|妹|姐|コミック百合姫",
  420914: "BL|BLコミック",
  433727: "漫画|格斗|热血|2023|百合|MAAM|卖肉|原创|小学馆|サンドロビッチ・ヤバ子|脑洞",
  433805: "校园|BG|女攻|青春校园，GB",
  434772: "漫画|恋爱|日常|江户|战斗|欢乐|漫画系列|2023",
  444472: "百合|漫画|北尾タキ|轻百合|2023",
  448545: "",
  453954: "MUG|2024|PC|音游|手游|NS|iOS|Android|2020s|游戏",
  459461: "百合|漫画|校园|搞笑|2023|おーうち|xp|古田朋大|JK|卖肉",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  476445: "轻小说",
  498296: "",
  505113: "FAVORITE|Galgame|HD|保住圭|PC|ADV|FD|游戏|なかひろ|剧情作|BGM重置",
  505876: "BLコミック",
  507967: "画集",
  519040: "Windows|猎奇|游戏|PC|AVG|重口|STEAM|无修正|ryona|EROGE|R18"
};
