// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.25.67
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  62620: "魔法少女小圆|轻小说|百合|一肇|小说|Nitro+|系列|动画改|卖萌人设|小说系列|已完结",
  112155: "ACT|PSV|PC|PS4|无双|BNGI|海賊無双3|繁体中文版|2015|PS3|Koeitecmo",
  129234: "Hulotte|Galgame|FD|妹|实妹|PC|游戏|ADV|废萌|妹妹|2014",
  184894: "漫画|异世界|生存|奈央晃徳|奇幻|山川直輝|2016|战斗|穿越|讲谈社|生存游戏",
  214346: "漫画|百合|四格|校园|川村拓|河本ほむら|2017|日常|狂赌之渊|漫画系列",
  233030: "Galgame|FAVORITE|漆原雪人|F社|幼女|司田カズヒロ|魔法少女|马猴烧酒|PC|忍|2019",
  254437: "百合|漫画|战斗|寿命论|奇幻|あおのなち|コミック百合姫|一迅社|日本|GL|2018",
  286110: "ACT|PS4|海贼无双|PC|海贼王|2020|Switch|万代南梦宫|XboxOne|无双|白金达成",
  291900: "少女漫画|恋爱|リカチ|漫画|2019|战斗|魔法|宫廷|日本漫画|漫画系列|致郁",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|穿越|2019|池澤真|津留崎優|奇幻",
  304298: "漫画|恋爱|漫画系列|竹書房|2020|搞笑|职场|巨乳萝莉|斎創",
  306812: "百合|漫画|恋爱|后宫|校园|轻小说改|2020|日常|みかみてれん|小说改|むっしゅ",
  312057: "漫画|小说改|转生|轻改|纯爱|柚アンコ|奇幻|少女漫|异世界|漫画系列|轻小说改",
  316590: "FPS|PC|废土|R18|3D|STEAM|第一人称角色扮演|黄油|ACT|Galgame|恋爱养成",
  324937: "画集|设定集|已购|IM@S|卡图",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|奇幻|御姐x正太|正太|となりける",
  345997: "画集・設定資料集|设定集",
  376640: "PS5|PC|游戏|独立游戏|RPG|未入库|白金|XSX|PS4|一般向|海贼王",
  379787: "漫画|ユイザキカズヤ|萝莉|全年龄|yuizaki|恋爱|少女|和风|日常|漫画系列|茧",
  382269: "轻小说|重生流|校园|纯爱|恋爱|小说系列|重生|慶野由志|败者转换|爱情|角川スニーカー文庫",
  397403: "小说系列|Eve",
  402768: "漫画系列|gal改|游戏改|漫画|2023|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  408206: "百合|漫画|さかさな|扭曲|2022|萝莉|反伦常|悬疑|恐怖|コミック百合姫|完结",
  409788: "画集|设定集",
  441730: "Galgame|エウシュリー|RPG|Eushully|异世界|PC|GAL|游戏性|黄油|STRIKERS|ADV",
  460312: "漫画|百合|异世界|性转|搞笑|工口|奇幻|涩涩|巫女|连载中",
  466861: "Galgame|mignon|伪娘|女装|2024|オルトロス|PC|R18|ADV|拔作|游戏",
  475953: "百合|漫画|2024|コミック百合姫|已完结|欢乐|日本|恋爱|奇幻|そめちめ|日常",
  476442: "轻小说|萝莉|恋爱|西条陽|GAGAGA文库|西条阳|奇幻|小说|2023|悬疑|日轻",
  476978: "轻小说|恋爱|青梅|2023|病娇|日本|连载中|overlap|系列|小说系列|OVERLAP文库"
};
