// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.06.11.44
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  565: "青山刚昌|漫画|推理|万年小学生系列|柯南|小学馆|1994|名侦探柯南|青山剛昌|死神小学生|青山剛昌的長期飯票",
  29722: "Falcom|2011|う～み|小寺可南子|英雄传说|c81|同人|专辑|VOCAL|空之轨迹|chee",
  35906: "漫画|奥浩哉|科幻|血腥|暴力|青年|生存游戏|Gantz|杀戮都市|集英社|烂尾",
  43562: "満田拓也|漫画|棒球|1994|体育|漫画系列|週刊少年サンデー|运动|已完结|小学館",
  60124: "漫画|少女漫|白泉社|少女漫画|乙女向|拂晓的尤娜|少女|草凪みずほ|冒险|花とゆめ|女主奋斗史",
  65458: "少女漫画|漫画|あきづき空太|白泉社|恋爱|少女漫|2006|LaLa|少女|秋月空太|奇幻",
  66368: "漫画|恋爱|音乐|集英社|アミュー|古筝|热血|少年漫画|竞技|桜アミュー|连载中",
  80730: "漫画|手塚治虫|青年漫画|日本漫画|コミックス|1950",
  149275: "BLコミック|志々藤からり|BL漫画|漫画|角川書店|2015|BL",
  153175: "松本光司|惊悚|限制|恐怖|血腥|彼岸岛|讲谈社|週刊ヤングマガジン|漫画|日本|已完结",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  219371: "BLコミック",
  242942: "漫画",
  253441: "青年漫画|全一卷|手冢治虫|漫画",
  261677: "BL|BL漫画|2018|BL2018",
  269617: "falcom|伊苏|ARPG|PS4|JRPG|RPG|PC|2019|日本ファルコム|STEAM|白金",
  293036: "BLコミック|あずみつな|漫畫|BL漫画|竹書房|BL|日本漫画|2019|Threesome",
  298455: "漫画|搞笑|穿越|音乐|小川亮|2019|四葉夕卜|派对浪客诸葛孔明|转生|热血|講談社",
  304293: "漫画|恋爱|校园|青春|2020|漫画系列|轻小说|小说改|已完结|日本",
  317784: "BLコミック|BL|BL漫画|2020|漫画|依子",
  320180: "短篇集|已完结|日本漫畫|恐龍",
  320495: "百合|漫画|校园|桜木蓮|芳文社|恋爱|日常|2020|Kirara|已完结|日本",
  324416: "漫画|恋爱|后宫|日常|搞笑|2021|多女主|内藤マーシー|周刊少年magazine|日本|原创",
  326285: "漫画|奇幻|講談社|铃木央|漫画系列|2021|战斗|日漫|系列|原创|少年漫画",
  333295: "漫画|萝莉|恋爱|日常|安原宏和|2019|漫画系列|可爱|原创|KADOKAWA|系列",
  333829: "漫画|音乐|毛塚了一郎|短篇集|2021|漫画系列|面白さ|系列|日常|短篇|個人好み",
  340384: "BL|BLコミック|BL漫画|マンガ",
  343293: "BL",
  348344: "漫画|BL|悬疑|2021|惊悚|モクモクれん|耽美|克系|日本|KADOKAWA|原创",
  350891: "BL|BLコミック|恋爱|リブレ|搞笑|R18|校园|2021|日本",
  353235: "连载中|2025-07|漫画改|日本|漫画|漫画系列|系列|海贼王",
  357988: "漫画|恋爱|人外|2021|奇怪的xp|KADOKAWA|传说|フシアシクモ|漫画系列|短篇|エロ",
  371882: "PC|Windows|女性主角|ARPG|中国|游戏|RPG|国产|ACT|STEAM|类银河战士恶魔城",
  384613: "BLコミック|多賀タイラ|漫画",
  390286: "漫画|小说改|漫画系列|战斗|日本|单元剧|续作|轻改|已完结",
  390287: "漫画|小说改|已完结|漫画系列|续作|轻改|战斗|日本",
  391572: "漫画|治愈|日本|百合|温馨|新装版|日常",
  392095: "漫画|恋爱|校园|小说改|轻小说改|纯爱|漫画系列|轻改|2022|网络连载|講談社",
  398601: "漫画|病娇|伦理|父女|黑暗|蝉丸|2022|恋爱|JK|漫画系列",
  402768: "漫画系列|gal改|游戏改|漫画|2023|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  405000: "搞笑|漫画系列|漫画|连载中|系列|原创|2026-01|日本",
  406476: "漫画系列",
  427473: "漫画|集英社|杀手|2023|校园|搞笑|日漫|藤巻忠俊|少年|日常|东立出版社",
  430653: "BLコミック",
  461564: "漫画|2023|講談社|小學生|城戸志保|原创|日本|2025-12|系列|连载中|日漫",
  465067: "凪良ゆう|小说|轻小说|单行本|青春|系列|校园|6|恋爱",
  479588: "已购|画集・設定資料集|2024",
  490753: "百合|漫画|异世界|GL|玉崎たま|2024|连载中|原创|日本|コミック百合姫|連載中",
  494315: "漫画|恋爱|职场|望公太|R15|日常|熟女|しの|轻小说改|とんのすけ|杀必死",
  499667: "百合|漫画|雨水汐|扭曲|性癖|2024|连载中|連載中|マンガ|コミック百合姫|校园",
  536292: "漫画|连载中|日本|原创|卖肉|系列|2026-01",
  546321: "漫画|治愈|日常|集英社|生活|一般向|原创|日本|2025|连载中|系列",
  553472: "日本|漫画|系列|连载中",
  557401: "漫画|恋爱|奇幻|现代|现代奇幻|2025-12|连载中|搞笑|青年|原创|日常"
};
