// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.03.30.71
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  142: "key|Galgame|麻枝准|Kanon|久弥直樹|催泪|樋上いたる|泣きゲー|PC|GAL|1999",
  870: "轻小说|支仓冻砂|萌狼|狼と香辛料|赫萝|经济|治愈系|古典|小说|文仓十|治愈",
  3177: "Galgame|方糖社|Lump_of_Sugar|萌木原|真白|萌え|GAL|PC|汉化|废萌|下田麻美",
  10157: "NDS|RPG|NDS最强3D？|汉化|单机|游戏",
  10340: "Galgame|sprite|恋と選挙とチョコレート|画风美|校园|超展开|2010|GAL|PC|欢乐向|汉化",
  19441: "轻小说|渡航|我的青春恋爱物语果然有问题|校园|这本轻小说真厉害!|青春|大老师|恋爱|GAGAGA文库|残念系|吐槽",
  42232: "漫画|热血|少年JUMP|古馆春一|运动系|排球|运动|ハイキュー!!|集英社|JUMP|古舘春一",
  45524: "种村有菜|少女漫画|漫画|少女|種村有菜|2004|校园|少女漫|灰姑娘物语|少女マンガ|年代久远无印象派",
  47646: "板垣恵介|漫画|格斗|1991|周刊少年Champion|漫画系列|战斗|燃|已完结|刃牙",
  51961: "百合|Galgame|同人|PC|茉宮祈芹|ADV|はいぺりよん|GAL|けっぽし|妹|游戏",
  68723: "国漫|漫画|小说改|知音漫客|颜开|国产|中国|龙族|战斗|奇幻|2011",
  105978: "OP|东京喰种|2014|TK|凛として时雨|凛として時雨|东京食尸鬼|动画|燃|アニソン|anime",
  119393: "漫画|冒险|致郁|来自深渊|奇幻|つくしあきひと|猎奇|竹書房|幼女|連載中|硬奇幻",
  147741: "解谜|RPGMaker|悬疑|RPG|恐怖|2012|PC|游戏|ひがしどら|RM",
  152901: "漫画|已完结|川本貴裕|A书|成人漫画|素人AV女優|工口|全8卷|卖肉|青年漫画|白泉社",
  191414: "",
  210317: "漫画|后宫|恋爱|腰斩|骨科|已完结|2016|日常|画风|喜剧|搞笑",
  210768: "漫画|岡本倫|后宫|本子|R18|糟糕|2017|講談社|冈本伦|异世界|連載中",
  217552: "漫画|推理|古风|轻改|小说改|少女漫画|少女|2017|恋爱|日向夏|搞笑",
  237230: "轻小说|小说系列",
  256049: "漫画|治愈|萌|坂本遊也|幼女|白泉社|奇幻|异世界|漫画系列|连载中|2019年",
  262170: "漫画|搞笑|異世界|穿越|反套路|异世界|2018|殆ど死んでいる|恋爱|精灵|傲娇",
  265141: "漫画|异世界|轻改|转生|小说改|漫画系列|大堀ユタカ|弱智|系列|日本|奇幻",
  274661: "轻小说|七野りく|Cura|后宫|恋爱|魔法|战争|web小说|ファンタジア文庫|カクヨム|连载",
  275676: "小说|轻小说|夕鷺かのう",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|漫画系列|原创",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  303964: "恋爱|漫画|卓二雄作|已完结|青年漫画|日常|搞笑|校园|甜|KADOKAWA|漫画系列",
  305876: "漫画|转生|小说改|悪役|搞笑|轻小说改|迪化|餅月望|2019|漫画系列|异世界",
  308489: "国漫|三番熊|腾讯系|漫画|中國|国产|中国|条漫",
  315497: "轻小说|恋爱|小说|纯爱|年上",
  316809: "漫画|恋爱|美食|ハナツカシオリ|爱情|日常|講談社|日漫|2020|漫画系列|日本",
  317672: "key|Galgame|竜騎士07|全年龄|望月けい|2021|GAL|小品|PC|ADV|萝莉",
  320446: "漫画|石田スイ|战斗|集英社|連載中|2021|西瓜|マンガ|超能力|系列|漫画系列",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|2021|集英社|JUMP|日本",
  349040: "漫画|未完结|系列|漫画系列",
  364863: "漫画|恋爱|校园|日常|小说改|2022|佐伯さん|芝田わん|轻小说改|漫画系列|邻家天使漫画",
  373162: "百合|漫画|ヒジキ|2022|恋爱|KADOKAWA|日常|漫画系列|契约姐妹",
  385297: "国产|PC|RPG|Galgame|全年龄|GAL|游戏|经营|2024|中國產|视觉小说",
  385707: "恋爱|漫画|vtuber|黑丝|傲娇|日常|校园|桃子|鹿島初|反差|漫画系列",
  386283: "轻小说|恋爱|胃痛|あボーン|神作|校园|经典|一般向|后悔系|系列|なかむら",
  389730: "中国|国漫|漫画",
  392134: "漫画|エロ|卖肉|一般向|漫画系列|类型:漫画|标签:待改|标签:エロ系",
  429771: "国漫|修真|中国|穿越|网文改|玄幻|系统",
  432592: "",
  440646: "RPG|奇幻|PC|游戏|废土|艺术美！！！|XSX|我的童年|漫改|PS5|鳥山明",
  461443: "漫画|搞笑",
  463335: "",
  465067: "凪良ゆう|轻小说|小说|青春|恋爱|校园|单行本",
  476978: "轻小说|恋爱|青梅|日本|2023|连载中|病娇|overlap|系列|小说|小说系列",
  509948: "JRPG|炼金工房|PC|2025|RPG|PS5|Gust|光荣特库摩|游戏|Switch|XSX",
  509955: "传说系列|JRPG|2025|RPG|PS5|PC|PS4|NS|Switch|ACT"
};
