// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.08.57
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  30211: "漫画|后宫|卖肉|浜田よしかづ|战斗|热血|怪怪守护神|格斗|肉|搞笑|鬼神",
  41443: "水上悟志|漫画|短篇集|2007|治愈|少年画報社|全一卷|短篇|超短篇|首篇不错|奇幻",
  54461: "漫画|丸尾末広|猎奇|丸尾末广|全一卷|1984|2003|黑暗|人物|青林工芸舎|青年漫画",
  77322: "漫画|苇原大介|战斗|热血|周刊少年JUMP|智斗|集英社|少年JUMP|2013|集团战|少年漫画",
  89143: "漫画|戸流ケイ|タカヒロ|月刊ビッグガンガン|外传|虐妹子|斩妹之瞳|战斗|漫画系列|マンガ",
  120173: "漫画|异世界|穿越|轻改|奇幻|藍屋球|轻小说改编|后宫|战斗|轻小说改|漫画系列",
  129527: "漫画|热血|田畠裕基|JUMP|2015|少年漫画|日本|集英社|週刊少年ジャンプ|奇幻|周刊少年JUMP",
  144413: "画集|设定集|MAGES.|购物车",
  193081: "漫画|百合|博|校园|少女|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|日本",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|2017|日常|週刊少年チャンピオン|日本|热血",
  216554: "漫画|恋爱|恐怖|椎名うみ|悬疑|灵异|2016|月刊アフタヌーン|講談社|連載中|少女漫画",
  219864: "漫画|音乐|校园|2017|青春|小学館|阿久井真|系列|连载中|音乐漫画|MangaONE",
  221296: "和月伸宏|漫画|集英社|少年漫画|2017|ジャンプSQ.|日本漫画|漫画系列|2026-01|黑碕薰|战斗",
  222548: "羅川真里茂|BL|白泉社|BLコミック|花とゆめ|1998",
  247455: "命运石之门|Steins|轻小说|机器人笔记|Gate|未分类|CHAOS|MAGES.|HEAD|科学ADV",
  247798: "漫画|异世界|小说改|轻改|抽卡|穿越|晴野しゅー|后宫|2018|轻小说改|搞笑",
  262151: "漫画|真岛浩|上田敦夫|热血|讲谈社|漫画系列|妖精尾巴|原创|日本|連載中|连载中",
  262170: "漫画|搞笑|異世界|穿越|反套路|异世界|殆ど死んでいる|2018|恋爱|精灵|傲娇",
  266498: "漫画|足球|講談社|运动|金城宗幸|2018|ノ村優介|週刊少年マガジン|体育漫画|中二|连载中",
  268992: "BL|漫画|紺吉|搞笑|2018|BLコミック|BL漫画|祥伝社|降智|日漫|恶搞",
  283316: "漫画|超能力|科幻|战斗|2019|正太|天野雀|系列|女性主人公|讲谈社|冒险",
  290456: "漫画|轻小说改|轻改|奇幻|异世界|战斗|小说改|2019|阿倍野ちゃこ|冒险|漫画系列",
  307237: "漫画|运动|滑冰|励志|竞技|体育|热血|日本|つるまいかだ|原创|2020",
  317087: "漫画|奇幻|恋爱|轻小说改|轻改|狗粮|魔女|异世界|古宮九時|越水ナオキ|2020",
  328235: "漫画|小说改|漫画系列|進行諸島|异世界|COIN|轻小说改|@|异世界移转|2020|日本",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|2021|集英社|JUMP|日本",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|日本|系列|原创|漫画系列",
  342254: "漫画|藤本タツキ|短篇|藤本树|青春|2021|意犹未尽|集英社|京阿尼|短篇漫画|日本",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|节操|日本|2022|喜剧",
  382828: "漫画|小说改|R18|奇幻|卖肉|调教|宫能|后宫|轻小说改|连载中|转生",
  386098: "漫画|佐乃夕斗|集英社|神怪|2022|战斗|漫画系列|少年|少年漫画|日本",
  392134: "漫画|卖肉|标签:エロ系|エロ|漫画系列|类型:漫画|系列|标签:待改|日漫|一般向",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|杀手|连载中|原创",
  419228: "百合|漫画|ムロマキ|KADOKAWA|画集|漫画单卷|校园|真百",
  426395: "日本|漫画|系列|小说改|已完结",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|小学馆|卖肉|脑洞",
  442107: "轻小说|中西鼎|2023|小说|校园霸凌|ガガガ文庫|成年コミック|7.5|复仇|2025",
  442220: "漫画|百合|tsuke|いのり。|一迅社|コミック百合姫|恶役千金|2023",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|日本|講談社|连载中|原创",
  464644: "",
  472650: "轻小说|滝浪酒利|MF文庫J|奇幻|系列|2023|新人赏|Roitz",
  473405: "漫画|乐队|日常|少年JUMP+|集英社|2024|百合|音乐|日本|搞笑|校园",
  475239: "轻小说|师生",
  483478: "漫画",
  513795: "漫画|卖肉|后宫|丧尸|日本|猎奇|2024|今井ユウ講談社|原创|青年漫|搞笑",
  515936: "国漫|漫画|搞笑|中国漫画|热血|奇幻",
  560497: "百合|轻小说|小说系列|网游|系列|エリーゼ|小说|日本",
  567021: "漫画|异世界|2022|うさぺんぎん|空地大乃",
  577187: "NS|乙女向|PC|游戏|乙女|乙女ゲーム|さらちよみ|AVG|dramatic|create",
  582005: "漫画|日本|2025|芥见下下|集英社|岩崎优次|战斗|日漫|少年|2026|2026-01",
  598205: ""
};
