// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.01.96
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11157: "alicesoft|Galgame|SLG|地域制压|大系列|PC|GAL|AS的双保险|多周目|扶她|岳画殺",
  11255: "Galgame|伊东杂音|异世界|伊東雑音|水月陵|2007|游戏|PC",
  40978: "漫画|三国|港漫|陈某|智斗|殘存亦末路兵敗如山倒|火凤燎原|热血|八奇|2001|国漫",
  78964: "漫画|五十嵐あぐり|小林立|百合|麻将|麻雀|咲-Saki-|月刊ビッグガンガン|外传|校园|¬",
  108564: "漫画|格斗|热血|サンドロビッチ・ヤバ子|2012|三肉必起|小学馆|格斗漫画|だろめおん|漫画系列|裏サンデー",
  114868: "OST|古典音乐|四月是你的谎言|四月は君の嘘|横山克|2014|古典|动画|2014年10月|音乐|恋爱",
  117091: "OST|横山克|四月は君の嘘|2015|四月是你的谎言|anime|动画|O.S.T.|动画歌曲|ENA☆|ACG",
  148732: "漫画|芳文社|百合|日常|治愈|露营|あfろ|摇曳露营Δ|2015|轻百合|漫画系列",
  180841: "CLAMP|漫画|魔法少女|讲谈社|少女漫|2016|少女|小樱|奇幻|连载|少女漫画",
  185030: "ADV|希萌|AVG|Galgame|PC|STEAM|游戏|全年龄|narrator|草火车",
  199446: "漫画|穿越|药傲天|小说改|2017|异世界|轻小说改|連載中|KADOKAWA|高野聖|轻改",
  212917: "漫画|搞笑|日常|校园|2014|ビーノ|KADOKAWA|百合|青年漫画|B漫|总",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|讲谈社|搞笑|連載中|講談社",
  228216: "Galgame|纯爱|JK|年龄差|黑长直|治愈|PC|ADV|表外甥女|唯唯月",
  242129: "小池一夫|漫画系列|青年漫画|漫画|叶精作|日本|犯罪|日本漫画|科幻|福利|单元剧",
  270190: "漫画|漫画系列|异世界|轻改|2018|B漫|春乃えり|竹書房|转生|小说改|轻小说改",
  276317: "性转|漫画|恋爱|巨乳|校园|卖肉|搞笑|福利|漫画系列|擦边球|跨性别者",
  283417: "百合|漫画|入间人间|柚原もけ|校园|安达与岛村|小说改|恋爱|入間人間|月刊コミック電撃大王|2019",
  289342: "漫画|科幻|轻改|战斗|增强现实|赛博格|纳米机器|2019|綾村切人|小说改|枪战",
  299657: "漫画|异世界|搞笑|奇幻|朱白あおい|月刊ヒーローズ|漫画系列|2019|半月板損傷|穿越|ヒーローズ",
  302212: "恋爱|漫画|机器人|日常|杉浦次郎|连载中|科幻|漫画系列|治愈|2019|B漫",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  313133: "漫画|搞笑|2019|芳文社|奇幻|toufu|勇者|魔王|异世界|战斗|未完结漫画",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|未完结漫画|2020",
  319012: "漫画|鈴木祐斗|战斗|周刊少年JUMP|杀手|2020|搞笑|日常|JUMP|連載中|集英社",
  321062: "轻小说|野村美月|推理|悬疑|恋爱|竹岡美穂|小说系列|2020|小说|系列|連載中",
  337417: "伪娘|漫画|虚拟主播|vtuber|萝莉|正太|漫画系列|萌|2021|党争|扭曲",
  339372: "key|Galgame|全年龄|涼元悠一|短篇|PC|2021|駒都えーじ|水月陵|戸越まごめ|催泪",
  384717: "轻小说|三萩せんや|轻书架|日本|系列|小说|GA文庫|2025年2月|哩哔|wenku8",
  387554: "轻小说|大森藤ノ|小说系列|2022|已完结|全3卷",
  398259: "轻小说|战斗|白毛|鵜飼有志|猎奇|死亡游戏|小说系列|智斗|日本|大逃杀|小说",
  403689: "小说|小说系列|已完结|全2卷|知念実希人",
  410317: "轻小说|恋爱|青春|水鏡月聖|轻厉|角川スニーカー文庫|小说|小说系列|ぽりごん|2023|sin",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  448259: "",
  489256: "异世界|漫画|退队流|NTR|战斗还行",
  499874: "AVG|PC|悬疑|ADV|游戏|NS|STEAM|小高和刚|幼驯染|RPG|Switch",
  505457: "轻小说|2024",
  512796: "ASaProject|颜艺社|Galgame|2025|PC|废萌|游戏|ADV|喜剧|八日なのか|天使",
  542118: "PC|推理|NS|2025"
};
