// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.04.10.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  5397: "轻小说|川原砾|SAO|刀剑神域|网游|电击文库|亚丝娜|桐人|電撃文庫|起点文|神展开",
  11236: "田中ロミオ|轻小说|治愈|内涵|人類衰退之後|田中罗密欧|吐槽|小说|科幻|人类姐姐好可怕|小学馆",
  12580: "SMEE|Galgame|早瀬ゆう|实妹|甜甜甜|妹|妹控|妹ゲー|PC|妹妹可艹|GAL",
  45021: "荒木飛呂彦|漫画|jojo|ジョジョの奇妙な冒険|悬疑|集英社|战斗|热血|荒木飞吕彦|2011|四个蛋",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  72580: "漫画|鏡貴也|山本ヤマト|集英社|奇幻|战斗|ジャンプスクエア|动画化|JumpSquare|漫画系列|マンガ",
  118165: "搞笑|漫画|井上堅二|颜艺|吉岡公威|裸体|潜水|智障|恋爱|講談社|2014",
  227179: "韩漫|条漫|少女漫|小说改|转生|漫画|重生|奇幻|2015|中译|韓漫",
  230853: "轻小说|推理|瀬川コウ|青春|小说|校园|赤坂アカ|小说系列|恋爱|系列|复数卷",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  241088: "漫画|芳文社|音乐|百合|四格|轻百合|摇滚|はまじあき|2018|まんがタイムきららMAX|社恐",
  242224: "漫画|异世界|轻改|2018|轻小说改|小说改|マンガ|漫画系列|轻小说|战斗|奇幻",
  273590: "轻小说|异世界|转生",
  276153: "轻小说|鏡遊|镜游|已完结|师生|小说系列|日本|校园|小说|伪后宫|媚宅",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  281438: "国产|AVG|橙光|推理|馄饨仙人|悬疑|PC|解谜|神剧本|2018|ADV",
  281927: "轻小说|误解系|槻影|迪化|日本轻小说|2018|小说系列|小説家になろう|误解向|异世界|系列",
  285882: "漫画|后宫|校园|恋爱|搞笑|cosplay|橋本悠|肉|2019|卖肉|集英社",
  286975: "小说系列",
  296610: "轻小说|恋爱|小说系列|日本|ガガガ文庫|猿渡かざみ|1～4分",
  298720: "足球小将|官中|NS|SPG|PC|漫画改编|2020年|游戏|PS4|2023",
  302467: "轻小说|電撃文庫|渡瀬草一郎|小说系列|2016|ぎん太",
  302980: "漫画|性转|异世界|小说改|轻小说改|微エロ|2020|あし|内々けやき|講談社|弱智",
  312057: "漫画|小说改|转生|纯爱|柚アンコ|轻改|奇幻|少女漫|漫画系列|异世界|轻小说改",
  312164: "轻小说|穿越|动物|小说系列|猪和美少女恋爱|奇幻|推理|系列|优先|异世界|恋爱",
  312642: "漫画|正太|转生|异世界|龙傲天|轻改|后宫|战斗|漫画系列|未完结漫画|2020",
  322345: "国漫|漫画|L.DART|热血|玄幻|系列|神话|国产|奇幻|战斗|普通",
  329860: "轻小说|恋爱|校园|青春|電撃文庫|2021年|小说|七菜なな|小说系列|首饰花艺|党争",
  334440: "后宫|漫画|NTR|R18|小说改|异世界|邪恶|奇幻|一般向|限制|鎖ノム",
  337013: "轻小说|恋爱|桜木桜|桃文|KADOKAWA|纯爱|小说|狗粮|clear|小说系列|日本",
  347031: "荒木飛呂彦|漫画|jojo|2023|ジョジョの奇妙な冒険|战斗|集英社|热血|漫画系列|青年|系列",
  368614: "中国|国漫|推理|漫画|国产|Djade|悬疑|中国大陆|快看|KRE|webtoon",
  368650: "漫画|末永裕樹|落语|馬上鷹将|2022|週刊少年ジャンプ|集英社|大女主|热血|连载中|漫画系列",
  369109: "轻小说|恋爱|小说系列|穂積潜|病娇",
  375316: "漫画|恋爱|幼驯染|搞笑|校园|2022|后宫|日常|党争|講談社|三簾真也",
  383976: "漫画|恋爱|女仆|漫画系列|杀必死|日本|系列|卖肉|20话以内|7zu7|已完结",
  392095: "漫画|恋爱|校园|小说改|纯爱|漫画系列|轻小说改|2022|轻改|网络连载|講談社",
  393151: "漫画|山崎大辉|漫画系列|原创|生存|烂尾|邪教|战斗|Afternoon|系列|讲谈社",
  393594: "轻小说|Hiten|小说系列|岬鷺宮|系列",
  409341: "轻小说|小说|轻小说系列|角川スニーカー文庫|すめらぎひよこ|mocha",
  421840: "Windows|游戏|iOS|Android",
  433061: "轻小说|恋爱|みょん|小说系列|小说|NTL|搞笑|完结|电击文库|2021|千種みのり",
  469153: "轻小说|背德|扇風気周",
  486165: "Galgame|全年龄|ANIPLEX.EXE|亲情|视觉小说|PC|2024|家族|游戏|kazuki|穿越",
  487413: "HOOKSOFT|Galgame|幼驯染|废萌|K子|纯爱|2024|渡辺僚一|PC|青梅|拔作",
  505355: "2024",
  505762: "轻小说|恋爱|百合|日本|纯爱|小说系列|白乃友|2024",
  509948: "JRPG|炼金工房|PC|2025|RPG|Gust|PS5|光荣特库摩|游戏|Switch|XSX",
  520341: "OP|BanGDream!|Ave_Mujica|动画|2025|日本|单曲|CD|ED|颂乐人偶|AveMujica",
  532476: "轻小说|百合|恋爱|三角恋|三角|扭曲|2024|犬甘あんず",
  540029: "日本|小说|连载中|纸质书"
};
