// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.02.63
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  22176: "Galgame|ASaProject|搞笑|颜艺|欢乐|颜艺帝|幼驯染|汉化|诺基亚|清水爱|家族",
  43372: "Galgame|正田崇|LIGHT|中二|燃|战斗|PC|PSP|Dies|2012|ADV",
  131579: "漫画|四格|日常|校园|百合|轻百合|カツヲ|萌|2013",
  232107: "横板过关|国产|像素|独立游戏|ACT|格斗|赛博朋克|APP|iOS|NS|模拟经营",
  238972: "轻小说|小说|转生|松浦|日本|奇幻|已完结|角川BOOKS|异世界|屎|2018",
  252958: "轻小说|异世界|复仇|龙傲天|穿越|纯爱|小説家になろう|篠崎芳|厕纸|福利|奇幻",
  254406: "数码宝贝|PC|PS4|Switch|NS|AVG|2019|异世界|2022|digimon|SLG",
  317314: "漫画|日常|百合|日本|2019|连载中|兴趣类|原创|渋谷圭一郎|科普|系列",
  321148: "OST|galgame|alicesoft|2020|水夏える|月乃|江口孝宏|cittan|游戏|纯音乐|8",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|2021|集英社|JUMP|日本",
  357437: "轻小说|八目迷|跨性别|恋爱|伪娘|小说|性别障碍|2021|校园|ガガガ文庫|日本",
  388241: "百合|漫画|卖肉|漫画系列|系列|日本|原创|微エロ|已完结|cosplay",
  421548: "异世界|漫画|战斗|齋藤勁吾|奇幻|萝莉|热血|2023|KADOKAWA|搞笑|致郁",
  429627: "漫画|恋爱|赤坂明|西沢5ミリ|校园|2023|赤坂アカ|搞笑|集英社|週刊ヤングジャンプ|已完结",
  442107: "轻小说|中西鼎|2023|小说|校园霸凌|ガガガ文庫|成年コミック|7.5|复仇|2025",
  460748: "漫画|恋爱|校园|倒贴|一般向|2025-12|御姐|日常|高桥つばさ|原创|反差萌",
  475239: "轻小说|师生",
  475974: "漫画|性转|轻小说改|兄妹|TS|伏見つかさ|日常|搞笑|妹|じゃこ",
  480076: "Web|PC|视觉小说|短篇|云过|游戏|WISH|NS",
  484353: "轻小说|有象利路|小说系列|小说|2023|恋爱|连载中|狗粮|奇幻|系列",
  486915: "轻小说|フライ|水瀬さら",
  487470: "轻小说|连载中|奇幻|系列|2023|小说",
  495392: "百合|漫画|短篇集|日本|恋爱|校园|原创|真百",
  497921: "恋爱|漫画|校园|党争|日本|原创|连载中|2024|集英社|小野玄晖|青春",
  498801: "漫画|山本崇一朗|日常|校园|搞笑|恋爱|棒球|小學館|连载中|原创|日本",
  513140: "轻小说|凪",
  515527: "JRPG|炼金工房|RPG|2025|Gust|PS5|PC|游戏|PS4|工作室|STEAM",
  525615: "同人|Galgame|全年龄|雪月|世界观|短篇|PC|资源难找|幼馴染|无选项|生肉",
  560497: "百合|轻小说|小说系列|网游|系列|エリーゼ|小说|日本",
  582005: "漫画|日本|2025|芥见下下|集英社|岩崎优次|战斗|日漫|少年|2026|2026-01"
};
