// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.05.86
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  22176: "Galgame|ASaProject|搞笑|颜艺|欢乐|颜艺帝|幼驯染|汉化|诺基亚|清水爱|家族",
  30211: "漫画|后宫|卖肉|浜田よしかづ|战斗|热血|怪怪守护神|格斗|肉|搞笑|鬼神",
  43372: "Galgame|正田崇|LIGHT|中二|燃|战斗|PC|PSP|Dies|2012|ADV",
  89143: "漫画|戸流ケイ|タカヒロ|月刊ビッグガンガン|外传|虐妹子|斩妹之瞳|战斗|漫画系列|マンガ",
  131579: "漫画|四格|日常|校园|百合|轻百合|カツヲ|萌|2013",
  193081: "漫画|百合|博|校园|少女|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|日本",
  222548: "羅川真里茂|BL|白泉社|BLコミック|花とゆめ|1998",
  232107: "横板过关|国产|像素|独立游戏|ACT|格斗|赛博朋克|APP|iOS|NS|模拟经营",
  238972: "轻小说|小说|转生|松浦|日本|奇幻|已完结|角川BOOKS|异世界|屎|2018",
  254406: "数码宝贝|PC|PS4|Switch|NS|AVG|2019|异世界|2022|digimon|SLG",
  317314: "漫画|日常|百合|日本|2019|连载中|兴趣类|原创|渋谷圭一郎|科普|系列",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|2021|集英社|JUMP|日本",
  342254: "漫画|藤本タツキ|短篇|藤本树|青春|2021|意犹未尽|集英社|京阿尼|短篇漫画|日本",
  382828: "漫画|小说改|R18|奇幻|卖肉|调教|宫能|后宫|轻小说改|连载中|转生",
  392134: "漫画|卖肉|标签:エロ系|エロ|漫画系列|类型:漫画|系列|标签:待改|日漫|一般向",
  426395: "日本|漫画|系列|小说改|已完结",
  433727: "漫画|格斗|热血|百合|2023|MAAM|原创|サンドロビッチ・ヤバ子|小学馆|卖肉|脑洞",
  442107: "轻小说|中西鼎|2023|小说|校园霸凌|ガガガ文庫|成年コミック|7.5|复仇|2025",
  442220: "漫画|百合|tsuke|いのり。|一迅社|コミック百合姫|恶役千金|2023",
  464644: "",
  475239: "轻小说|师生",
  480076: "Web|PC|视觉小说|短篇|云过|游戏|WISH|NS",
  484353: "轻小说|有象利路|小说系列|小说|2023|恋爱|连载中|狗粮|奇幻|系列",
  497921: "恋爱|漫画|校园|党争|日本|原创|连载中|2024|集英社|小野玄晖|青春",
  513140: "轻小说|凪",
  560497: "百合|轻小说|小说系列|网游|系列|エリーゼ|小说|日本",
  582005: "漫画|日本|2025|芥见下下|集英社|岩崎优次|战斗|日漫|少年|2026|2026-01",
  598205: ""
};
