// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.1.21.847
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  800: "轻小说|夏娜|傲娇|高桥弥七郎|灼眼のシャナ|奇幻|贫乳LOLI|蜜瓜包|灼眼的夏娜|三无|小说",
  1713: "漫画|八木教广|大剑|奇幻|热血|CLAYMORE|百合|集英社|漂亮大姐姐|八木教広|战斗",
  2669: "漫画|臼井仪人|童年|蜡笔小新|搞笑|史上最无耻小孩|臼井儀人|1990|双叶社|漫画系列|脑洞",
  14673: "漫画|吉永史|少女漫画|历史|白泉社|大奥|历史戏说|女性向|よしながふみ|2005|少女漫",
  24822: "日漫|漫画|经典|漫画系列|2010",
  32435: "井上雄彦|漫画|宫本武藏|画功|武士|讲谈社|青年漫画|浪客行|经典|打斗|神作",
  34373: "漫画|岸本齐史|热血|JUMP|民工|火影忍者|战斗|集英社|少年JUMP|岸本斉史|NARUTO",
  38080: "手冢治虫|漫画|手塚治虫|医学漫画|医学|1973|青年漫|单元剧|青年漫画|已完结",
  43563: "漫画|头文字D|运动|竞技|1995|しげの秀一|AE86|超長篇|90年代|热血沸腾",
  51721: "画集|E-Book",
  58074: "漫画|车田正美|已完结|完全版|漫画系列|热血|1985|Comic|冒险|战斗|友情",
  64141: "漫画|动物|猫|講談社|已完结|¬|治愈|漫画系列|记号|全12卷",
  84162: "SORAHANE|Galgame|妹|2014|双子妹|系统bug|R18|PC|GAL|盘5|妹！",
  86984: "漫画|手塚治虫|1974|漫画系列|少年漫画|奇幻|日本漫画|搜索用|CC",
  91776: "轻小说|海空りく|GA文库|插画赞|燃|小说系列|战斗|系列|复数卷|文字|落第骑士英雄谭",
  111083: "奥浩哉|漫画|机器人|青年漫画|科幻|人性|战斗|讲谈社|SF|重口|講談社",
  114017: "漫画|小林诚|短篇集|小林まこと|一般向漫画|漫画系列",
  148732: "漫画|芳文社|百合|日常|治愈|露营|あfろ|摇曳露营Δ|2015|轻百合|漫画系列",
  156126: "轻小说|推理|日向夏|古风|2011|web改|小説家になろう|连载中|しのとうこ|日本轻小说|宫廷",
  168886: "轻小说|后宫|异世界|龙傲天|オーバーラップ文庫|转生流|小说系列|连载|爽文|总|ネコ光一",
  177997: "轻小说|异世界|香月美夜|穿越|女主视角|种田|奇幻|女性主角|商业|椎名優|2015",
  180061: "漫画|日常|恋爱|搞笑|校园|オダトモヒト|黑丝|狗粮|周刊少年sunday|小学馆|2016",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|周刊少年magazine|2017|讲谈社|搞笑|連載中|講談社",
  252542: "轻小说|恋爱|狗粮|紙城境介|青春|校园|角川スニーカー文庫|搞笑|治愈|2017|小说",
  270199: "漫画|异世界|中二|搞笑|龙傲天|小说改|转生|轻小说改|2018|轻改|KADOKAWA",
  270708: "轻小说|异世界|后宫|ぶーた|小说系列|连载|搞笑|电波系|爽文|2018|转移",
  279871: "百合|漫画|魔法少女|卖肉|搞笑|SM|战斗|恶堕|小野中彰大|2019|反英雄",
  282922: "轻小说|后宫|志瑞祐|奇幻|战斗|异世界|MF文庫J|小说系列|巨乳|白毛|轻小说改",
  296466: "漫画|后宫|搞笑|恋爱|集英社|校园|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|週刊少年マガジン|日漫|妹",
  300334: "轻小说|百合|二月公|電撃文庫|偶像声优|校园|轻百合|业界|青春|小说系列|JK",
  300797: "漫画|搞笑|后宫|恋爱|ヒロユキ|周刊少年magazine|沙雕|講談社|2020|党争|漫画系列",
  311181: "Type-Moon|画集系列|设定集&画集|Fate|画集|设定集|根目录",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|限制|集英社|2020|未完结漫画",
  318247: "漫画|后宫|福利|搞笑|2020|卖肉|奇幻|西游|性转|クリスタルな洋介|小学館",
  325236: "漫画|搞笑|篠原健太|週刊少年ジャンプ|奇幻|集英社|2021|周刊少年JUMP|超自然日常|校园|連載中",
  326654: "漫画|开大车|恋爱|轻改|异世界|日本漫画|正太|战斗|黑暗|小说改|漫画系列",
  326899: "漫画|恋爱|党争|后宫|瀬尾公治|漫画系列|2021|未完结漫画|连载中|女神的露天咖啡厅",
  332250: "漫画|龍幸伸|战斗|怪谈|集英社|奇幻|JUMP+|搞笑|少年ジャンプ＋|龙幸伸|2021",
  337013: "轻小说|恋爱|桜木桜|KADOKAWA|桃文|小说|纯爱|狗粮|clear|小说系列|日本",
  343241: "轻小说|恋爱|校园|败犬|搞笑|雨森たきび|青春|恋爱喜剧|GAGAGA文库|2021|小说",
  351025: "漫画|复仇|监禁|R18|卖肉|小说改|轻小说改|老套|限制|大便|异世界",
  352430: "漫画系列",
  373153: "漫画|后宫|稲葉みのり|恋爱|成年コミック|2022|NTR|绿帽男？|职场|性无能",
  389739: "漫画系列",
  393816: "拔作|CLOCKUP|Galgame|雌小鬼|凌辱|2023|金发教会|GAL|原画超棒|调教|扶她",
  428918: "轻小说|恋爱|党争|搞笑|館西夕木",
  453351: "轻小说|约会大作战|時崎狂三",
  456990: "轻小说|恵比須清司|后宫|恋爱|2023|日轻|日本|小说系列",
  462250: "轻小说|HJ文庫|NSFW|2023|レオナールD",
  479162: "轻小说|2023|web文|KADOKAWA",
  507565: "轻小说|番外|特典集",
  513311: "漫画"
};
