// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.08.31.61
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  22829: "漫画|森薫|女仆|恋爱|英伦风|少女漫画|治愈|2002|森薰|乙女向|月刊コミックビーム",
  29137: "漫画|小山宙哉|励志|梦想|讲谈社|科幻|兄弟|講談社|感人|科幻漫画|2007",
  56289: "后宫|漫画|搞笑|藤代健|月刊少年ガンガン|蓝兰岛|后宫岛|日本|漫画系列|恋爱漫画|未完结漫画",
  58430: "画集",
  73092: "minori|Galgame|巨乳|女儿|12の月のイヴ|鏡遊|汉化|天门|PC|GAL|石原舞",
  103745: "韩漫|漫画|爽文|webtoon|战斗|战斗升级|韩国|神作|2010|条漫|网刊",
  134488: "Galgame|ensemble|音符社|きみしま青|秋野花|大姐姐|绘豚满足|PC|妹|汉化|废萌",
  138626: "少女漫画|漫画|芦原妃名子|少女|集英社|少女漫|职场|恋爱|漫画系列|已完结|熟女漫",
  148464: "漫画|藤崎竜|集英社|科幻|小说改|田中芳樹|藤崎龙|連載中|系列|银河英雄传说",
  210505: "漫画|搞笑|校园|少年漫|西修|2017|週刊少年チャンピオン|周刊少年Champion|日常|日本|热血",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  234799: "漫画|恋爱|色气|校园|福田晋一|cosplay|辣妹|日常|日本|2018|爱情",
  241897: "瀬戸口廉也|Galgame|OVERDRIVE|2019|等汉化|PC|GAL|ADV|瀬戸口复出|生肉|すめらぎ琥珀",
  254885: "漫画|治愈|黑道|萝莉|搞笑|养女儿|2018|日本|つきや|少女漫|连载中",
  258814: "漫画|日常|兄弟|2018|治愈|亲情|青春|完评|小学館|漫画系列|日漫",
  284311: "小说改|日本彩漫|日漫",
  285272: "漫画|恋爱|伪娘|魔法|桜井亜都|女装|日本|已完结|青文出版社|幼驯染|2019",
  299584: "漫画|小说改|奇幻|轻小说改|异世界|天海雪乃|2019|装逼|2025-11|战斗|ヤングエースUP",
  300628: "冒险|奇幻|异世界|漫画|养女儿|小说改|2020|蕗野冬|轻改|转生|轻小说改",
  302561: "韩漫|漫画|爽文|战斗|龙傲天|热血|系统|韩国|奇幻|小说改|条漫",
  303323: "漫画|日常|百合|成家慎一郎|表情包|萌|2020|漫画系列|搞笑|KADOKAWA|系列",
  306926: "异世界|漫画|小说改|奇幻|小鈴危一|漫画系列|战斗|转生|正太|冒险|阴阳师",
  314942: "漫画|搞笑|日常|校园|はれやまはれぞう|日本|治愈|短篇|系列|可爱|漫画系列",
  321869: "漫画|恋爱|轻改|東鉄神|搞笑|忘年恋|年上|2020|姐弟恋|轻小说改|小说改",
  338544: "漫画|搞笑|杀手|南勝久|2021|战斗|黑道|日常|犯罪|青年漫画|日本",
  355897: "日漫|小说改",
  362486: "恐怖|漫画|猎奇|悬疑|黑暗|的野アンジ|短篇集|小学館|日本|2021|已完结",
  376012: "韩漫|漫画|搞笑|韩国|异世界|颜艺|穿越|小说改|webtoon|男性向|韩国漫画",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|日本|原创|校园|講談社|漫画系列|nonco",
  392492: "日本|漫画|系列|漫画系列|已完结",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|杀手|连载中|少年JUMPPLUS|日本",
  423465: "漫画|后宫|恋爱|校园|搞笑|2023|マツモトケンゴ|卖肉|欢乐|ニコニコ静画|一般向",
  497921: "恋爱|校园|党争|漫画|日本|连载中|原创|2024|集英社|小野玄晖|少年",
  502536: "漫画|奇幻|冒险|战斗|精灵|魔法|美食|治愈|漫画系列|连载中|2026-03",
  510278: "恋爱|漫画|校园|日常|挑逗|日本|恩田ゆじ|系列|连载中",
  510299: "漫画|集英社|战斗|2024|校园|日本|JUMP|原创|热血|分镜还行，剧情一般",
  511646: "漫画|致郁|原创|日本|百合|亜月ねね|2024|连载中|边缘群体|青年|系列",
  513971: "PC|全年龄|紺野アスタ|羊宫妃那|游戏|ゆさの|Galgame|渡辺明夫|短篇|VN|26",
  516783: "校园|漫画|日常|小说改|一般向|日本|黑长直|同居|套路|打胶打出幻觉了|森あいり",
  546720: "恋爱|漫画|韩国|职场|webtoon|原创|连载中|韩漫|우시목|이하안|UP"
};
