// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.04.22.66
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  565: "青山刚昌|漫画|推理|万年小学生系列|柯南|小学馆|1994|青山剛昌|名侦探柯南|死神小学生|青山剛昌的長期飯票",
  10497: "KOTOKO|神无月的巫女|I’ve|ED|神曲|OP|ACG|K姐神碟|2004|百合|高濑一矢",
  21098: "key|OST|麻枝准|水月陵|Rewrite|折户伸治|井内舞子|galgame|细井聪司|多田葵|治愈",
  25929: "霜月はるか|真理絵|茶太|GWAVE|galgame|ゲーム",
  30765: "收录曲|galgame|榊原ゆい|ceui|生天目仁美|Lia|ゲーム|mizuho|居中|演唱会合集|Masa",
  32491: "漫画|丧女|日常|谷川ニコ|搞笑|百合|不管我怎么去想我不受欢迎这件事都是你们的错!|后宫|漫画系列|校园|2011",
  43563: "漫画|头文字D|运动|竞技|1995|しげの秀一|AE86|90年代|热血沸腾|已完结",
  55423: "漫画|下口智裕|清水荣一|奥特曼|月刊ヒーローズ|特摄|科幻|钢铁曼|2011",
  87015: "松田奈緒子|小学館|漫画|月刊!スピリッツ|职场|日常|2012|连载中|治愈|系列|青年",
  87935: "galgame|茶太|KOTOKO|片霧烈火|霜月はるか|ceui|GWAVE|のりこ|百花繚乱エリクシル|2013|ゲーム",
  95712: "漫画系列|漫画|已完结|¬|全28卷",
  129311: "漫画|战斗|集英社|科幻|赛博格|义体|カラスマタスク|2014|2013|漫画系列|2013年",
  148464: "集英社|藤崎竜|漫画|小说改|田中芳樹|科幻|藤崎龙|系列|連載中|日本|轻小说改",
  196774: "漫画|大今良時|奇幻|讲谈社|週刊少年マガジン|2016|連載中|少年漫画|周刊少年magazine|大今良时|講談社",
  198387: "百合|漫画|日常|四格|一迅社|コミック百合姫|ソフト百合|Loli|2016|搞笑|お笑い",
  198901: "美食|漫画|异世界|穿越|奇幻|轻改|2015|小说改|KADOKAWA|日常|漫画系列",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|讲谈社|搞笑|連載中|講談社",
  268636: "东野圭吾|推理|小说|東野圭吾",
  272951: "异世界|漫画|转生|小说改|战斗|轻改|皇ハマオ|开挂无敌|轻小说改|漫画系列|后宫",
  272967: "漫画|奇幻|猪熊しのぶ|R18|搞笑|卖肉|工口|2018|异世界|限制|泡泡浴",
  273389: "漫画|异世界|小说改|龙傲天|漫画系列|轻改|轻小说改|搞笑|大量魔改原作剧情|画风|吞设定",
  282215: "白井智之|推理|小说|猎奇|悬疑|轻小说|全一卷|日轻",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  302417: "星空めてお|Liar-soft|Galgame|中村哲也|FD|PC|2004|GAL|视频通关|爱欲|乡愁",
  306888: "百合|漫画|小说改|异世界|コミック百合姫|恶役千金|青乃下|恋爱|2020|漫画系列|轻改",
  307607: "漫画|异世界|左藤真通|网游|奇幻|搞笑|游戏|2020|bug|連載中|战斗",
  310006: "漫画|日常|狗粮|治愈|恋爱|返老还童|2020|乡村|新挑限|漫画系列|甜",
  313048: "小说改|日本|系列|漫画|轻小说改|连载中|漫画系列",
  318611: "漫画|战斗|异世界|魔法|大森藤ノ|奇幻|青井聖|漫画系列|校园|2020|小说改",
  323196: "漫画|励志|热血|久住太陽|小栗帽|竞技|外传|赛马娘|运动|2020|杉浦理史",
  326285: "漫画|战斗|講談社|漫画系列|2021|铃木央|奇幻|少年漫画|系列|原创|日本",
  329101: "漫画|甘詰留太|R18|限制|青年漫画|卖肉|未完结漫画|恋爱|R15|ヤングキング|搞笑",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|2021|龙幸伸",
  334277: "漫画|春輝|R18|限制|成年コミック|漫画系列|真实故事改编|素人|卖肉|短篇|青年漫",
  337121: "漫画系列|少女|漫画|りぼん|集英社|少女漫|酒井まゆ",
  340068: "小说改|漫画系列",
  343657: "漫画|奇幻|异世界|轻小说改|小说改|漫画系列|少年漫|門司雪|战斗|B漫|アルト",
  358112: "小说|推理|浅倉秋成|轻小说|浅仓秋成",
  368804: "漫画|战斗|奇幻|講談社|2022|裏那圭|漫画系列|热血|废品|原创",
  385211: "恋爱|漫画系列|漫画|2020",
  393584: "漫画|轻小说改|漫画系列|恋爱|小说改|校园|日常|2022|20话以内",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|系列|漫画系列|連載中",
  414664: "漫画|卖肉|守月史貴|講談社|成年コミック|ヤンマガWeb|2023",
  418952: "推理|白井智之|小说|猎奇|2021|变态|轻小说|黑暗|悬疑|虐妹|短篇",
  446380: "轻小说|贺东招二|全金属狂潮|小说系列|2024",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  454851: "后宫|漫画|佐原玄清|卖肉|穿越|校园|奇幻|R15|恋爱|漫画系列|异世界转移",
  462047: "",
  465306: "",
  483635: "女仆|异世界|日常|美食|7.5|王宫|厨师",
  487413: "HOOKSOFT|Galgame|幼驯染|废萌|K子|纯爱|2024|渡辺僚一|PC|青梅|拔作",
  509948: "JRPG|炼金工房|PC|2025|RPG|Gust|PS5|光荣特库摩|游戏|Switch|XSX",
  538438: "恋爱|少女|奇幻|国漫|漫画|国产|中国|已完结|乙女向"
};
