// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.10.36
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  19696: "百合|漫画|阿卡林|摇曳百合|日常|搞笑|一迅社|なもり|校园|百合姬|萌",
  46664: "漫画|甘詰留太|工口|SM|恋愛|奈奈与薫的SM日记|BDSM|已完结|恋爱|系列|2008",
  53046: "漫画|椎名高志|漫画系列|战斗|奇幻|少年漫画|超能力|已完结|2005",
  56233: "漫画|推理|加藤元浩|Q.E.D.证明终了|講談社|校园|神通小侦探|Q.E.D.|漫画系列|1997|智斗",
  57889: "漫画|搞笑|宮下あきら|1985|魁男塾|已完结|原创|日本|日本漫画|搞笑漫画|全34卷",
  64113: "One|漫画|热血|搞笑|超能力系|超能力|小学馆|2012|灵能|少年漫画|战斗",
  94928: "少女漫画|漫画|春田なな|校园|恋爱|少女|男二控|春田菜菜|少女漫|少女マンガ|漫画系列",
  95190: "藤島康介|机械|搞笑|治愈|漫画|日常|漫画系列|2001年",
  129632: "漫画|怪谈|奇幻|一般向|忧郁的物怪庵|漫画系列|★マンガ|轻腐|双男主|☆主条目|期待度1",
  187083: "alcot|Galgame|艹妈|萝莉|现在就想推亲娘|くすはらゆい|五行なずな|遠野そよぎ|PC|汉化|2016年10月",
  198385: "百合|漫画|tMnR|コミック百合姫|百合姬|爱上嫂子|虐|漫画系列|社会人|家庭伦理|嫂子文学",
  207883: "漫画|恋爱|校园|狗粮|日常|搞笑|水あさと|萌|集英社|暖心|2017",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|转生|异世界|R18|KADOKAWA",
  268279: "藤本タツキ|漫画|战斗|邪道|热血|周刊少年JUMP|集英社|自由人|藤本树|少年JUMP|2018",
  285509: "BL|漫画|恋爱|耽美|少女漫画|恋爱漫画|アルコ|2019|漫画系列|BLコミック|ひねくれ渡",
  292572: "漫画|眉月じゅん|恋爱|科幻|集英社|2019|少女漫画|週刊ヤングジャンプ|日本|青年漫|連載中",
  306812: "百合|漫画|恋爱|后宫|校园|轻小说改|2020|日常|みかみてれん|むっしゅ|漫画系列",
  308152: "百合|漫画|七路ゆうき|みかみてれん|三角关系|已完结|2020|校园|恋爱|漫画系列|奇幻",
  324865: "漫画|人妻|卖肉|2021|节操|漫画系列|エロ|一般向|假面骑士W",
  327316: "漫画|西尾维新|絵本奈央|小说改|奇幻|绘本奈央|西尾維新|漫画系列|2021|輕改|日漫",
  330890: "漫画|漫画系列",
  332937: "TL|漫画|R18|恋爱|女性向|穿越|奇幻|人外|TL漫画|限制",
  354130: "漫画|奇幻|2021|森下真|月刊少年マガジン|講談社|勇者|原创|漫画系列|搞笑|日常",
  355540: "恋爱|漫画|校园|日常|一般向|已完结|漫画系列|青年|逆推|日本|完结",
  367226: "恋爱|漫画|少女漫|偶像|少女|2021|少女漫画|搞笑|花とゆめ|白泉社|師走ゆき",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|节操|2022|喜剧|むちまろ",
  404495: "AVG|游戏|PC|同人|freegame|Web|DJ|2021|短篇",
  422014: "轻小说|榛名丼|恋爱|奇幻|校园|青春|小说|2023|迷惘|复制人|日本",
  449427: "漫画|战斗|搞笑|怪兽|小学馆|ヨシアキ|2023|日本|变身|原创|连载中",
  456696: "Galgame|Purplesoftware|紫社|分割商法|PC|续作|かずきふみ|2024|悬疑|拔作|GAL",
  459368: "Galgame|whirlpool|明羽杏子|夏和小|秋野花|废萌|くすはらゆい|水鏡まみず|近江谷宥|2024|修女",
  467935: "轻小说|萬屋久兵衛|桃子|絵葉ましろ",
  501478: "",
  506788: "Galgame|AVG|Type-Moon|FD|PC|NS|Fate|游戏|Switch|2025+|2024",
  527456: "",
  531887: "同人|NANTEDOW",
  558742: "小高和刚|中泽工|PC|2025|悬疑|AVG|ADV|北山猛邦|NS|游戏|推理"
};
