// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.01.02.68
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3821: "绿川幸|治愈|漫画|白泉社|夏目友人帳|温暖画风|妖怪志|催泪弹|緑川ゆき|治愈系|怪谈",
  13982: "漫画|热血|加藤和惠|青驱|JUMP|集英社|青之驱魔师|恶魔|青の祓魔師|战斗|2009",
  28648: "松本大洋|漫画|乒乓|运动|1996|竞技|青春|小学馆|运动系|体育|小学館",
  32612: "漫画|安达充|已完结|经典|少年|あだち充|棒球|运动|1981|版本|恋爱",
  86363: "同人|东方|ACT|PC|Platform|東方Project|東方|游戏|动作|游戏分类:ACT",
  100903: "漫画|萝球社|萌|たかみ裕紀|轻改|¬|漫画系列|小学生|篮球|蒼山サグ|搜索用",
  130879: "漫画|少女|少女漫画|少女マンガ|台漫",
  196774: "漫画|大今良時|奇幻|讲谈社|週刊少年マガジン|2016|連載中|少年漫画|周刊少年magazine|大今良时|講談社",
  199265: "野切耀子|已完结|少女漫画|日漫|三角股|漫画",
  212732: "Galgame|alicesoft|拔作|凌辱|NTR|御苑生メイ|GAL|2017|ADV|游戏性|鈴谷まや",
  216074: "漫画|比村奇石|奶子|治愈|日常|社畜|搞笑|职场|pixiv|漫画系列|比村乳业",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  241088: "漫画|芳文社|百合|音乐|四格|轻百合|摇滚|はまじあき|2018|社恐|まんがタイムきららMAX",
  241623: "音游|国产|手游|独立游戏|PC|PeroPeroGames|STEAM|MUG|2018|Android|心动网络",
  242602: "漫画|种田|穿越|历史|小说改|2017|沢田一|轻小说改|连载中|日本|夾竹桃・平沢下戸",
  247392: "漫画|异世界|小说改|轻小说改|轻改|漫画系列|转生|连载中|蘭々|正太|系列",
  247878: "漫画|日本|情怀向|叶王|已完结|漫画系列|少年マガジンエッジ|系列|A级|日漫|講談社",
  259816: "漫画|棒球|みかわ絵子|少年JUMP+|运动|竞技|体育漫画|集英社|2018|搞笑|热血",
  272759: "恋爱|漫画|校园|穿越|师生|轻改|小说改|2019|松元こみかん|漫画系列|已完结",
  281760: "漫画|恋爱|狗粮|日常|校园|真木蛍五|2019|講談社|漫画系列|マンガ|好甜的狗粮",
  292572: "漫画|眉月じゅん|恋爱|科幻|集英社|2019|日本|少女漫画|青年漫|週刊ヤングジャンプ|連載中",
  298405: "漫画|漫画系列|少女|奇幻|连载中|日本|日漫|原创|系列",
  306791: "战棋|国产|PC|SLG|MICAteam云母组|SRPG|面包房少女|散爆网络|解谜|2024|重制",
  318247: "漫画|后宫|福利|搞笑|卖肉|2020|奇幻|西游|性转|クリスタルな洋介|小学館",
  325236: "漫画|搞笑|篠原健太|奇幻|集英社|週刊少年ジャンプ|2021|周刊少年JUMP|校园|日本|超自然日常",
  330890: "好孩子|日常|漫画|萝莉|心灵感应|超能力|漫画系列|画功不太行|7.4|@|养女儿",
  337417: "伪娘|漫画|虚拟主播|vtuber|萝莉|漫画系列|正太|2021|萌|日常",
  337711: "漫画|少女|人外|原创|日本|系列|优先|连载中|限制",
  347848: "漫画|轻小说改|恋爱|校园|2021|日常|小说改|一般向|日本|カメーリエ|搞笑",
  353203: "漫画|搞笑|平方昌宏|魅魔|漫画系列|系列|奇幻|原创|已完结|日本|完结",
  355057: "小说改|奇幻|少女漫画|漫画|水辺チカ|连载中|漫画系列|日漫|星彼方|少女漫|日本",
  377510: "ADV|游戏|Galgame|GAL|百合|双龍",
  392095: "漫画|恋爱|校园|小说改|轻小说改|纯爱|漫画系列|2022|轻改|講談社|网络连载",
  393233: "漫画|悬疑|浅見理都|2022|推理|KISS|社会派|漫画系列|已完结|系列|日本",
  411770: "少女漫画|中国|台漫",
  411774: "少女漫画|中国|漫画系列|台漫",
  411777: "中国|少女漫画|动漫|林青慧",
  411780: "漫画|少女漫画|台漫",
  411781: "台漫|少女漫画",
  411782: "少女漫画|台漫",
  411785: "少女漫画|台漫",
  411786: "少女漫画|国漫|中国",
  411789: "",
  412571: "漫画|年上|悬疑|侦探|恋爱|日常|ガス山タンク|椹木伸一|一般向|搞笑|连载中",
  419991: "画集|已购",
  421548: "异世界|漫画|战斗|齋藤勁吾|萝莉|奇幻|热血|2023|KADOKAWA|搞笑|ニコニコ静画",
  439204: "漫画|异世界|奇幻|2023|轻改|杉浦次郎|奴隶|厕纸系列|うめ丸|画功好|コミックウォーカー",
  439690: "漫画|卖肉|恋爱|2023|龍大和|已完结|校园|系列|原创|日本|后宫",
  456344: "漫画|弐瓶勉|冒险|奇幻|科幻|連載中|2023|講談社|大世界观|マンガ|龙之塔",
  459165: "漫画|百合|inee|恋爱|2023|KADOKAWA|原创|战斗|连载中|系列",
  465685: "画集・設定資料集",
  470297: "key|Galgame|全年龄|萝莉|PC|ADV|松山剛|2025|腾讯游戏|游戏|国g",
  471237: "Galgame|MELLOW|垂花|2024|NTR|夢乃ゆき|PC|R18|ADV|致郁|天使",
  504475: "画集",
  510140: "",
  515211: "银河恶魔城|ARPG|PC|PS5|NS|Platform|PS4|游戏|单机游戏|XboxOne",
  515527: "炼金工房|RPG|JRPG|2025|PS5|Gust|PC|游戏|PS4|NS|工作室",
  515909: "画集",
  523497: "Galgame|拔作|Escu:de|民俗|R18|悬疑|ADV|PC|小仓结衣|2025|游戏",
  530627: "日本|漫画|系列|连载中|漫画改",
  554946: "Galgame|妹|PC|インテグラル|萝莉|cittan|2025|妹控|同人|ADV|游戏",
  570429: "RPG|JRPG|游戏|PC|NS|工作室|NS2|2025年|PS5|PS4"
};
