// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.24.48
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  7400: "田中ロミオ|Galgame|希|民俗|雰囲気がいい|Meteor|古风|文艺希|雑学|館もの|2004",
  19002: "新岛夕|Galgame|SAGAPLANETS|暖人心田|毕业作|初雪樱|治愈|纯爱|虐心|水月陵|fripside",
  20629: "轻小说|海冬レイジ|松竜|复数卷",
  28863: "轻小说|近衛乙嗣|系列|ツカサ|复数卷|日本|小说",
  35410: "轻小说|海冬レイジ|复数卷|海冬|松竜|レイジ|小说系列",
  62879: "漫画|板垣惠介|格斗|热血|板垣恵介|2006|搞笑|周刊少年Champion|格斗漫画|战斗|已完结",
  73738: "Galgame|すたじお緑茶|GAL|废萌|绿茶社|石原舞|PC|ADV|妹|2014|るちえ",
  135693: "少女|漫画|已完结|漫画系列|日高万里",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|2016|黑丝",
  207478: "漫画|战斗|妖怪|藍本松|2016|热血|集英社|少年漫画|ジャンプスクエア|ジャンプSQ.|少年漫",
  215285: "漫画|异世界|轻改|后宫|恋爱|2016|战斗|RoGa|白米良|小说改",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|少女漫画|日本漫画|山下知子|系列|日常|FEELYOUNG",
  229111: "搞笑|漫画|尖端|小说改|完结|已完结|素晴",
  240662: "漫画|职场|恋爱|狗粮|しろまんた|一迅社|2018|网络连载|萌|连载中|体型差",
  241523: "漫画|搞笑|奇幻|轻小说改|暁なつめ|战斗|后宫|漫画系列|2018|系列|末世",
  248630: "推理|今村昌弘|小说|推理小说|丧尸|悬疑|轻小说|2017|奇幻|日本|恋爱",
  266197: "荒木飛呂彦|漫画|2013|短篇|悬疑|集英社|荒木飞吕彦|jojo|短篇集|超能力|日本漫画",
  270385: "异世界|转生|漫画系列|2018|恶役千金|搞笑|LaLa|恶役|冬夏アキハル|求求快更",
  282554: "漫画",
  284854: "漫画|异世界|轻小说改|漫画系列|小说改|日常",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  296466: "漫画|后宫|搞笑|恋爱|校园|集英社|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  297179: "漫画|碧蓝航线|漫画系列",
  297288: "洛天依|许嵩",
  298192: "漫画|东方|奇幻|2019|東方project|水炊き|zun|水本正|日常|月刊コンプエース|8分",
  299943: "恋爱|芳文社|漫画系列|漫画|无聊",
  303323: "漫画|日常|百合|成家慎一郎|表情包|萌|漫画系列|KADOKAWA|2020|搞笑|系列",
  304449: "轻小说|恋爱|多线结局|家出|福山陽士|已完结小说|小说系列|2019|富士见|JK|同居",
  307336: "perfume|日语",
  308628: "百合|漫画|姐妹|漫画系列|糖度超标|日常|2020|双子|骨科|甜|一般向",
  320214: "漫画|异世界|轻改|2020|战斗|小说改|网游|策略|穿越|奇幻|漫画系列",
  320804: "轻小说|Type-Moon|奇幻|小说|三田诚|系列|2020|三田誠|Fate|原创|连载中",
  322229: "异世界|漫画|小说改|日常|漫画系列|B漫",
  326803: "轻小说|中国",
  330139: "小说改|漫画|双穿门|轻小说改|倒卖|简单模式|奇幻|兽耳|漫画系列|异世界|弱智",
  333285: "漫画|日常|真造圭伍|治愈|2021|小学館|一般向漫画|现实|日本|慢生活",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  347848: "漫画|轻小说改|恋爱|2021|一般向|小说改|カメーリエ|日本|日常|校园|补标",
  355164: "小说改|漫画系列|恋爱|异世界",
  363864: "漫画|恋爱|小说改|幼驯染|轻小说改|日常|校园|六升六郎太|奇幻|漫画系列|一般向",
  390761: "漫画|推理|小说改|青崎有吾|校园|青春|悬疑|全2卷|已完结|漫画系列|短篇集",
  424382: "漫画",
  429256: "轻小说",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  433726: "漫画|一般向|小说改",
  436144: "轻小说|詠井晴佳|小说|青春|2023|轻小说分卷|ガガガ文庫|萩森じあ",
  438329: "漫画|小说改|恋爱",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  451231: "漫画|校园|JK|連載中|一般向|20话以内|色|短篇|2023|全一巻|恋爱",
  458514: "百合|漫画|日常|魔女|治愈|花|奇幻|2023|连载中|浜弓場双",
  464543: "少女",
  477849: "漫画|战斗|漫画系列",
  533337: "小说|推理|高野結史"
};
