// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.16.73
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  11028: "龙骑士07|悬疑|Galgame|うみねこのなく頃に|推理|AVG|猎奇|神作|竜騎士07|PS3|龙骑士",
  34107: "Galgame|柚子社|PSP|天神乱漫|废萌|ゆずソフト|GAL|Yuzu-Soft|若叶俺の嫁|妹控|伊藤静",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  227176: "女装|Galgame|キャラメルBOX|伪娘|のり太|2018|嵩夜あや|PC|银发少女（？）|ADV|雰囲気がいい",
  239254: "异世界|漫画|小说改|穿越|FUNA|百合|奇幻|轻小说改|轻改|モトエ恵介|2017",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|つきや|日本|少女漫|连载中",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  283293: "漫画系列|漫画|2019|青年漫画|沙村广明|系列|历史|月刊アフタヌーン|永生|講談社|讲谈社",
  289342: "漫画|科幻|轻改|战斗|增强现实|赛博格|纳米机器|2019|綾村切人|小说改|枪战",
  299985: "漫画|异世界|NTR|卖肉|R18|穿越|小说改|轻改|NTL|奇幻|漫画系列",
  300431: "漫画|峰浪りょう|恋爱|青春|阴间|病娇|胃药|2020|青年漫|集英社|扭曲",
  312150: "轻小说|恋爱|校园|小说系列|狗粮|フライ|日本|系列|戀愛|小说|校園",
  316809: "漫画|恋爱|美食|ハナツカシオリ|爱情|日常|講談社|日漫|2020|漫画系列|日本",
  320214: "漫画|异世界|轻改|2020|战斗|小说改|网游|策略|穿越|奇幻|漫画系列",
  332250: "漫画|龍幸伸|战斗|怪谈|奇幻|集英社|JUMP+|搞笑|少年ジャンプ＋|日本|2021",
  335516: "漫画|恋爱|奇幻|漫画系列|吸血鬼|2021|KADOKAWA|fmt.Manga",
  349866: "漫画|恋爱|小说改|倒贴|一般向|椀田くろ|氷高悠|日常|桃子|漫画系列|2022",
  353857: "百合|漫画|异世界|奇幻|Be-con|猎奇|2021|青騎士|姐妹|KADOKAWA|漫画系列",
  395984: "异世界|漫画|正太|种田流|奇幻|漫画系列|青色まろ|赤池宗|轻小说改|B漫|日本漫画",
  414664: "漫画|卖肉|守月史貴|講談社|成年コミック|ヤンマガWeb|2023",
  436731: "ARPG|游戏|PC|NS|PS4|XSX|PS5|XboxOne",
  472654: "轻小说|及川輝新",
  520060: "ARPG|PC|游戏|PS5|XSX",
  530029: "轻小说|水城水城|恋爱|校园|2025|KADOKAWA|MF文库J|潮崎しの",
  544568: "轻小说|綾坂キョウ",
  556500: ""
};
