// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.10.11.37
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  10787: "漫画|石黒正数|日常|搞笑|治愈|石黑正数|2005|推理|脑洞大开|女仆咖啡厅|日常系",
  38542: "国产|Galgame|PC|STEAM|AVG|洋红工房|2011|中国|GAL|国g|游戏",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|日常|椿泉",
  67270: "漫画|狼的孩子雨和雪|细田守|治愈|母爱|優|萌系|已完结|兽耳|日漫|动画改",
  89134: "轻小说|战争|世界观|小说|小说系列|战斗|系列|水野良|深遊|纸质书",
  101610: "講談社|漫画|已完结|漫画系列|职场|日漫|严肃|弘兼憲史|弘兼宪史|总|全6卷",
  118165: "搞笑|漫画|颜艺|井上堅二|吉岡公威|恋爱|潜水|智障|裸体|講談社|2014",
  129557: "漫画|百合|搞笑|鈴木健也|搞笑漫画|2014|KADOKAWA|台灣角川|10年代|校园|漫画シリーズ",
  141545: "轻小说|入間人間|一卷全|珈琲貴族|入间人间|小说|2015",
  163847: "异世界|漫画|轻改|魔物娘|穿越|轻小说改|后宫|木野コトラ|漫画系列|搞笑|双女主",
  176089: "漫画|恋爱|校园|生活|日漫|爱情|NTR|B漫|マンガ|打工",
  182224: "漫画|R18|山口譲司|不伦|漫画系列|料理|卖肉|18X|複数巻|連載中|集英社",
  184047: "国产|Galgame|洋红工房|PC|国产Galgame|百合|3D渲染|生死观|STEAM|良心|佳作",
  186792: "STEAM|国产|乙女向|AVG|PC|Galgame|大白腿|游戏|2015|VN|Mac",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|黑丝|2016",
  193910: "漫画|少女漫画|村田真優|少女|恋爱|漫画系列|校园|狗粮|りぼん|青春校园，胃疼|少女漫",
  209535: "漫画|异世界|轻改|性转|すえみつぢっか|小说改|穿越|搞笑|漫画系列|2016|性转换",
  219993: "漫画|日常|恋爱|家庭|人妻|搞笑|稲葉光史|甜|小学馆|擅长捉弄人的西片太太|虐狗",
  223845: "漫画|搞笑|小说改|恶役千金|逆后宫|ひだかなみ|转生|山口悟|恋爱|轻小说改|乙女向",
  238756: "漫画|小说改|推理|日向夏|古风|倉田三ノ路|小学馆|漫画系列|小学館|2017",
  248883: "漫画|恋爱|校园|搞笑|肉番|狗粮|丈|2018|喜剧|快结婚|KADOKAWA",
  272611: "漫画|青春|校园|恋爱|高松美咲|講談社|2018|月刊アフタヌーン|日常|少女漫画|成长",
  273590: "轻小说|异世界|转生",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  285477: "漫画|异世界|轻小说改|山田J太|轻改|小说改|卖肉|新潮社|2019|职场|穿越",
  291900: "少女漫画|恋爱|漫画|リカチ|2019|日本漫画|宫廷|漫画系列|战斗|魔法|冒险",
  298144: "百合|漫画|江島絵理|竞技|热血|2020|搞笑|コミックフラッパー|格斗游戏|2023|7.2",
  298217: "漫画|恋爱|小说改|漫画系列|校园|倒贴|一般向|平岡平|三河ごーすと|SE|党争",
  303490: "小说改|漫画|恋爱|奇幻|轻小说改|2019|大庭そと|一迅社|漫画系列|异世界|山田桐子",
  304293: "漫画|恋爱|校园|漫画系列|青春|2020|轻小说|小说改|ボブキャ|マンガUP！裕夢",
  307237: "漫画|运动|体育|滑冰|热血|励志|竞技|日本|つるまいかだ|2020|原创",
  313877: "百合|漫画|奇幻|人外|猎奇|苗川采|2020|妖怪|漫画系列|日漫|轻百合",
  318168: "漫画|少女漫|狗粮|水曜日のシリウス|恋爱|マツモトケンゴ|少女漫画|日常|漫画系列|33",
  320977: "小说改|漫画|异世界|漫画系列|雪乃|7.8|已完结|天生一对|正太|恋爱",
  321869: "漫画|恋爱|轻改|忘年恋|東鉄神|搞笑|年上|2020|姐弟恋|小说改|漫画系列",
  324416: "漫画|恋爱|后宫|日常|搞笑|2021|多女主|内藤マーシー|周刊少年magazine|日本|党争",
  328029: "SMEE|Galgame|纯爱|甜作|2021|早瀬ゆう|PC|废萌|K子|黑长直|月野きいろ",
  333285: "漫画|日常|真造圭伍|治愈|2021|小学館|慢生活|一般向漫画|日本|现实",
  335456: "轻小说|杉井光|音乐|校园|后宫|小说|小说系列|日本|2020|杉井光的音乐轻小说不得不品|恋爱",
  336108: "漫画系列|已完结|全2卷",
  339138: "漫画|恋爱|悬疑|朝賀庵|扭曲|2021|几乎没有正常人系列|已完结|週刊ヤングマガジン|漫画系列",
  340182: "百合|轻小说|平坂読|小说系列|上垒|小说|2020|GA文库",
  355555: "恋爱|漫画|校园|青春|三香見サカ|講談社|日本|2021|画风好|漫画系列|连载中",
  364561: "小说系列|轻小说|龙傲天",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|热血|集英社|大女主|週刊少年ジャンプ|连载中|日本",
  388039: "漫画|恋爱|校园|小说改|八神鏡|倒贴|轻小说改|2022|きぐるみ|コミックライド|轻改",
  388852: "漫画|恋爱|校园|日常|漫画系列|阴角|碇マナツ",
  390325: "漫画|2022年|兄妹|恋爱|小说改|漫画系列|校园|轻小说改|KADOKAWA|中性角色|义妹",
  392483: "漫画系列|科幻|2022|游戏改|法国原作改编",
  393233: "漫画|悬疑|浅見理都|2022|推理|KISS|社会派|漫画系列|已完结|系列|日本",
  397777: "漫画|一般向|搞笑|漫画系列|战斗|7.4|在看|伪化|魔木|日漫|b级片",
  403992: "百合|漫画|漫画系列|ろここ|2022|KADOKAWA|真百|短篇集|校园|コミックフラッパー|恋爱",
  424917: "漫画",
  425732: "轻小说|后宫|2022|WEB|ファンタジア文庫|异世界",
  436747: "漫画|芳文社|外传|日常|音乐|搞笑|2023|Kirara|くみちょう|日本|连载中",
  440063: "BL|漫画|耽美|人外|BLコミック|奇幻|シュークリーム",
  466654: "轻小说|白井ムク|2023|小说|连载文|双子",
  475214: "小说|轻小说|校园|西幻",
  482879: "",
  484353: "轻小说|小说|小说系列|2023|有象利路|系列|奇幻|连载中|狗粮",
  485035: "轻小说",
  492231: "漫画|日常|漫画系列|面包店|百合|画风故事人物舒服|轻百合|貞松龍壱|雪乃|镰仓市|8",
  498301: "轻小说|SBクリエイティブ|恋爱|柚本悠斗",
  508124: "轻小说|后宫|催眠|催眠侠|搞笑|WEB|みょん|2024|已完结|校园|奇幻",
  509947: "JRPG|falcom|RPG|轨迹系列|PC|2025|游戏|PS5|STEAM|英雄传说|NS",
  509948: "炼金工房|JRPG|PC|RPG|Gust|2025|PS5|游戏|光荣特库摩|STEAM|NS",
  541044: "轻小说",
  562302: "小说|系列|日本",
  592501: "Galgame"
};
