// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.09.07.57
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  25950: "漫画|皆川亮二|漫画系列|科幻|战斗|青年漫画|日本漫画|奇幻|小学館|週刊少年サンデー|1997",
  49974: "漫画|西森博之|校园|小学館|1988|少年漫画|完结|週刊少年サンデー|不良少年|漫画系列|犯罪",
  77199: "韩露|耽美|国漫|漫画|漫友|BL漫画|华丽派|BL|BLコミック|漫画中的插画|国产",
  98253: "漫画|后宫|恋爱|异世界|めいびい|卖肉|指环王|奇幻|已完结|穿越|2014",
  118165: "搞笑|漫画|颜艺|井上堅二|恋爱|吉岡公威|潜水|智障|裸体|講談社|日本",
  310983: "漫画|少女漫画|恋爱|校园|やまもり三香|2020|少女|講談社|デザート|连载中|少女漫",
  324621: "Galgame|渡辺僚一|百合|悬疑|シルキーズプラス|futa|扶她|2021|あめとゆき|科幻|百合？",
  329306: "百合|漫画|搞笑|芳文社|Kirara|肉丸|四格|BadGirl|2020|2021",
  350856: "小说改|漫画系列|系列|日本|漫画|连载中|轻小说改",
  357105: "小说改|漫画系列",
  377230: "日本|原创|漫画|系列|漫画系列|2025-12|连载中",
  402768: "gal改|漫画系列|游戏改|2023|漫画|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  405411: "武侠|韩漫|韩国|复仇|古风|漫画|小说改|已完结|黑暗|webtoon",
  409168: "漫画|热血|东立出版社|2022|类型:漫画|龙|画风有魄力|少年|好看|系列",
  427432: "恋爱|漫画|卯月ココ|校园|少女漫|講談社|2023|少女|少女漫画|デザート|連載中",
  441381: "台湾|武侠|漫画|青年漫画|性|国产|喜劇|台灣|麥人杰|武俠|臺版",
  443107: "漫画|恋爱|重女|职场|搞笑|あきやま|日常|日本|2023|青年|週刊ヤングジャンプ",
  480993: "漫画|日本|战斗|奇幻|烂尾|已完结|腰斩|一般向|倒贴|开挂无敌|小说改",
  485466: "百合|漫画|后宫|奇幻|2024|日常|コミック百合姫|しぼりかすこ|恋爱|真百|2025",
  491875: "漫画|限制",
  506844: "奇幻|漫画|2024|连载中|小学馆|原创|日本|老师|东立出版社|小学館",
  524654: "百合|漫画|校园|恋爱|2024|とりいしづく|甜|真百|单行本|已完结|搞笑",
  539793: "恋爱|少女漫画|兄友|连载中|少女漫|系列|少女|漫画|年上男主|日漫BG|搞笑艺人",
  561323: "漫画|日本|卖肉|熟女|后宫|连载中|魔法少女|原创|2025|奇幻|2026-04",
  655873: "2026"
};
