// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.02.70
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6210: "BL|渡瀬悠宇|BL漫画|大正|漫画|虐|耽美|BE|亂倫|渡濑悠宇|獵奇",
  6673: "高永ひなこ|BL|女王受|BL漫画|耽美|恋する暴君|傲娇受|漫画|绿川光|掰彎|海王社",
  12852: "少女漫画|仲村佳树|漫画|白泉社|偶像|京子|好想急死你|仲村佳樹|2002|莲|少女漫",
  19333: "漫画|狂欢节|カーニヴァル|御巫桃也|官方让同人无路可走|腐|2007|科幻|咖喱鸡|合不拢腿的节奏|BL",
  22818: "漫画|森薰|恋爱|民俗|中亚游牧风|女性向|生活|森薫|乙嫁语り|2008|青年漫画",
  31256: "漫画|今市子|灵异|治愈|温情|1995年|1995|日本漫画|连载|百鬼|女性向",
  51380: "漫画|搞笑|麻生周一|日常|吐槽|週刊少年ジャンプ|超能力|JUMP|校园|2012|超能力系",
  67226: "加藤元浩|漫画|推理|2005|月刊少年マガジン|悬疑|超長篇|漫画系列|講談社|已完结|推理漫画",
  75390: "荒川弘|漫画|小说改|講談社|田中芳樹|漫画系列|亚尔斯兰战记|史歌|別冊少年マガジン|讲谈社|战争",
  120999: "轻小说|野村美月|轻小说系列|系列|看书计划",
  189208: "漫画|集英社|三好輝|福尔摩斯|2016|犯罪|日本漫画|竹内良輔|一般向|少年|冒险",
  193866: "漫画|少女",
  218102: "漫画|性转|搞笑|萌|日常|性转换|兄控|ねことうふ|别当欧尼酱了|2017|一迅社",
  219311: "",
  232673: "漫画|NTR|人妻|黒澤R|集英社|2017|出轨|短篇集|爱情|卖肉",
  234032: "漫画|マンガ",
  240376: "漫画|搞笑|魔物娘|异世界|天原|masha|脑洞奇大|2017|绅士|卖肉|ドラドラドラゴンエイジ",
  241026: "轻小说|后宫|复仇|月夜涙|小说系列|调教|垃圾|角川スニーカー文庫|异世界|厕纸|web小说",
  262166: "BL漫画|BL|ためこう|漫画|花嫁|リブレ|BLコミック|成年コミック|日本漫画|伪娘|2018",
  265515: "漫画|异世界|轻改|冒险|2018|奇幻|末世流|战斗|ラルサン|小说改|校园",
  269206: "漫画|异世界|轻改|战斗|奇幻|小说改|2018|合鴨ひろゆき|轻小说改|漫画系列|精灵",
  272351: "格斗|漫画|战斗|2019|漫画系列|格斗漫画|だろめおん|小学館|打斗|老年痴呆|搞笑",
  273292: "漫画|少女漫|小说改|少女漫画|漫画系列|一迅社|系列|日本|少女|连载中|喜久田ゆい",
  285270: "漫画|异世界|轻改|转生|高橋愛|小说改|漫画系列|2019|穿越|龙傲天|搞笑",
  292001: "漫画|漫画系列|养女儿|轻改|轻小说改|日常|异世界|美食|奇幻|搞笑|小说改",
  292874: "BL|はらだ|BL漫画|BLコミック|漫画|2019|竹書房|漫画系列|连载中|触手|日本漫画",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  298455: "漫画|穿越|搞笑|音乐|小川亮|2019|四葉夕卜|派对浪客诸葛孔明|转生|热血|講談社",
  298752: "漫画|格斗|战斗|超能力|奇幻|2020|日本|原创|ゲズンタイト|系列|连载中",
  299227: "漫画|热血|战斗|集英社|周刊少年JUMP|戸塚慶文|奇幻|超能力|2020|恋爱|JUMP",
  299228: "漫画|搞笑|2020|魔法|热血|周刊少年JUMP|集英社|奇幻|战斗|甲本一|少年漫画",
  301904: "漫画|搞笑|奇幻|异世界|小说改|轻小说改|2019|神经病|温馨|基|轻改",
  307793: "恋爱|漫画|漫画系列|已完结",
  308976: "漫画|伦理|科幻|講談社|剧情|うめざわしゅん|战斗|連載中|2020|漫画系列|月刊アフタヌーン",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|漫画系列|女装",
  312483: "历史|漫画系列|漫画",
  325236: "漫画|搞笑|篠原健太|奇幻|集英社|2021|週刊少年ジャンプ|周刊少年JUMP|校园|超自然日常|原创",
  336628: "轻小说|恋爱|青梅|七烏未奏|傲娇|校园|纯糖|講談社|小说|小说系列",
  343657: "漫画|奇幻|异世界|轻小说改|小说改|漫画系列|少年漫|門司雪|B漫|群像|战斗",
  352968: "漫画|奇幻|战斗|小说改|异世界|轻小说改|退队流|2021|よねぞう|套路|小说改编",
  354130: "漫画|奇幻|2021|森下真|月刊少年マガジン|講談社|勇者|原创|漫画系列|搞笑|日常",
  360070: "漫画|恋爱|小说改|后宫|轻小说改|2021|日常|御宮ゆう|香澤陽平|前任|倒贴",
  361988: "漫画|校园霸凌|致郁|奇幻|短篇|タイザン5|外星人|2021|日本|科幻|萝莉",
  377230: "日本|漫画|原创|系列|连载中|漫画系列",
  377761: "漫画|校园|恋爱|いたち|雨森たきび|轻小说改|小说改|败犬|搞笑|小学館|日本",
  390508: "falcom|伊苏|ARPG|JRPG|PS5|2023|RPG|PC|NS|日本ファルコム|PS4",
  412837: "",
  425921: "轻小说|恋爱|类型:轻小说|标签:待改",
  453555: "漫画|已完结|奇幻|日本|恋爱|校园|系列|小说改",
  462719: "一般向|秋田书店|东立出版社|2023",
  478568: "マンガ|連載中|日本|原创|漫画|系列|森屋シロ|连载中",
  482406: "",
  482739: "漫画|日本|奇幻|冒险|原创|已完结|系列",
  489436: "轻小说|3pu",
  496474: "轻小说|香月美夜",
  499056: "漫画",
  509948: "炼金工房|JRPG|PC|RPG|2025|Gust|PS5|游戏|光荣特库摩|STEAM|NS",
  519645: "轻小说|小说系列|恋爱|白毛|日本|日常|2024|校园|系列|GA文庫|小说",
  519667: "",
  530159: "Fragaria|同人|Galgame|PC|游戏|STEAM|世界观|ADV|科幻|待发售",
  537847: "轻小说|恋爱",
  562159: "Galgame|R18|废萌|2020|合集|Windows|纯爱|游戏|校园|ADV|NanaWind"
};
