// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.07.06.70
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1125: "KID|infinity|打越刚太郎|Galgame|Never7|悬疑|AVG|中泽工|PC|轮回开山作|PSP",
  1410: "Nitro+|5pb|Galgame|猎奇|悬疑|混沌头|死宅的妄想力可是很强大的|林直孝|PC|N+|5pb.",
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|OP|少年JUMP",
  48678: "军事|科幻|潜艇|战争|漫画|海上自卫队|モーニング|講談社|川口开治|系列|超長篇",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  123263: "Novectacle|同人|AVG|PC|全年龄|GAL|生肉|一般向|悬疑|Galgame|縹けいか",
  126771: "漫画|芳文社|搞笑|恋爱|漫画系列|美少女|伪娘|四格|中山幸|治愈",
  175554: "漫画|百合|芳文社|日常|搞笑|伊藤いづも|轻百合|街角魔族|2014|欢乐|治愈",
  180064: "漫画|年上|高田桂|腰斩|姐系|姐|KADOKAWA|奇幻|角川書店|兄弟|姐弟",
  186635: "OST|Falcom|空之轨迹|游戏|英雄传说|2016",
  193281: "漫画|搞笑|あらゐけいいち|日常|2016|講談社|CITY|已完结|モーニング|漫画系列|連載中",
  201954: "",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  229644: "漫画|治愈|亲情|浅野りん|美食|和菓子|2016|恋爱|KADOKAWA|漫画系列|连载中",
  237704: "漫画|日常|钓鱼|小坂泰之|校园|搞笑|海洋|2017|科普|连载中|秋田書店",
  272767: "漫画|Type-Moon|2019|Fate|連載中|系列|角川|佐々木少年|fgo|那个女人",
  283254: "百合|漫画|竹嶋えく|恋爱|校园|コミック百合姫|画风优良|2019|音乐|一迅社|日本",
  299584: "漫画|小说改|奇幻|轻小说改|装逼|2019|天海雪乃|异世界|KADOKAWA|战斗|漫画系列",
  300545: "Galgame|分割商法|Steam简中|STEAM|官中|汉化|R18|GAL|纯爱|2020",
  302208: "漫画|Type-Moon|Fate|奇幻|平野稜二|KADOKAWA|战斗|2020|経験値|冲田小姐",
  308570: "漫画|百合|奇幻|双見酔|双葉社|WEB|战斗|漫画系列|原创|webアクション|系列",
  308573: "Galgame|ASa-Project|喜剧|小鳥居夕花|幼驯染|ASaProject|废萌|妹|杏子御津|2020|颜艺社",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|未完结漫画|2020",
  328376: "漫画|校园|卖肉|福利|エロ|色情|搞笑|ムラタコウジ|糟糕|漫画系列|青春",
  336828: "漫画|武田綾乃|むっしゅ|校园|百合|2021|青春|集英社|系列|原创|日本",
  352808: "漫画|短篇|2020|眞藤雅興|奇幻|日漫|JUMP|漫画短篇|超短篇|2020年12月|单篇",
  387177: "漫画|恋爱|校园|はぐはぐ|倒贴|上岸|漫画系列|JK|杀必死|NTR|JC",
  392773: "漫画|奇幻|一般向|异世界|2022|画风好|轻小说改|漫画系列|全员智商在线|穿越游戏|8",
  393233: "漫画|悬疑|浅見理都|漫画系列|推理|KISS|社会派|系列|2022|已完结|日本",
  394427: "百合|ACT|PC|STEAM|PS4|NS|富田美优|官方中文|万雌王|2022|PS5",
  401227: "NS|PC|2025|游戏|符文工房|JRPG|マーベラス|Switch|种田|符文工廠|其他",
  402768: "漫画系列|gal改|游戏改|漫画|2023|萝莉|治愈|机器人|末世",
  403637: "漫画|校园|恋爱|肉丸|原创|NTR？|谜|圈乱|贵乱|NTR|婊子",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|推理|日本漫画|連載中",
  424562: "",
  439727: "漫画|爱情|校园",
  439771: "漫画|异世界|小说改|奇幻|战斗|网游|なろう系|ながワサビ64|7.1|2021|异世界转生",
  441435: "Roguelike|ACT|横版|国产|STEAM|动作|PC|2024|独立游戏|单机|游戏",
  453558: "已完结",
  499874: "小高和刚|打越钢太郎|PC|悬疑|ADV|AVG|战棋|SRPG|游戏|STEAM|NS",
  505952: "Galgame|Aquaplus|2025|PC|全年龄|ADV|游戏|喜剧|leaf|NS|アクアプラス",
  515211: "PC|ARPG|银河恶魔城|PS5|ACT|PS4|单机游戏|游戏|XboxOne|Platform",
  527267: "PC|悬疑|游戏|ADV",
  531861: "设定集",
  549199: "画集"
};
