// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.08.22.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  24410: "小说|虚渊玄|轻小说|黑帮|小说系列|广江礼威",
  26405: "片岡とも|Galgame|ねこねこソフト|猫猫社|感动|妹|治愈|PC|妹ゲー|GAL|冬",
  80746: "少女漫画|漫画|少女|ぢゅん子|乙女向后宫|恋爱|講談社|搞笑|少女マンガ|校园|別冊フレンド",
  181993: "漫画系列|已完结",
  191037: "少女漫画|漫画系列|已完结|全11卷",
  203782: "轻小说|群像剧|犯罪|小说系列|木崎ちあき|群像|天闻角川引进|角川|KADOKAWA|都市|轻小说总卷",
  204748: "",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  241547: "漫画|漆原友紀|奇幻|治愈|2018|生活漫画|講談社|短篇|日本漫画|已完结",
  244959: "SRPG|同人|RPG|游戏性|アドレナ戦記|Galgame|战斗|freegame|约50或100h|魂like",
  271065: "中国",
  274307: "漫画|异世界|恋爱|穿越|轻改|轻小说改|漫画系列|青乃下|2018|狗粮|奇幻",
  286110: "ACT|海贼无双|PS4|PC|海贼王|2020|无双|万代南梦宫|白金达成|繁体中文版|Galgame",
  289304: "耽美|BL漫画|BLコミック|カキネ",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|已完结|漫画系列",
  294766: "NTR|漫画|柚木N|卖肉|R18|漫画系列|寝取られ|限制|成年コミック|一般向|2019",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|漫画系列|女装",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|日本|糟糕|原创",
  326724: "漫画|恋爱|校园|喜剧|搞笑|久世蘭|原创|杀必死|逆推|2021|講談社",
  328376: "漫画|校园|エロ|卖肉|福利|搞笑|色情|糟糕|ムラタコウジ|漫画系列|コミックヘヴン",
  329858: "漫画|甜米らくれ|露出|卖肉|色气|恋爱|2021|摄影|好看的|漫画系列|ヤンマガWeb",
  334753: "Galgame|韩国|全年龄|短篇|STEAM|电影视觉小说|MidnightWorks|PC|时空跳跃|2021|科幻",
  349339: "恋爱|漫画|人妻|巨乳|搞笑|卖肉|杀必死|ねこ末端|已完结|漫画系列|日本",
  395984: "异世界|漫画|正太|种田流|奇幻|漫画系列|青色まろ|赤池宗|轻小说改|2021|小说改",
  403378: "漫画|中国|魔幻|国漫|国创",
  421419: "漫画|后宫|恋爱|一般向|青年漫|搞笑|福利|泥石流|女拳",
  429425: "小说",
  457605: "漫画|治愈|职场",
  465813: "",
  499874: "小高和刚|打越钢太郎|PC|悬疑|AVG|ADV|SRPG|战棋|SLG|2025|游戏",
  502328: "漫画|后宫|卖肉|校园|搞笑|日本|奇幻|已完结|修女|系列|原创",
  513795: "漫画|丧尸|卖肉|日本|后宫|2024|系列|猎奇|原创|连载中|搞笑",
  538910: "日本|漫画|BL|原创|已完结|系列"
};
