// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.13.36
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  32290: "漫画|樋口朝|棒球|月刊アフタヌーン|大振|青春|体育|热血|运动竞技|2003|ひぐちアサ",
  40643: "漫画|許斐剛|运动|ジャンプSQ.|集英社|少年|2009|2009-04|体育漫画|杀人网球|漫画系列",
  46664: "漫画|甘詰留太|工口|SM|恋愛|奈奈与薫的SM日记|BDSM|已完结|恋爱|系列|2008",
  66438: "緒川千世|BL|漫画|BL漫画|BLコミック|耽美|大洋図書|日本|【BL漫画】|ばかカップル|BL大洋図書",
  89062: "漫画|热血|阴阳师|助野嘉昭|战斗|恋爱|少年漫画|奇幻|搞笑|ジャンプSQ|2013",
  128839: "漫画|棒球|満田拓也|2015|週刊少年サンデー|系列|体育|热血|竞技|漫画系列",
  129632: "漫画|怪谈|奇幻|一般向|忧郁的物怪庵|漫画系列|★マンガ|轻腐|双男主|☆主条目|期待度1",
  180060: "漫画|搞笑|公主|奇幻|熊之股鍵次|魔王|小学馆|2016|欢乐向|在魔王城说晚安|欢乐",
  184894: "漫画|异世界|生存|奈央晃徳|山川直輝|奇幻|2016|穿越|讲谈社|战斗|生存游戏",
  187083: "alcot|Galgame|艹妈|萝莉|现在就想推亲娘|くすはらゆい|五行なずな|遠野そよぎ|PC|汉化|2016年10月",
  207883: "漫画|恋爱|校园|狗粮|日常|搞笑|水あさと|萌|集英社|暖心|2017",
  219305: "BLコミック|神田猫|校园|竹書房|BL|女装|漫畫|尖端|BL漫画|神田貓|幼驯染",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|转生|异世界|R18|KADOKAWA",
  242093: "BLコミック|アッサ|BL漫画|BL|竹书房|竹書房",
  246317: "BL|BL漫画|BLコミック|フジマコ|BL2017|2017",
  259667: "漫画|悬疑|ソウマトウ|萝莉|集英社|剧情|治愈|黑暗|百合|2018|少女",
  262151: "漫画|真岛浩|热血|上田敦夫|讲谈社|漫画系列|妖精尾巴|系列|连载中|日本|連載中",
  264797: "腐|BLコミック",
  266498: "漫画|足球|講談社|金城宗幸|2018|ノ村優介|运动|週刊少年マガジン|体育漫画|中二|连载中",
  268279: "藤本タツキ|漫画|战斗|邪道|热血|周刊少年JUMP|集英社|自由人|藤本树|少年JUMP|2018",
  271719: "BLコミック",
  282109: "BL",
  292572: "漫画|眉月じゅん|恋爱|科幻|集英社|2019|少女漫画|週刊ヤングジャンプ|日本|青年漫|連載中",
  293358: "BLコミック|ゆくえ萌葱|BL|BL漫画|腐|海王社|耽美|漫画|GUSH|2019|律师",
  294762: "BL|BL漫画|森川智之|ドラマ|小野友树",
  294766: "NTR|漫画|柚木N|卖肉|R18|漫画系列|寝取られ|限制|成年コミック|一般向|2019",
  304390: "漫画|漫画系列|マンガ|已完结|系列|原创|日本|一般向|エロ|連載中|全5卷",
  311106: "腐|漫画|BL|BLコミック",
  314332: "BLコミック|BL|BL漫画|腐|卐",
  324865: "漫画|人妻|卖肉|2021|节操|漫画系列|エロ|一般向|假面骑士W",
  327316: "漫画|西尾维新|絵本奈央|小说改|奇幻|绘本奈央|西尾維新|漫画系列|2021|輕改|日漫",
  336442: "",
  354775: "限制",
  379566: "漫画|搞笑|四格|校园|日常|伪娘|恋爱|节操|2022|喜剧|むちまろ",
  402972: "百合|漫画|なうち|校园|恋爱|GL|KADOKAWA|漫画系列",
  416278: "漫画|BL|BL漫画|内田つち",
  422014: "轻小说|榛名丼|恋爱|奇幻|校园|青春|小说|2023|迷惘|复制人|日本",
  445721: "あざらしそふと|PC|FD|纯爱|Galgame|游戏|GAL|ADV|2017-12|生肉",
  449427: "漫画|战斗|搞笑|怪兽|小学馆|ヨシアキ|2023|日本|变身|原创|连载中",
  459368: "Galgame|whirlpool|明羽杏子|夏和小|秋野花|废萌|くすはらゆい|水鏡まみず|近江谷宥|2024|修女",
  464609: "",
  467935: "轻小说|萬屋久兵衛|桃子|絵葉ましろ",
  471368: "恋爱|漫画|成人|短篇",
  500429: "百合|漫画|搞笑|轻百合",
  501478: "",
  506788: "Galgame|AVG|Type-Moon|FD|PC|NS|Fate|游戏|Switch|2025+|2024",
  527456: "",
  536972: "国产|PC|Galgame|STEAM|游戏|AVG|2025|AI插图|VN|视觉小说|冒险",
  558742: "小高和刚|中泽工|PC|2025|悬疑|AVG|ADV|北山猛邦|NS|游戏|推理"
};
