// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.10.43
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  32818: "漫画|浅野一二〇|音乐|青春|浅野いにお|浅野一二|2005|短篇|青春漫画|小学館|现实",
  103535: "漫画|官方同人|命运石之门|成家慎一郎|牧濑红莉栖|5pb|漫画系列|已完结|全4卷|2012|社团",
  111234: "轻小说",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  121365: "漫画|搞笑|脑洞|吐槽|春野友矢|日本|异世界|原创|已完结",
  132823: "轻小说|衣笠彰梧|校园|欢迎来到实力至上主义的教室|MF文庫J|智斗|トモセシュンサク|斗智|2015|男主演帝|小说系列",
  154936: "小说|轻小说",
  155587: "恋爱|漫画|搞笑|少女漫画|脑洞|工口|2015|肉|漫画系列|カワハラ恋|講談社",
  185741: "漫画|龙珠|日本|鸟山明|連載中|拯救世界|特兰克斯|2015|战斗|とよたろう|黑白漫",
  187715: "漫画|少女|漫画系列|少女漫|少女漫画|推荐恋爱|女性向|遠山えま|系列|日漫",
  207478: "漫画|战斗|妖怪|藍本松|热血|2016|集英社|少年漫画|ジャンプスクエア|ジャンプSQ.|少年漫",
  212037: "漫画|小林大樹|战斗|残酷|2017|异世界|奇幻|漫画系列|月刊ガンガンJOKER|连载中",
  218561: "漫画|轻改|异世界|冒险|小说改|2017|KADOKAWA|魔法|轻小说改|连载中|漫画系列",
  218701: "漫画|异世界|轻小说改|轻改|小说改|战斗|日本|日常|搞笑|穿越|漫画系列",
  221759: "漫画|特摄|佐藤まさき|2017|三条陸|小学館|假面骑士|连载中|少年漫画",
  221946: "漫画|奇幻|人外|战斗|异世界|別冊少年マガジン|萌|一般向|連載中|2017|童话",
  236546: "漫画|轻改|2017|异世界|小说改|穿越|奇幻|管理国家|政治|传送|漫画系列",
  240256: "恋爱|漫画|校园|桜井のりお|狗粮|秋田書店|2018|甜|无糖狗粮|日常|连载中",
  247383: "成年コミック|宮原歩|2017|漫画|R18|竹書房|纯爱|未标签|2017年|日本漫画|漫画シリーズ",
  255324: "搞笑|漫画系列|漫画|轻小说|异世界|轻小说改|小说改|B漫|日本",
  260215: "漫画|异世界|小说改|后宫|穿越|2018|轻改|力蔵|奇幻|漫画系列|战斗",
  267399: "漫画|搞笑|冒险|末世|丧尸|高田康太郎|2018|僵尸|麻生羽吕|麻生羽呂|小学館",
  272961: "漫画|恋爱|竞技|珈琲|热血|运动|街舞|舞蹈|2019|日本",
  273878: "异世界|小说改|轻改|恋爱|一迅社|漫画系列|魔法|蒼崎律",
  299168: "轻小说|小说系列|WEB",
  303246: "小说改|恋爱|少女漫|少女|漫画|日本|奇幻|系列|连载中|漫画系列|日漫",
  304270: "漫画|小说改|搞笑|异世界|舞铲阶级|浪费作画|漫画系列|日本|系列|节操|已完结",
  308999: "漫画|小说改|奇幻|战斗|异世界|やもりちゃん|轻小说改|魔法，异世界|起点水平|B漫|2020",
  322229: "异世界|漫画|小说改|日常|漫画系列|B漫",
  326285: "漫画|战斗|講談社|2021|漫画系列|铃木央|奇幻|日漫|系列|少年漫画|原创",
  331609: "小说|轻小说|恋爱|校园|绝症",
  337906: "轻小说|中村颯希|小说系列|一迅社|奇幻|中华风|ゆき哉",
  344667: "小说",
  357823: "草間さかえ|BL漫画|BLコミック|侦探|BL|2022",
  372294: "轻小说|异世界|百合|战斗|女主|小说系列|狂气|轻百|轻百合|女性向|漫画",
  380653: "搞笑|漫画|魔法少女|三倉ゆめ|魔法大妈|2022|魔法少妇|颜艺|少年画報社|魔法阿姨|魔法大姐",
  388039: "漫画|恋爱|校园|小说改|八神鏡|倒贴|轻小说改|2022|きぐるみ|コミックライド|轻改",
  389637: "轻小说|来栖夏芽|异世界",
  393603: "轻小说|日之浦拓|追放系|2022|对应漫画|GreeN|なろう系|旅游|奇幻|HJ文庫|异世界",
  394482: "",
  401778: "百合|漫画|花咲まにお|コミック百合姫|2022|一迅社|恋爱|工口|地雷系|漫画系列|双恋无",
  411978: "轻小说",
  433428: "轻小说|萝莉|日本|小说系列|系列|小说|web小说|纸质书",
  451195: "轻小说|底花",
  456344: "漫画|弐瓶勉|冒险|奇幻|科幻|連載中|2023|講談社|大世界观|マンガ|龙之塔",
  467520: "轻小说|暁社夕帆|恋爱|小说|轻文学",
  475219: "轻小说|木の芽|2023|异世界|后宫|富士见|连载中|连载|真后宫|幼驯染",
  476442: "轻小说|萝莉|恋爱|西条陽|GAGAGA文库|西条阳|2023|小说|奇幻|小学馆|悬疑",
  495164: "漫画|成年コミック|后宫|调教|养成|本子|三飞|アルデヒド|大长篇|性好奇|R18",
  506840: "漫画|恋爱|校园|搞笑|2024|青春|原创|週刊少年サンデー|日本|少女|晴川シンタ",
  511444: "轻小说|坂石遊作|2023|小说系列|催泪|角川BOOKS|小说",
  513940: "Galgame|FrontWing|全年龄|浅生咏|松本文纪|前翼社|短篇|ゆさの|浅生詠|游戏|GAL",
  525894: "轻小说|六海刻羽",
  557554: "",
  590822: ""
};
