// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.15.72
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  29993: "漫画|幸村诚|历史|维京|架空历史|講談社|2005|北欧|战斗|幸村誠|热血",
  30211: "漫画|后宫|浜田よしかづ|卖肉|战斗|热血|怪怪守护神|格斗|肉|搞笑|鬼神",
  55911: "漫画|村田雄介|搞笑|燃|战斗|One|热血|一击男|集英社|一拳超人|少年JUMP",
  57532: "漫画|大暮维人|舞城王太郎|恋爱|绮丽|大暮維人|卖肉|非主流|伪科幻|深渊融接|集英社",
  89419: "漫画|大久保圭|文艺复兴|少女漫画|ARTE|励志|月刊コミックゼノン|绘画|一般向漫画|艺术|连载中",
  105074: "Navel|Galgame|伪娘|女装|西又葵|鈴平ひろ|月に寄りそう乙女の作法|GAL|2014|大小姐|PC",
  140092: "PSV|digimon|繁体中文版|RPG|数码宝贝|NS|数码宝贝世界|数码暴龙|2016|情怀|BNEI",
  163966: "轻小说|异世界|奇幻|北山結莉|战斗|穿越|黑衣剑士|龙傲天|HJ文庫|转生|小说系列",
  168675: "奇幻|漫画|少女|搞笑|Comic|青春|漫画系列|B漫",
  175459: "国漫|米二|漫画|玄幻|热血|道|国产|中国|2015|战斗|国产漫画",
  177997: "轻小说|异世界|香月美夜|穿越|女主视角|种田|奇幻|女性主角|商业|椎名優|2015",
  201980: "漫画|异世界|转生|丸山朝ヲ|奇幻|猫娘|2016|养女儿|轻小说改|棚架ユウ|萌",
  211736: "",
  212189: "漫画|足球|体育|小林有吾|竞技|运动|小学館|2015|青春|体育漫画|热血",
  213503: "漫画|异世界|轻改|小说改|漫画系列|COMTA|2016|后宫|轻小说改|战斗|樋辻臥命",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|少女漫画|日本漫画|山下知子|系列|日常|FEELYOUNG",
  234273: "少女漫画|漫画|恋爱|校园|森野萌|少女漫|狗粮|2017|少女|花野井君和相思病|漫画系列",
  234489: "异世界|漫画|轻改|轻小说改|2017|穿越|小说改|九我山レキ|转生|漫画系列|战斗",
  247392: "漫画|异世界|小说改|轻小说改|轻改|漫画系列|转生|连载中|蘭々|正太|系列",
  254437: "百合|漫画|战斗|寿命论|奇幻|あおのなち|コミック百合姫|一迅社|2018|日本|战争",
  270112: "漫画|恶役千金|恋爱|小说改|轻改|吉村旋|搞笑|柚原テイル|异世界|2018|恶役",
  279877: "漫画|搞笑|美食|奇幻|春原ロビンソン|集英社|ひらけい|喜剧|沙雕|2019|少年JUMP+",
  282324: "漫画|恋爱|轻改|小说改|KADOKAWA|草壁レイ|紙城境介|2019|日常|校园|轻小说改",
  284311: "小说改",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|原创|漫画系列",
  298144: "百合|漫画|江島絵理|热血|竞技|搞笑|2020|コミックフラッパー|格斗游戏|校园|漫画系列",
  301226: "漫画|搞笑|糸吉了一|漫画系列|2019|ニコニコ静画|父女|KADOKAWA|治愈|已完结",
  305282: "漫画|后宫|异世界|卖肉|轻小说改|轻改|R18|小说改|实用|限制|川田暁生",
  305730: "漫画|搞笑|丹念に発酵|异世界|漫画系列|コミックウォーカー|2019|奇幻|日漫|日本|系列",
  311891: "漫画|恋爱|短篇|校园|青春|JUMP|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  321869: "漫画|恋爱|轻改|忘年恋|東鉄神|搞笑|年上|2020|姐弟恋|漫画系列|小说改",
  325236: "漫画|搞笑|篠原健太|奇幻|集英社|2021|週刊少年ジャンプ|周刊少年JUMP|校园|超自然日常|日本",
  326686: "小说改|漫画|漫画系列|日本|异世界|已完结|转生|火葬场",
  335248: "轻小说|恋爱|校园|狗粮|大小姐|未完结小说|小说系列|2021年|小说|校園|桃文",
  336828: "漫画|武田綾乃|むっしゅ|校园|百合|2021|青春|集英社|系列|原创|日本",
  338969: "百合|漫画|校园|听障|恋爱|くずしろ|2021|细腻|コミック百合姫|37|画风",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|小说系列|KADOKAWA",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  340469: "漫画|搞笑|小说改|江戸屋ぽち|漫画系列|轻改|コミックファイア|校园|2021|江ノ島アビス",
  349274: "漫画|小说改|异世界|穿越|奇幻|轻小说改|プレジ和尚|漫画系列|ぶんころり|轻改|日常",
  349842: "小说改|漫画系列|漫画|日本|异世界|奇幻|系列|连载中|2021.",
  355057: "小说改|奇幻|少女漫画|講談社|漫画|系列|少女漫|水辺チカ|2021|连载中|漫画系列",
  367794: "漫画|校园|平本彰|互换身体|平本アキラ|工口|纯爱|奇幻|系列|套路|2022",
  372605: "轻小说|小说系列|奇幻|连载中|日本|原创|小说|web文|2021|佐賀崎しげる|ショウセツ",
  375683: "漫画系列",
  376861: "漫画系列|异世界|一般偏无聊",
  387554: "轻小说|大森藤ノ|小说系列|2022|已完结|全3卷",
  389483: "漫画|异世界|厕纸|漫画系列|画工还行",
  409684: "漫画|音乐|摇滚|百合|校园|乐队|热血|日本|数摇|原创|连载中",
  420844: "轻小说",
  424889: "GAGAGA大赏",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  436747: "漫画|芳文社|日常|外传|2023|音乐|搞笑|Kirara|日本|日漫|くみちょう",
  498299: "轻小说|恋爱|塩本",
  506640: "漫画",
  525894: "轻小说|六海刻羽",
  552663: "Galgame|PC|游戏|ADV|NS"
};
