// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.12.59
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  142: "key|Galgame|麻枝准|Kanon|久弥直樹|催泪|樋上いたる|泣きゲー|PC|GAL|1999",
  232: "key|麻枝准|Galgame|air|鸟之诗|催泪|泣きゲー|观铃|神作|国歌|PC",
  26879: "漫画|渡辺航|体育|弱虫ペダル|热血|週刊少年チャンピオン|少年向|竞技|飚速宅男|运动",
  85896: "Galgame|PeasSoft|妹|PC|2014|双飞|生肉|ADV|实妹|小倉結衣|后宫",
  89419: "漫画|大久保圭|文艺复兴|少女漫画|ARTE|励志|月刊コミックゼノン|绘画|一般向漫画|艺术|连载中",
  119403: "漫画|百合|日常|クール教信者|搞笑|萌|妹抖龙|双叶社|双葉社|月刊アクション|漫画系列",
  148732: "漫画|芳文社|百合|日常|治愈|露营|あfろ|摇曳露营Δ|2015|轻百合|漫画系列",
  181003: "漫画|搞笑|五十嵐正邦|欢乐|KADOKAWA|悬疑|2016|2019|B漫|系列|汉化",
  220773: "漫画|异世界|轻改|凤傲天|百合|奇幻|女性主人公|轻小说改|穿越|冒险|小说改",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  231825: "漫画|异世界|百合|小说改|奇幻|穿越|凤傲天|せるげい|熊熊|くまなの|漫画系列",
  237704: "漫画|日常|钓鱼|小坂泰之|校园|搞笑|海洋|2017|科普|连载中|秋田書店",
  244481: "搞笑|已完结|魔法少女|漫画系列|漫画|马猴烧酒|ribon|奇幻|汉化",
  248883: "漫画|恋爱|校园|搞笑|肉番|丈|狗粮|喜剧|2018|快结婚|KADOKAWA",
  249876: "ADV|Galgame|Traumend|PC|同人|游戏|全年龄|音乐美|10h-|dw|资源难找",
  265155: "漫画|百合|轻小说改|旅行|奇幻|小说改|漫画系列|系列|B漫|白石定規|七緒一綺",
  270112: "漫画|恶役千金|恋爱|小说改|轻改|吉村旋|搞笑|柚原テイル|异世界|2018|恶役",
  304298: "漫画|恋爱|漫画系列|竹書房|2020|搞笑|职场|巨乳萝莉|斎創",
  307721: "漫画|轻改|异世界|小说改|日本|奇幻|系列|搞笑|穿越|轻小说改|漫画系列",
  308489: "国漫|三番熊|腾讯系|漫画|中國|国产|中国|条漫",
  311891: "漫画|恋爱|短篇|校园|青春|JUMP|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  312642: "漫画|正太|转生|异世界|龙傲天|轻改|后宫|战斗|漫画系列|2020|未完结漫画",
  319309: "漫画|安田佳澄|科幻|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|糟糕|GAL|限制",
  340770: "漫画|恋爱|大小姐|套路|小说改|日常|水島空彦|2021|校园|轻小说改|漫画系列",
  349339: "恋爱|漫画|人妻|巨乳|搞笑|卖肉|ねこ末端|杀必死|已完结|漫画系列|一般向",
  374355: "TL",
  375316: "漫画|恋爱|幼驯染|搞笑|校园|后宫|2022|日常|党争|講談社|三簾真也",
  389730: "中国|国漫|漫画",
  391665: "百合|国漫|恶役千金|漫画|刺猬猫阅读|恋爱|赤色|断S|条漫|中国|国产",
  392095: "漫画|恋爱|校园|小说改|纯爱|轻小说改|漫画系列|2022|轻改|网络连载|講談社",
  402044: "Galgame|全年龄|同人|PC|青春|AVG|友情|游戏|纯爱|ADV",
  439690: "漫画|卖肉|恋爱|校园|2023|系列|龍大和|工口|糟糕|纯爱|肉",
  447051: "中国|逆袭|重生|网文改|系统",
  451128: "漫画|中国",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|講談社|2023|日常|后宫|午夜心旋律",
  457692: "漫画|恋爱|校园|身份交换|搞笑|岸川瑞樹|前任文学|2024|奇幻|少年ジャンプ＋|日本",
  461443: "漫画|搞笑",
  475241: "轻小说",
  492268: "百合|漫画|校园|千種みのり|2023|KADOKAWA|角川",
  497214: "百合|Galgame|PC|游戏|AVG|GL|VN",
  513940: "Galgame|FrontWing|浅生咏|GAL|全年龄|松本文纪|前翼社|2025|游戏|ゆさの|待发售",
  529080: "AVG|PC|游戏|ADV|Switch|NS",
  553277: "画集|中国|国产|纸质书"
};
