// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2024.12.27.904
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1488: "minori|Galgame|七尾奈留|新海诚|ef|天门|御影|纯爱|ef_-_the_first_tale.|PC|鏡遊",
  4066: "leaf|丸户史明|Galgame|三角恋|WA2|PC|神作|郁系|脱宅神作|丸戸史明|GAL",
  19002: "新岛夕|Galgame|SAGAPLANETS|暖人心田|毕业作|初雪樱|治愈|纯爱|虐心|水月陵|fripside",
  46090: "ELF|蛭田昌人|Galgame|土天冥海|NTR|悬疑|PC|R18|暖人心田|灰暗系|GAL",
  47646: "板垣恵介|漫画|格斗|1991|周刊少年Champion|漫画系列|燃|战斗|已完结|刃牙",
  66451: "漫画|小说改|SF|太空歌剧|银河英雄传说|道原かつみ|徳間書店|田中芳树|经典|古早漫|银英",
  69358: "ED|日笠陽子|進撃の巨人|进击的巨人|2013|anime|single|动画|日笠阳子|根岸貴幸|动漫主题曲",
  118165: "搞笑|漫画|井上堅二|颜艺|吉岡公威|裸体|智障|潜水|講談社|恋爱|2014",
  137806: "漫画|あfろ|百合|同人|搞笑|脑洞|芳文社|已完结|日常|漫画系列|系列",
  165241: "同人|Galgame|2016|哲学|离开的人们|PC|K2Cee|电波|等等等|ウツクシキ|AVG",
  177863: "轻小说|駱駝|搞笑|電撃文庫|KADOKAWA|ブリキ|2016|漫画|小说|恋爱|轻小说改",
  182057: "百合|漫画|漫画系列",
  193081: "漫画|博|校园|少女|百合|治愈|2016|集英社|明日酱的水手服|我他妈舔爆！|买买买",
  195862: "漫画|搞笑|影崎由那|阿羅本景|2016|ホーム社|漫画系列",
  214685: "漫画|恋爱|甜|和武はざの|萌|狗粮|日常|講談社|2017|少女漫画|奇幻",
  236467: "マンガ",
  242942: "漫画",
  272951: "异世界|漫画|转生|轻改|小说改|战斗|皇ハマオ|开挂无敌|漫画系列|轻小说改|2019",
  286980: "轻小说|奇幻|一卷全|萝莉|误解向",
  287711: "轻小说|竹井10日|恋爱",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|格斗类",
  295217: "轻小说|河野裕|智斗|架見崎系列|科幻|幻想|小说|系列|神作|越島はぐ|小说系列",
  306284: "小说改|輕改|漫画系列|2020|轻改|大木戸いずみ|异世界|恶役千金|保志あかり|连载中",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|2020年|女装",
  315497: "轻小说|恋爱|小说|纯爱|年上",
  316280: "漫画|恋爱|漫画系列|三星めがね|色|白毛|萝莉|妹妹|卖肉|雪女",
  316809: "漫画|恋爱|美食|ハナツカシオリ|爱情|日常|講談社|2020|日漫|漫画系列|甜",
  327060: "轻小说|恋爱|青梅竹马|狗粮|纯爱|小说系列|桃子|小说|笨蛋情侣|未知后续|青梅",
  328458: "漫画|BL|奇幻|BL漫画|漫画系列|喜剧|BLコミック|腐|耽美|R18|2021",
  332250: "漫画|龍幸伸|战斗|怪谈|集英社|奇幻|JUMP+|搞笑|少年ジャンプ＋|龙幸伸|2021",
  347240: "漫画|龙傲天|战斗|异世界|奇幻|不要动脑！",
  354762: "轻小说|恋爱|狗粮|校园|柚本悠斗|小说系列|纯爱|日本",
  356198: "Galgame|同人|短篇|唯美|孤独|氛围作|全年龄|白毛|汉化|絹谷ゆたか|雰囲気がいい",
  360070: "漫画|恋爱|后宫|小说改|轻小说改|2021|日常|御宮ゆう|香澤陽平|前任|倒贴",
  372294: "轻小说|百合|异世界|战斗|小说系列|女主|轻小说改|漫画|春の日びより|web小说|轻百",
  375145: "漫画|BL|BL漫画|BLコミック|志木見ビビ",
  376200: "轻小说|恋爱|校园|小说|前任|轻书架|御宮ゆう|前女友|wenku8|哩哔",
  377765: "卖肉|漫画|伪限制|搞笑|あおむし|搾精研究所|单行本|系列|前篇|原创|日常",
  406361: "アンノウンX|Rhythm|PC|STG|金发教会|东方|音乐|東方Project|MUG|2024|Switch",
  406538: "龙|漫画系列|漫画|悬疑|奇幻|战斗|神话|异世界|女性主人公|致郁",
  417054: "轻小说|异世界|厕纸|流水账|あるくひと",
  425732: "轻小说|后宫|2022|WEB|ファンタジア文庫|异世界",
  430016: "漫画|后宫|兽耳|成年コミック|工口|限制",
  431400: "搞笑|漫画|纯爱|色气|18X|恋爱|压枪|松林佑|日常|OL|ero",
  433962: "",
  437765: "轻小说|KAZU",
  453125: "漫画|科幻|恋爱|猎奇|ハミタ|校园|悬疑|扭曲|奇幻|漫画系列|架空现实",
  460743: "Galgame|CRYSTALiA|白毛|2024|废萌|妹|萝莉|秋野花|2024-02|PC|纯(谈恋)爱",
  464648: "动态CG|Galgame|AVG|PC|游戏|STEAM|DynamicCG|2024|金发教会|银发教会|黄油",
  476445: "轻小说",
  480469: "2023|宮迫宗一郎",
  484353: "轻小说|小说系列|有象利路|2023",
  486415: "小说",
  498287: "紙城境介|小说|轻小说|日本|原创|纸城境介|纸质书",
  505113: "FAVORITE|FHD|剧情作|Galgame|HD|保住圭|游戏|PC|GAL|2024-11|BGM重置",
  511412: "FrontWing|Galgame|灰色系列|PC|合集|2024|战斗|重置版|AVG|R18|ADV",
  512180: "PC|大槍葦人|游戏|全年龄|ADV|汉化|Galgame|8",
  512789: "Galgame|全年龄|小说改|PC|Visual_Arts|ADV|2024|性转|游戏|VA|长谷川育美"
};
