// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.12.02.42
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  6784: "橘皆無|漫画系列|擦边球|少女|怀旧|转世|漫画|已完结",
  9344: "草間さかえ|BL|BL漫画|漫画|BLコミック|2010|リブレ|神作★|耽美|想入手|日本",
  63308: "克・亜樹",
  122776: "漫画|治癒|徳間書店|今井哲也|連載中|超能力|マンガ|漫画系列|短篇|@7.5",
  146872: "草間さかえ|BL|BL漫画|漫画|リブレ|2015|BLコミック|耽美|2012|Be×boy|シトロン",
  154700: "BLコミック|大洋図書|明治カナ子",
  155802: "BL|ZAKK|悬疑|耽美|茜新社|漫画系列|腐|BL漫画|已完结|漫画|3人",
  163847: "异世界|漫画|轻改|魔物娘|穿越|轻小说改|后宫|木野コトラ|漫画系列|搞笑|双女主",
  207711: "BL|彩景でりこ|BL漫画|祥伝社|BLコミック|R18|耽美|实体|onBLUE|漫画|BL2016",
  231030: "座裏屋蘭丸|BL|BL漫画|漫画|耽美|日本漫画|Canna|座里屋兰丸|R18|女性向|2019",
  241334: "漫画|搞笑|卖肉|エロ|糟糕|喜剧|脑洞|肉番|都市|R15|漫画系列",
  282923: "百合|漫画|酒|塀|2019|日本|秋田書店|原创|漫画系列|系列|连载中",
  288048: "漫画|异世界|穿越|复仇|冒险|轻改|鵜吉しょう|龙傲天|漫画系列|轻小说改|2019",
  302050: "麻生ミツ晃|BLコミック|BL|ABO|海王社|BL漫画|2020|警察|GUSH|コミック",
  340402: "BL|BL漫画|汀えいじ|秒で分かる|连载中|福利|日漫|漫画|腐|意犹未尽|2022",
  347066: "百合|漫画|コミック百合姫|きぃやん|恋爱|一迅社|2021|漫画系列|2022|短篇|已完结",
  353859: "漫画|魔法少女|战斗|奇幻|职场|2021|集英社|青木裕|少年ジャンプ＋|岩田雪花",
  378805: "百合|美食|漫画|搞笑|2019|梵辛|漫画系列|KADOKAWA|连载中|日本",
  388241: "百合|漫画|卖肉|微エロ|cosplay|漫画系列|已完结|系列|日本|原创",
  390237: "百合|漫画|偶像|棘尾どろしー|灵异|幽灵|校园|2022|连载|汉化|日漫",
  425417: "漫画|校园|病态|朝賀庵|已完结|系列|SM|有雷点|2023|一般向|マンガ",
  435044: "性转|漫画|变百|恋爱|TS|百合",
  470936: "漫画|伪娘|恋爱|校园|日常|2023|ウルトラジャンプ|搞笑|日漫|日本|しなぎれ",
  485817: "",
  490883: "鬼頭莫宏|雰囲気がいい"
};
