// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.08.18.73
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  24410: "小说|虚渊玄|轻小说|黑帮|小说系列|广江礼威",
  26405: "片岡とも|Galgame|ねこねこソフト|猫猫社|感动|妹|治愈|PC|妹ゲー|GAL|冬",
  64252: "漫画|战斗|生存游戏|FLIPFLOPs|科幻|超能力|生存|別冊少年チャンピオン|后宫|秋田書店|漫画系列",
  80746: "少女漫画|漫画|少女|ぢゅん子|乙女向后宫|恋爱|講談社|搞笑|少女マンガ|校园|別冊フレンド",
  181993: "漫画系列|已完结",
  189789: "中国|国漫",
  196774: "漫画|大今良時|奇幻|讲谈社|週刊少年マガジン|2016|連載中|少年漫画|周刊少年magazine|大今良时|講談社",
  203782: "轻小说|群像剧|犯罪|小说系列|木崎ちあき|群像|天闻角川引进|角川|KADOKAWA|都市|轻小说总卷",
  204748: "",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  218743: "漫画|芳文社|日常|あfろ|四格|百合|2017|轻百合|まんがタイムKRコミックス|2017年|Kirara",
  237704: "漫画|日常|小坂泰之|校园|搞笑|钓鱼|海洋|2017|连载中|画风|青春",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|芥見下|2018|JUMP|少年漫画|週刊少年ジャンプ",
  239442: "日漫|漫画|镰池和马|タウル深い作品|轻改|轻小说|后宫|小说|25|12月|23年",
  241547: "漫画|漆原友紀|奇幻|治愈|2018|生活漫画|講談社|短篇|日本漫画|已完结",
  241987: "井上雄彦|灌篮高手|集英社|少年JUMP|樱木花道",
  250037: "漫画|异世界|后宫|转生|开挂无敌|小说改|轻小说改|奇幻|轻改|厕纸|2018",
  269903: "百合|漫画|citrus+|百合姫コミックス|后日谈|一迅社|续作|サブロウタ|恋爱|コミック百合姫|发糖",
  271065: "中国",
  274307: "漫画|异世界|恋爱|穿越|轻改|轻小说改|漫画系列|青乃下|2018|狗粮|奇幻",
  279507: "轻小说|宇野朴人|魔法世界|奇幻|小说系列|2018|电撃文库|战斗|发刀|電撃文庫|校园",
  286110: "ACT|海贼无双|PS4|PC|海贼王|2020|无双|万代南梦宫|白金达成|繁体中文版|Galgame",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|已完结|漫画系列",
  291333: "Galgame|全年龄|TOKYOTOON|CG超赞|はと|PC|2020|百合|大空樹|STEAM|ADV",
  294766: "NTR|漫画|柚木N|卖肉|R18|漫画系列|寝取られ|限制|成年コミック|一般向|2019",
  300101: "漫画系列|已完结|全8卷",
  300112: "漫画系列|已完结|全12卷",
  310707: "百合|漫画|日常|田口囁一|治愈|搞笑|2020|喜剧|コミック百合姫|漫画系列|已完结",
  310983: "少女漫画|漫画|恋爱|校园|2020|やまもり三香|講談社|少女|デザート|连载中|系列",
  315394: "漫画|中国|奇幻|悬疑|实体|一般向漫画",
  317314: "漫画|百合|日常|兴趣类|日本|2019|渋谷圭一郎|科普|原创|连载中|連載中",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|日本|糟糕|原创",
  329858: "漫画|甜米らくれ|露出|卖肉|色气|恋爱|2021|摄影|好看的|漫画系列|ヤンマガWeb",
  334753: "Galgame|韩国|全年龄|短篇|STEAM|电影视觉小说|MidnightWorks|PC|时空跳跃|2021|科幻",
  336906: "恋爱|漫画|日常|namo|科普|职业|治愈|幼驯染|漫画系列|KADOKAWA|harta",
  373629: "漫画|金田陽介|2022|講談社|异世界|マガジンポケット|校园|奇幻|讲谈社|魔法|漫画系列",
  392295: "性转|异世界|轻小说改|2022|漫画系列|森みさき|转生|漫画|森下りんご|种田|男娘",
  397777: "漫画|一般向|漫画系列|魔木|日漫|灰刃ねむみ|软绵绵汉化|7.4|伪化",
  402044: "Galgame|全年龄|同人|PC|游戏|ADV|幼驯染|青春|夏|治愈",
  403551: "漫画|恋爱|ミトガワワタル|奇幻|日本|漫画系列|集英社|已完结|原创|搞笑|系列",
  419004: "七尾ナナキ|战斗|奇幻|漫画|冒险|搞笑|勇者|热血|友情|七尾七希|战友情",
  425931: "漫画|国漫|剧情|冒险|古风|中国",
  428285: "百合|漫画|2023|とみさー|师生|校园|秋田書店|师生恋|同人奇迹（嘘）|短篇",
  456679: "",
  463270: "",
  465813: "",
  466852: "恋爱|搞笑",
  470335: "漫画|台湾|原创|中国|天坑|连载中|男神A君|中国大陆|webtoon",
  485015: "",
  486061: "画集",
  490057: "百合|漫画|已完结|单行本|漫画系列|コミックス|非单行|まめ魚|全1巻",
  499874: "小高和刚|打越钢太郎|PC|悬疑|AVG|ADV|SRPG|战棋|SLG|2025|游戏",
  502328: "漫画|后宫|卖肉|校园|搞笑|日本|奇幻|已完结|修女|系列|原创",
  502404: "热血|国漫|爽漫",
  513795: "漫画|丧尸|卖肉|日本|后宫|2024|系列|猎奇|原创|连载中|搞笑",
  524576: "国产|Galgame|全年龄|视觉小说|电波|PC|meta|短篇|AVG|ADV|2024",
  537130: "Galgame|HOOKSOFT|FD|PC|游戏|2025|废萌|ADV|渡辺僚一|黑长直|阿部まれお",
  545083: "轻小说|葵せきな|恋爱|搞笑|小说|恋爱喜剧|青春|2025|小说系列|深崎暮人|葵关南"
};
