// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.09.24.52
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  26942: "轻小说|擦边球|已完结|泰迪熊恶魔|AKUMAで少女|恶魔少女|换身|女流小说家|很有意思的样子|交换灵魂|无厘头",
  31972: "漫画|安倍夜郎|美食|治愈|深夜食堂|人生百态|生活|单元剧|料理|小学館|日本",
  38925: "alcot|Galgame|桐谷华|燃，桐谷华，杏子御津，清水爱，远野そよぎ|中の人などいない！|GAL|欢乐|PC|萌|2012|汉化",
  41633: "轻小说|清水マリコ|一卷|田仓トヲル",
  73892: "轻小说|松山剛|一卷全|小说|科幻|雨雪冰三部曲|パセリ|2013|这本轻小说真厉害!|電撃文庫|单卷完",
  148464: "藤崎竜|集英社|漫画|小说改|田中芳樹|科幻|藤崎龙|連載中|系列|银河英雄传说|漫画系列",
  178988: "2016|同人|album|M3-37",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|日本漫画|少女漫画|山下知子|一般向漫画|FEELYOUNG|系列",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  225427: "漫画|駕籠真太郎|短篇集|猎奇|太田出版|1995|日本漫画|R18|艺术漫画|エロ|全一卷",
  228467: "漫画|卖肉|后宫|小说改|复仇|轻改|黑暗|转生|异世界|R18|KADOKAWA",
  231163: "漫画|异世界|轻改|奇幻|2017|进化|中曽根ハイジ|轻小说改|丘野優|漫画系列|小说改",
  237342: "百合|漫画|猎奇|奇幻|小说改|怪谈|冒险|异世界|2018|悬疑|月刊少年ガンガン",
  282735: "漫画|后宫|异世界|轻小说改|恋爱|工口|小島紗|R18|小说改|穿越|奇幻",
  287428: "漫画|春輝|卖肉|忍者|漫画系列|R18|系列|奇幻|青年漫画|擦边球|色情",
  287723: "漫画|恋爱|吸血鬼|奇幻|コトヤマ|2019|小学館|那徜徉在夜晚的歌声|漫画系列|已完结|恋爱漫画",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  300431: "漫画|峰浪りょう|恋爱|青春|阴间|病娇|胃药|2020|扭曲|青年漫|集英社",
  313766: "轻小说|小说",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|2020|未完结漫画",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|反乌托邦",
  323829: "漫画|游戏改|搞笑|まめおじたん|gal改|2020|连载中|无性器描写的H|日本|糟糕|原创",
  344647: "小说系列|已完结|全2卷",
  365699: "Galgame|伪娘|PC|女装|ensemble|生肉|2022-04|Go-1|2022|GAL",
  370565: "卖肉|漫画|后宫|恋爱|杀必死|漫画系列|小说改|待エロ|色|月刊ドラゴンエイジ|神月洸壱",
  372612: "漫画|奇幻|战斗|轻小说改|异世界|大叔|乍藤和樹|师徒|漫画系列|小说改|连载中",
  391432: "漫画|后宫|卖肉|奇幻|小说改|异世界|一般向|擦边球|校园|日常|搞笑",
  407358: "漫画|西尾維新|岩崎優次|推理漫画|2022|集英社|少年漫画|密码|推理|日本漫画|連載中",
  409402: "百合|漫画|ウオズミアミ|2022|恋爱|漫画ウオズミアミ|NTR|人妻|日本漫画|连载中|系列",
  431560: "漫画|悬疑|服部未定|邪教|惊悚|恐怖|黑暗|已完结|2021|週刊漫画ゴラク|奇幻",
  433251: "泛Vocaloid",
  433726: "漫画|一般向|小说改",
  457574: "泛Vocaloid",
  457575: "泛Vocaloid",
  469081: "",
  483044: "",
  488880: "百合|漫画|2024|やとさきはる|甜|搞笑|講談社|恋爱|喜剧|コミックDAYS|美食",
  490753: "百合|漫画|异世界|2024|玉崎たま|GL|コミック百合姫|原创|連載中|奇幻|マンガ",
  496527: "STEAM|AVG|PC|解谜|游戏|全年龄|云过|冒险",
  509947: "falcom|JRPG|RPG|2025|轨迹系列|PC|Switch|NS|PS5|游戏|待发售",
  511869: "背筋|小说|恐怖|2024",
  524576: "国产|Galgame|全年龄|视觉小说|电波|PC|meta|短篇|AVG|ADV|2024",
  567647: "奇幻|漫画|吸血鬼|恋爱|少年|连载中|日本|原创|コトヤマ|周刊少年"
};
