// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.22.93
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1095: "alicesoft|RPG|Galgame|游戏性|燃え|2008|世界観がいい|战斗|GAL|エロい|汉化",
  12592: "和泉万夜|猎奇|Galgame|BLACKCYC|触手|虫使|战斗|PC|2006|感动|拔作",
  38971: "whirlpool|Galgame|PC|妹|2012-09|义妹|PSV|ADV|资源|游戏|AI翻译",
  62620: "魔法少女小圆|轻小说|百合|一肇|小说|Nitro+|系列|动画改|卖萌人设|小说系列|已完结",
  73356: "漫画|官方同人|已完结|全3卷|打工战士|科幻|时空穿越|漫画系列|穿越|游戏改|¬",
  102468: "轻小说|鸭志田一|青春|校园|青春野狼系列|恋爱|电击文库|鴨志田一|溝口ケージ|2014|学姐",
  112155: "ACT|PSV|PC|PS4|无双|BNGI|海賊無双3|繁体中文版|2015|PS3|Koeitecmo",
  129234: "Hulotte|Galgame|FD|妹|实妹|PC|游戏|ADV|废萌|妹妹|2014",
  184894: "漫画|异世界|生存|奈央晃徳|奇幻|山川直輝|2016|战斗|穿越|讲谈社|生存游戏",
  207479: "漫画|美食|治愈|小山愛子|小学館|生活|2016|日常|2016年|連載中",
  212271: "轻小说|百合|旅行|奇幻|公路|白石定規|魔女|GA文庫|轻百合|治愈|小说系列",
  214007: "漫画|异世界|搞笑|反套路|穿越|安村洋平|鬼畜男主|社畜|剧情脱线|2016|欢乐向",
  233030: "Galgame|FAVORITE|漆原雪人|F社|幼女|司田カズヒロ|魔法少女|马猴烧酒|PC|忍|2019",
  240413: "狗神煌|轻小说|扶她自|SCA自|SCA-自|扮猪吃虎|影帝|狗姐|无能力者|蒙读者|插画赞",
  254437: "百合|漫画|战斗|寿命论|奇幻|あおのなち|コミック百合姫|一迅社|日本|GL|2018",
  286110: "ACT|PS4|海贼无双|PC|海贼王|2020|Switch|万代南梦宫|XboxOne|无双|白金达成",
  291900: "少女漫画|恋爱|リカチ|漫画|2019|战斗|魔法|宫廷|日本漫画|漫画系列|致郁",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|穿越|2019|池澤真|津留崎優|奇幻",
  296610: "轻小说|恋爱|小说系列|日本|ガガガ文庫|猿渡かざみ|厕纸|桃文|1～4分",
  304298: "漫画|恋爱|漫画系列|竹書房|2020|搞笑|职场|巨乳萝莉|斎創",
  306812: "百合|漫画|恋爱|后宫|校园|轻小说改|2020|日常|みかみてれん|小说改|むっしゅ",
  312057: "漫画|小说改|转生|轻改|纯爱|柚アンコ|奇幻|少女漫|异世界|漫画系列|轻小说改",
  316122: "漫画|推理|天野明|悬疑|侦探|2020|集英社|悬疑漫画|推理漫画|少年漫|已完结",
  316590: "FPS|PC|废土|R18|3D|STEAM|第一人称角色扮演|黄油|ACT|Galgame|恋爱养成",
  317485: "画集|IM@S|卡图|设定集|已购",
  324937: "画集|设定集|已购|IM@S|卡图",
  348908: "漫画|后宫|卖肉|倒贴|エロ|恋爱|杀必死|奇幻|擦边球|R15|姐妹丼",
  349243: "Galgame|みなとそふと|FD|ADV|PC|纯爱|wagi|2021|年上|RPG|2021-09",
  360163: "轻小说|恋爱|纯爱|狗粮|校园|小说系列|2021|桃子文|日本|辣妹|桃文",
  376640: "PS5|PC|游戏|独立游戏|RPG|未入库|白金|XSX|PS4|一般向|海贼王",
  377761: "漫画|校园|恋爱|轻小说改|雨森たきび|小说改|败犬|いたち|搞笑|小学館|日本",
  398979: "漫画|卖肉|异世界|战斗|日漫|限制|后宫|色|擦边|2022|奇幻",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|杀手|连载中|原创",
  409788: "画集|设定集",
  431033: "漫画|田村隆平|外星人|科幻|2023|小学馆|战斗|奇幻|原创|连载中|月刊サンデーGX",
  441730: "Galgame|エウシュリー|RPG|Eushully|异世界|PC|GAL|游戏性|黄油|STRIKERS|ADV",
  466861: "Galgame|mignon|伪娘|女装|2024|オルトロス|PC|R18|ADV|拔作|游戏",
  469840: "恋爱|漫画|搞笑|青春|纯爱|日常|电车上|吐槽|2024|吃瓜群众|増田英二",
  490908: "轻小说|螃蟹光线|桃文|岩柄イズカ|白毛|2024|恋爱|小说系列|奇幻|吸血鬼",
  520346: "ACT|PC|Platform|NS|小原好美|游戏|STEAM|2025|ADV",
  531925: "轻小说|生姜寧也"
};
