// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.26.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3177: "Galgame|方糖社|Lump_of_Sugar|萌木原|真白|萌え|废萌|PC|GAL|汉化|2008年7月",
  19002: "新岛夕|Galgame|SAGAPLANETS|暖人心田|毕业作|初雪樱|治愈|纯爱|虐心|水月陵|fripside",
  20629: "轻小说|海冬レイジ|松竜|复数卷",
  25975: "戯画|丸户史明|丸戸史明|Galgame|2002|老物|剧情萌作|丸户大爷|18+|游戏|PC",
  35410: "轻小说|海冬レイジ|复数卷|海冬|松竜|レイジ|小说系列",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|2016|黑丝",
  229111: "搞笑|漫画|尖端|小说改|完结|已完结|素晴",
  240662: "漫画|职场|恋爱|狗粮|しろまんた|一迅社|2018|网络连载|萌|连载中|体型差",
  248630: "推理|今村昌弘|小说|推理小说|丧尸|悬疑|轻小说|2017|奇幻|日本|恋爱",
  266197: "荒木飛呂彦|漫画|2013|短篇|悬疑|集英社|荒木飞吕彦|jojo|短篇集|超能力|日本漫画",
  270385: "异世界|转生|漫画系列|2018|恶役千金|搞笑|LaLa|恶役|冬夏アキハル|求求快更",
  282554: "漫画",
  284854: "漫画|异世界|轻小说改|漫画系列|小说改|日常",
  288048: "漫画|异世界|穿越|冒险|复仇|轻改|鵜吉しょう|龙傲天|漫画系列|2019|轻小说改",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  296457: "漫画|性转|异世界|搞笑|恋爱|冒险|2019|穿越|池澤真|津留崎優|奇幻",
  296466: "漫画|后宫|搞笑|恋爱|校园|集英社|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  297179: "漫画|碧蓝航线|漫画系列",
  297288: "洛天依|许嵩",
  299943: "恋爱|芳文社|漫画系列|漫画|无聊",
  303323: "漫画|日常|百合|成家慎一郎|表情包|萌|漫画系列|KADOKAWA|2020|搞笑|系列",
  307336: "perfume|日语",
  320214: "漫画|异世界|轻改|2020|战斗|小说改|网游|策略|穿越|奇幻|漫画系列",
  322229: "异世界|漫画|小说改|日常|漫画系列|B漫",
  323040: "漫画|タヤマ碧|偶像|KPOP|2020|韩团|日本文化趋势观察|日本|新潮社|系列|原创",
  326803: "轻小说|中国",
  330139: "小说改|漫画|双穿门|轻小说改|倒卖|简单模式|奇幻|兽耳|漫画系列|异世界|弱智",
  330850: "漫画|奇幻|恋爱|一七八ハチ|冒险|亚人|纯爱|御姐x正太|KADOKAWA|色|2021",
  335281: "小说",
  340000: "百合|漫画|日常|欢乐|杀手|猎奇|ハンバーガー|漫画系列|死亡|反乌托邦|黑色幽默",
  347848: "漫画|轻小说改|恋爱|2021|一般向|小说改|カメーリエ|日本|日常|校园|补标",
  351510: "漫画|国漫|中国|奇幻|科幻|日常|战斗|中国漫画|灵笼|罕见|2021",
  355164: "小说改|漫画系列|恋爱|异世界",
  357239: "",
  364521: "小说",
  414879: "漫画|水無月すう|搞笑|卖肉|2022|天降之物|已完结|KADOKAWA|月刊少年エース|一般向|日本",
  424382: "漫画",
  429256: "轻小说",
  433726: "漫画|一般向|小说改",
  436144: "轻小说|詠井晴佳|小说|青春|2023|轻小说分卷|ガガガ文庫|萩森じあ",
  438329: "漫画|小说改|恋爱",
  449330: "漫画|轻百合|2024|搞笑|音乐|动画改|动漫改|講談社|マガジンポケット",
  451231: "漫画|校园|JK|連載中|一般向|20话以内|色|短篇|2023|全一巻|恋爱",
  458514: "百合|漫画|日常|魔女|治愈|花|奇幻|2023|连载中|浜弓場双",
  477849: "漫画|战斗|漫画系列",
  484347: "轻小说|伏見つかさ|TS|搞笑|性转|校园|小说|2024|兄妹|2024年|扶她",
  493495: "轻小说|百合|漫画",
  533337: "小说|推理|高野結史",
  537847: ""
};
