// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.31.87
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  5833: "漫画|恋爱|灵异|校园|めいびい|黑长直|校园怪谈|悬疑|黄昏少女X记忆丧失|学姐|已完结",
  40064: "安达充|漫画|棒球|月刊少年SUNDAY|2012|运动|校园|恋爱|あだち充|小学馆|日本漫画",
  40643: "漫画|許斐剛|运动|集英社|2009|ジャンプSQ.|少年|2009-04|系列|日漫|体育漫画",
  284318: "",
  309003: "漫画|奇幻|异世界|战斗|轻小说改|小说改|女儿|2020|日常|轻改|亲情",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|党争|2021|集英社|日本",
  339887: "漫画|赌博|恐怖|炭酸だいすき|投资|2021|赌狗|炒外汇|惊悚|KADOKAWA|日本",
  390325: "漫画|2022年|恋爱|兄妹|小说改|校园|漫画系列|KADOKAWA|义妹|轻小说改|2022",
  425199: "漫画|恋爱|搞笑|日常|猫娘|已完结|日本|ヨルモ|完结|原创|系列",
  452349: "漫画|战斗|周刊少年JUMP|热血|日本|集英社|连载中|奇幻|2023|原创|少年",
  456375: "漫画|战斗|科幻|外传|轻改|魔禁|百合|轻小说改|日本|strelka|镰池和马",
  561901: "日本",
  599997: "恋爱|漫画|青春|日本|豊林サカネ|青梅竹马|校园|少年|连载中|2025|小学館",
  614873: "连载中|年下|奇幻|漫画|日本|六つ花えいこ|轻小说改|系列|小说改|养成系|幼女化"
};
