// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.05.21.85
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  7400: "田中ロミオ|Galgame|希|民俗|雰囲気がいい|Meteor|古风|文艺希|雑学|館もの|2004",
  19002: "新岛夕|Galgame|SAGAPLANETS|暖人心田|毕业作|初雪樱|治愈|纯爱|虐心|水月陵|fripside",
  28863: "轻小说|近衛乙嗣|系列|ツカサ|复数卷|日本|小说",
  57532: "漫画|大暮维人|舞城王太郎|恋爱|绮丽|大暮維人|卖肉|非主流|伪科幻|深渊融接|集英社",
  62879: "漫画|板垣惠介|格斗|热血|板垣恵介|2006|搞笑|周刊少年Champion|格斗漫画|战斗|已完结",
  73738: "Galgame|すたじお緑茶|GAL|废萌|绿茶社|石原舞|PC|ADV|妹|2014|るちえ",
  115389: "漫画|山本崇一朗|日常|妹控|治愈|已完结|小学馆|萝莉|札月家的杏子妹妹|轻松|漫画系列",
  135693: "少女|漫画|已完结|漫画系列|日高万里",
  201980: "漫画|异世界|转生|丸山朝ヲ|奇幻|猫娘|2016|养女儿|轻小说改|棚架ユウ|萌",
  207478: "漫画|战斗|妖怪|藍本松|2016|热血|集英社|少年漫画|ジャンプスクエア|ジャンプSQ.|少年漫",
  210505: "漫画|搞笑|校园|少年漫|西修|周刊少年Champion|週刊少年チャンピオン|2017|日常|热血|日本",
  215285: "漫画|异世界|轻改|后宫|恋爱|2016|战斗|RoGa|白米良|小说改",
  216582: "漫画|ヤマシタトモコ|生活|2017|祥伝社|少女漫画|日本漫画|山下知子|系列|日常|FEELYOUNG",
  229111: "搞笑|漫画|尖端|小说改|完结|已完结|素晴",
  234273: "少女漫画|漫画|恋爱|校园|森野萌|少女漫|狗粮|2017|少女|花野井君和相思病|漫画系列",
  241523: "漫画|搞笑|奇幻|轻小说改|暁なつめ|战斗|后宫|漫画系列|2018|系列|末世",
  244401: "小说改|漫画|异世界|基|战斗|狗血|轻小说改|魔物娘|已完结",
  247392: "漫画|异世界|小说改|轻小说改|轻改|漫画系列|转生|连载中|蘭々|正太|系列",
  266197: "荒木飛呂彦|漫画|2013|短篇|悬疑|集英社|荒木飞吕彦|jojo|短篇集|超能力|日本漫画",
  282554: "漫画",
  284311: "小说改",
  284854: "漫画|异世界|轻小说改|漫画系列|小说改|日常",
  294934: "FTG|格斗|罪恶装备|PC|ARC|2021|STEAM|3渲2天花板|PS4|GG|NS",
  296466: "漫画|后宫|搞笑|恋爱|校园|集英社|沙雕|野澤ゆき子|2019|中村力斗|画风好",
  297288: "洛天依|许嵩",
  298192: "漫画|东方|奇幻|2019|東方project|水炊き|zun|水本正|日常|月刊コンプエース|8分",
  303049: "漫画|异世界|转生|轻改|小说改|恶役|漫画系列|悪役|奇幻|B漫|のこみ",
  304449: "轻小说|恋爱|多线结局|家出|福山陽士|已完结小说|小说系列|2019|富士见|JK|同居",
  307336: "perfume|日语",
  308628: "百合|漫画|姐妹|漫画系列|糖度超标|日常|2020|双子|骨科|甜|一般向",
  320214: "漫画|异世界|轻改|2020|战斗|小说改|网游|策略|穿越|奇幻|漫画系列",
  320804: "轻小说|Type-Moon|奇幻|小说|三田诚|系列|2020|三田誠|Fate|原创|连载中",
  322229: "异世界|漫画|小说改|日常|漫画系列|B漫",
  326724: "漫画|恋爱|校园|喜剧|搞笑|久世蘭|原创|杀必死|逆推|2021|講談社",
  333285: "漫画|日常|真造圭伍|治愈|2021|小学館|一般向漫画|现实|日本|慢生活",
  333299: "漫画|热血|不良|战斗|2021|にいさとる|講談社|系列|校园|漫画系列|连载中",
  347848: "漫画|轻小说改|恋爱|2021|一般向|小说改|カメーリエ|日本|日常|校园|补标",
  349274: "漫画|小说改|异世界|穿越|奇幻|轻小说改|プレジ和尚|漫画系列|ぶんころり|轻改|日常",
  349842: "小说改|漫画系列|漫画|日本|异世界|奇幻|系列|连载中|2021.",
  355057: "小说改|奇幻|少女漫画|講談社|漫画|系列|少女漫|水辺チカ|2021|连载中|漫画系列",
  363864: "漫画|恋爱|小说改|幼驯染|轻小说改|日常|校园|六升六郎太|奇幻|漫画系列|一般向",
  390761: "漫画|推理|小说改|青崎有吾|校园|青春|悬疑|全2卷|已完结|漫画系列|短篇集",
  407624: "漫画|恋爱|倒贴|末世|馬かのこ|KADOKAWA|月刊ドラゴンエイジ|漫画系列|御姐|一般向|2022",
  424382: "漫画",
  429391: "漫画|百合|魔女|坂|雨霰けぬ",
  436144: "轻小说|詠井晴佳|小说|青春|2023|轻小说分卷|ガガガ文庫|萩森じあ",
  451231: "漫画|校园|JK|連載中|一般向|20话以内|色|短篇|2023|全一巻|恋爱",
  464543: "少女",
  533337: "小说|推理|高野結史"
};
