// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.09.01.38
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  25950: "漫画|皆川亮二|漫画系列|科幻|战斗|青年漫画|日本漫画|奇幻|小学館|週刊少年サンデー|1997",
  29137: "漫画|小山宙哉|励志|梦想|讲谈社|科幻|兄弟|講談社|感人|科幻漫画|2007",
  49974: "漫画|西森博之|校园|小学館|1988|少年漫画|完结|週刊少年サンデー|不良少年|漫画系列|犯罪",
  56289: "后宫|漫画|搞笑|藤代健|月刊少年ガンガン|蓝兰岛|后宫岛|日本|漫画系列|恋爱漫画|未完结漫画",
  58430: "画集",
  73092: "minori|Galgame|巨乳|女儿|12の月のイヴ|鏡遊|汉化|天门|PC|GAL|石原舞",
  98253: "漫画|后宫|恋爱|异世界|めいびい|卖肉|指环王|奇幻|已完结|穿越|2014",
  103745: "韩漫|漫画|爽文|webtoon|战斗|战斗升级|韩国|神作|2010|条漫|网刊",
  134488: "Galgame|ensemble|音符社|きみしま青|秋野花|大姐姐|绘豚满足|PC|妹|汉化|废萌",
  241897: "瀬戸口廉也|Galgame|OVERDRIVE|2019|等汉化|PC|GAL|ADV|瀬戸口复出|生肉|すめらぎ琥珀",
  254885: "漫画|治愈|黑道|萝莉|搞笑|养女儿|2018|日本|つきや|少女漫|连载中",
  284311: "小说改|日本彩漫|日漫",
  285272: "漫画|恋爱|伪娘|魔法|桜井亜都|女装|日本|已完结|青文出版社|幼驯染|2019",
  299584: "漫画|小说改|奇幻|轻小说改|异世界|天海雪乃|2019|装逼|2025-11|战斗|ヤングエースUP",
  300628: "冒险|奇幻|异世界|漫画|养女儿|小说改|2020|蕗野冬|轻改|转生|轻小说改",
  302561: "韩漫|漫画|爽文|战斗|龙傲天|热血|系统|韩国|奇幻|小说改|条漫",
  303323: "漫画|日常|百合|成家慎一郎|表情包|萌|2020|漫画系列|搞笑|KADOKAWA|系列",
  306926: "异世界|漫画|小说改|奇幻|小鈴危一|漫画系列|战斗|转生|正太|冒险|阴阳师",
  314942: "漫画|搞笑|日常|校园|はれやまはれぞう|日本|治愈|短篇|系列|可爱|漫画系列",
  338544: "漫画|搞笑|杀手|南勝久|2021|战斗|黑道|日常|犯罪|青年漫画|日本",
  355897: "日漫|小说改",
  376012: "韩漫|漫画|搞笑|韩国|异世界|颜艺|穿越|小说改|webtoon|男性向|韩国漫画",
  510278: "恋爱|漫画|校园|日常|挑逗|日本|恩田ゆじ|系列|连载中",
  513971: "PC|全年龄|紺野アスタ|羊宫妃那|游戏|ゆさの|Galgame|渡辺明夫|短篇|VN|26",
  516783: "校园|漫画|日常|小说改|一般向|日本|黑长直|同居|套路|打胶打出幻觉了|森あいり",
  539793: "恋爱|少女漫画|兄友|连载中|少女漫|系列|少女|漫画|年上男主|日漫BG|搞笑艺人",
  546720: "恋爱|漫画|韩国|职场|webtoon|原创|连载中|韩漫|우시목|이하안|UP"
};
