// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.02.18.36
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1095: "alicesoft|RPG|Galgame|游戏性|燃え|2008|世界観がいい|战斗|GAL|エロい|汉化",
  12592: "和泉万夜|猎奇|Galgame|BLACKCYC|触手|虫使|战斗|PC|2006|感动|拔作",
  38971: "whirlpool|Galgame|PC|妹|2012-09|义妹|PSV|ADV|资源|游戏|AI翻译",
  73356: "漫画|官方同人|已完结|全3卷|打工战士|科幻|时空穿越|漫画系列|穿越|游戏改|¬",
  102468: "轻小说|鸭志田一|青春|校园|青春野狼系列|恋爱|电击文库|鴨志田一|溝口ケージ|2014|学姐",
  113866: "画集|湯浅政明|公式书|画集公式书",
  119366: "漫画|春輝|成年コミック|R18|集英社|成人漫画|工口|后宫|多卷H漫|日本|マンガ",
  207479: "漫画|美食|治愈|小山愛子|小学館|生活|2016|日常|2016年|連載中",
  212271: "轻小说|百合|旅行|奇幻|公路|白石定規|魔女|GA文庫|轻百合|治愈|小说系列",
  214007: "漫画|异世界|搞笑|反套路|穿越|安村洋平|鬼畜男主|社畜|剧情脱线|2016|欢乐向",
  240413: "狗神煌|轻小说|扶她自|SCA自|SCA-自|扮猪吃虎|影帝|狗姐|无能力者|蒙读者|插画赞",
  278054: "漫画系列|少女与战车",
  292324: "漫画|恋爱|吉北ぽぷり|校园|纯爱|2019|KADOKAWA|师生|杀必死|逆推|腰斩",
  296610: "轻小说|恋爱|小说系列|日本|ガガガ文庫|猿渡かざみ|厕纸|桃文|1～4分",
  313964: "Galgame|みなとそふと|タカヒロ|CV阵容爆炸|夏和小|Minato|2021|伊藤静|GAL|浅川悠|PC",
  316122: "漫画|推理|天野明|悬疑|侦探|2020|集英社|悬疑漫画|推理漫画|少年漫|已完结",
  317485: "画集|IM@S|卡图|设定集|已购",
  348908: "漫画|后宫|卖肉|倒贴|エロ|恋爱|杀必死|奇幻|擦边球|R15|姐妹丼",
  349243: "Galgame|みなとそふと|FD|ADV|PC|纯爱|wagi|2021|年上|RPG|2021-09",
  350855: "轻小说|背德系|扭曲|恋爱|党争|白学|官能|西条陽|修罗场|小说|2021",
  360163: "轻小说|恋爱|纯爱|狗粮|校园|小说系列|2021|桃子文|日本|辣妹|桃文",
  375316: "漫画|恋爱|幼驯染|搞笑|后宫|校园|2022|党争|日常|三簾真也|講談社",
  377761: "漫画|校园|恋爱|轻小说改|雨森たきび|小说改|败犬|いたち|搞笑|小学館|日本",
  382508: "漫画|漫画系列|搞笑|2025-08",
  398979: "漫画|卖肉|异世界|战斗|日漫|限制|后宫|色|擦边|2022|奇幻",
  401544: "漫画|短篇集|日漫|其他",
  406468: "漫画|搞笑|恋爱|战斗|2022|集英社|千葉侑生|杀手|连载中|原创",
  411905: "百合|漫画|かめじろ|奇幻|2023|日本|轻百合|KADOKAWA",
  414664: "漫画|卖肉|2023|守月史貴|ヤンマガWeb|直播|成年コミック|2025-09|系列|日本|连载中",
  423212: "百合|漫画|校园|恋爱|日常|なうち|2023|甜作",
  431033: "漫画|田村隆平|外星人|科幻|2023|小学馆|战斗|奇幻|原创|连载中|月刊サンデーGX",
  435772: "原创|漫画|2023|漫画系列|连载中|2025-09|系列|日本",
  441435: "Roguelike|ACT|国产|横版|PC|STEAM|动作|独立游戏|2024|单机|游戏",
  445269: "轻小说|上村夏樹|社畜|恋爱|6-|糖精|狗糧|戀愛|純愛|同居",
  460819: "漫画|日常|青年|生活|意识流|上班族|2023|思考|鍋倉夫|小学馆|原创",
  469840: "恋爱|漫画|搞笑|青春|纯爱|日常|电车上|吐槽|2024|吃瓜群众|増田英二",
  470297: "key|Galgame|全年龄|松山剛|萝莉|短篇|PC|科幻|2025|游戏|ADV",
  490908: "轻小说|螃蟹光线|桃文|岩柄イズカ|白毛|2024|恋爱|小说系列|奇幻|吸血鬼",
  503019: "轻小说|奇幻|小说|异世界|駄犬|悬疑|连载中|2023|toi8|日本|7",
  503055: "漫画|百合|运动|连载中|青春",
  504636: "卖肉|后宫|工口|漫画|R18|异世界|恋爱|2024|閃凡人|修女|ヤンマガWeb",
  508124: "轻小说|后宫|催眠|催眠侠|搞笑|WEB|日本|已完结|2024|みょん|小说",
  511646: "漫画|系列|日本|原创|连载中|2025-12",
  515527: "JRPG|炼金工房|RPG|2025|Gust|PS5|PC|游戏|PS4|工作室|STEAM",
  520346: "ACT|PC|Platform|NS|小原好美|游戏|STEAM|2025|ADV",
  530016: "轻小说|橘公司|约会大作战|時崎狂三|百合",
  531925: "轻小说|生姜寧也",
  555423: "已购|画集"
};
