// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.06.15.35
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  565: "青山刚昌|漫画|推理|万年小学生系列|柯南|小学馆|1994|名侦探柯南|青山剛昌|死神小学生|青山剛昌的長期飯票",
  43562: "満田拓也|漫画|棒球|1994|体育|漫画系列|週刊少年サンデー|运动|已完结|小学館",
  44591: "漫画|Fate|百合|魔法少女|Type-Moon|广山弘|魔法少女☆伊莉雅|伊莉雅|2012|小学生|魔法少女伊莉雅",
  48090: "吉田秋生|漫画|1985|少女漫画|小学館|BL|80年代|系列|耽美|耽美BL|别册少女Comic",
  65458: "少女漫画|漫画|あきづき空太|白泉社|恋爱|少女漫|2006|LaLa|少女|秋月空太|奇幻",
  66368: "漫画|恋爱|音乐|集英社|アミュー|古筝|热血|少年漫画|竞技|桜アミュー|连载中",
  70861: "漫画|こうの史代|治愈|日本|日常|夫妻",
  80730: "漫画|手塚治虫|青年漫画|日本漫画|コミックス|1950",
  94009: "漫画|坂口尚|历史漫画|佛学|1993|一休宗纯|日本漫画|历史|系列|禅意",
  100392: "漫画|掰掰演劇社",
  128839: "漫画|棒球|2015|満田拓也|週刊少年サンデー|系列|竞技|连载中|日本|热血",
  140704: "已完结|限制|青年漫画|漫画系列|全21卷|八月薫|漫画|R18",
  143791: "短篇集|悬疑漫画|恐怖|楳図かずお|漫画系列|剧情|悬疑|小学馆|日本漫画|漫画|奇幻",
  153175: "松本光司|惊悚|限制|恐怖|血腥|彼岸岛|讲谈社|週刊ヤングマガジン|漫画|日本|已完结",
  170746: "漫画|猎奇|あずみきし|2013|负能量|新潮社|奇幻|连载中|黑暗|連載中|死后世界",
  195692: "漫画|恋爱|搞笑|校园|アズマサワヨシ|奇幻|病娇|KADOKAWA|2016|電撃マオウ|漫画系列",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|肉|限制",
  221948: "漫画|搞笑|工口|卖肉|后宫|沙雕|双龍|社保|微エロ|2017|漫画系列",
  253441: "青年漫画|全一卷|手冢治虫|漫画",
  288315: "漫画|少女漫画|恋爱|2019|森下suu|講談社|少女|少女漫|日本漫画|デザート|校园",
  298455: "漫画|搞笑|穿越|音乐|小川亮|2019|四葉夕卜|派对浪客诸葛孔明|转生|热血|講談社",
  298752: "漫画|格斗|战斗|超能力|奇幻|日本|2020|原创|连载中|小学館|ゲズンタイト",
  304293: "漫画|恋爱|校园|青春|2020|漫画系列|轻小说|小说改|已完结|日本",
  305824: "漫画|后宫|战斗|异世界|奇幻|R18|卖肉|色情|肉|血腥|轻小说改",
  310827: "漫画|恋爱|日常|女仆|漫画系列|小学館|2020|原创|B漫|しょたん|纯爱",
  320180: "短篇集|已完结|日本漫畫|恐龍",
  326285: "漫画|奇幻|講談社|铃木央|漫画系列|2021|战斗|日漫|系列|原创|少年漫画",
  333829: "漫画|音乐|毛塚了一郎|短篇集|2021|漫画系列|面白さ|系列|日常|短篇|個人好み",
  340384: "BL|BLコミック|BL漫画|マンガ",
  348344: "漫画|BL|悬疑|2021|惊悚|モクモクれん|耽美|克系|日本|KADOKAWA|原创",
  354383: "百合|美食|日常|漫画|ゆざきさかおみ|KADOKAWA|2021|漫画系列|Twitter|断更|真人化",
  357988: "漫画|恋爱|人外|2021|奇怪的xp|KADOKAWA|传说|フシアシクモ|漫画系列|短篇|エロ",
  373830: "漫画|异世界|奇幻|搞笑|オヤジ草|卖肉|转生|2022|后宫|御鷹穂積",
  374355: "TL|系列|已完结|日本|漫画",
  390286: "漫画|小说改|漫画系列|战斗|日本|单元剧|续作|轻改|已完结",
  390287: "漫画|小说改|已完结|漫画系列|续作|轻改|战斗|日本",
  391572: "漫画|治愈|日本|百合|温馨|新装版|日常",
  392893: "漫画|漫画系列|系列|已完结|TL|日本|纸质书",
  398601: "漫画|病娇|伦理|父女|黑暗|蝉丸|2022|恋爱|JK|漫画系列",
  402768: "漫画系列|gal改|游戏改|漫画|2023|治愈|末世|机器人|萝莉|ATRI|横滨购物",
  403581: "漫画系列",
  405000: "搞笑|漫画系列|漫画|连载中|系列|原创|2026-01|日本",
  406476: "漫画系列",
  417220: "恋爱|漫画|少女漫画|小学館|2023|连载中|原创|青文出版社|女作者|系列|收藏",
  440076: "战斗|轻小说改|奇幻|漫画|连载中|小说改|日本|系列|哥布林的作者|画功好|纸质书",
  444076: "韩漫|韩国|已完结|漫画|条漫",
  445751: "竞技|漫画|系列|2023|連載中|运动|2026-01|连载中|尖端出版社|マンガ|原创",
  448626: "漫画|返老还童|死者苏生|战斗|鬼怪|黑暗|8|寿命论|新挑限|战斗分镜强|悬疑",
  461564: "漫画|2023|講談社|小學生|城戸志保|原创|日本|2025-12|系列|连载中|日漫",
  471549: "漫画|恋爱|战斗|奇幻|2024|不像少女漫|少女マンガ|狐娘老婆|有意识使用武力|漫画系列",
  479588: "已购|画集・設定資料集|2024",
  482298: "日本|漫画|游戏改|系列|已完结|漫画系列",
  490753: "百合|漫画|异世界|GL|玉崎たま|2024|连载中|原创|日本|コミック百合姫|連載中",
  499667: "百合|漫画|雨水汐|扭曲|性癖|2024|连载中|連載中|マンガ|コミック百合姫|校园",
  531577: "漫画",
  536292: "漫画|连载中|日本|原创|卖肉|系列|2026-01",
  543455: "系列|连载中|小说改|隐藏身份|日本|奇幻|漫画",
  546321: "漫画|治愈|日常|集英社|生活|一般向|原创|日本|2025|连载中|系列",
  553472: "日本|漫画|系列|连载中",
  601268: "",
  617946: ""
};
