// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2024.12.3.534
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  502: "久米田康治|漫画|絕望先生|黑色幽默|绝望|讽刺|愤青|讲谈社|2005|治愈系|講談社",
  48620: "漫画|松井优征|暗殺教室|校园|JUMP|少年JUMP|集英社|搞笑|松井優征|欢乐|殺老師",
  57143: "漫画|恋爱|校园|Tiv|后宫|搞笑|政宗君的复仇|竹岡葉月|竹冈叶月|一迅社|月刊ComicREX",
  91572: "少女漫画|漫画|校园|少女漫|りぼん|兄妹|双子|恋爱|槙ようこ|少女マンガ|集英社",
  127364: "漫画|日日日|真西まり|轻小说|百合|漫画系列",
  132528: "新島夕|Galgame|恋×シンアイ彼女|水月陵|暖人心田|Us:track|新岛夕|きみしま青|PC|治愈|2015",
  177598: "科幻|单元剧|漫画|已完结|漫画系列|マンガ|山田胡瓜|進撃の巨人|人机|系列|全8卷",
  201197: "少女|已完结",
  210895: "漫画|卖肉|百合|猎奇|山田恵庸|战斗|R18|黑暗|2017|限制|肉",
  235100: "推理|漫画|金田一|侦探|2018|講談社|漫画系列|イブニングKC|悬疑|佐藤文也|有英化版",
  236546: "漫画|小说改|轻改|异世界|2017|穿越|奇幻|管理国家|漫画系列|政治",
  236624: "漫画|轻改|异世界|战斗|轻小说改|奇幻|2018|ありかん|B漫|小说改",
  254437: "百合|漫画|战斗|寿命论|あおのなち|奇幻|コミック百合姫|一迅社|2018|战争|悬疑",
  267222: "漫画|恐怖|搞笑|泉朝树|2018|百合|泉朝樹|ニコニコ静画|日本漫画|KADOKAWA|角川书店",
  267399: "漫画|搞笑|冒险|末世|丧尸|高田康太郎|2018|僵尸|麻生羽吕|小学館|麻生羽呂",
  279379: "漫画|搞笑|日常|遠藤達哉|亲情|集英社|少年JUMP+|超能力|2019|战斗|萝莉",
  291900: "少女漫画|リカチ|恋爱|漫画|战斗|日本漫画|魔法|漫画系列|致郁|冒险|一般向",
  307237: "漫画|体育|つるまいかだ|热血|竞技|2020|滑冰|講談社|月刊アフタヌーン|励志|运动",
  307721: "漫画|轻改|异世界|小说改|搞笑|轻小说改|日本|奇幻|漫画系列|穿越|连载中",
  309385: "漫画|热血|战斗|集英社|松本直也|少年JUMP+|怪獣|2020|少年向|科幻|連載中",
  312429: "百合|漫画|U-temo|日常|2020|轻百合|校园|一迅社|生活|短篇|20年代",
  317087: "漫画|奇幻|恋爱|轻改|轻小说改|狗粮|异世界|魔女|小说改|越水ナオキ|2020",
  319012: "漫画|鈴木祐斗|战斗|周刊少年JUMP|杀手|2020|日常|搞笑|JUMP|連載中|週刊少年ジャンプ",
  320495: "百合|漫画|校园|桜木蓮|芳文社|恋爱|日常|2020|Kirara|漫画系列",
  322890: "漫画|搞笑|战斗|桜谷シュウ|2020|脑洞|猎奇|Comiplex|漫画系列|日本漫画",
  326686: "小说改|漫画|漫画系列|少女漫画|异世界",
  332250: "漫画|龍幸伸|战斗|怪谈|集英社|奇幻|JUMP+|搞笑|少年ジャンプ＋|龙幸伸|2021",
  337920: "百合|漫画|自爆卡车|こすずめ|废萌|女性主角|2021|搞笑|漫画系列|WEB|GANMA!",
  339307: "PC|ACT|银河城|国产|ARPG|横板|STEAM|游戏|RPG|PS5|5+20",
  343657: "漫画|异世界|奇幻|小说改|轻小说改|漫画系列|少年漫|門司雪|战斗|アルト",
  348390: "漫画|小说改|校园|轻小说改|青梅竹馬|2021|恋爱|青梅竹马|没啥好看|桃子|雲雀湯",
  349339: "恋爱|漫画|人妻|巨乳|卖肉|搞笑|漫画系列|ねこ末端|杀必死|一般向|伪后宫",
  354774: "校园|漫画|轻小说改|轻小说|漫画系列|KADOKAWA|紗々音シア|2021|衣笠彰梧",
  363133: "百合|漫画|漫画系列|やまだしゅら|宇佐楢春|マンガUP！|已完结|2021",
  368650: "漫画|末永裕樹|馬上鷹将|落语|2022|大女主|集英社|週刊少年ジャンプ|连载中|漫画系列|热血",
  368813: "漫画系列|漫画|小说改|异世界",
  372015: "百合|Galgame|全年龄|幼驯染|2023|GAL|PC|ADV|仰木サヤ|フカヒレ|1000-REKA",
  372523: "百合|Galgame|全年龄|LYCORIS|GAL|2023|PC|塩こうじ|STEAM|2022-10|系统不行",
  372591: "百合|漫画|幼驯染|ヒジキ|恋爱|校园|2022|漫画系列|竹書房|实体",
  373168: "少女漫画|白泉社|异世界|漫画系列|酒井ゆかり|2022",
  388241: "百合|漫画|卖肉|cosplay|漫画系列|2022|微エロ",
  393678: "漫画|恋爱|校园|日常|小说改|搞笑|一般向|轻小说改|日向あずり|尾野凛|たかた",
  398897: "百合|漫画|搞笑|校园|姐妹百合|漫画系列|姐妹|2022|连载中",
  403637: "漫画|校园|恋爱|肉丸|原创|圈乱|NTR？|贵乱|谜|一般向|婊子",
  408208: "百合|漫画|姐妹|日常|偶像|漫画系列|搞笑|恋爱|妹|姐|コミック百合姫",
  410208: "漫画|工口|校园|一般向|恋爱|限制|卖肉|已完结|魅魔",
  423390: "韩漫|韩国|Neon.B|webtoon|An_Narae",
  434772: "漫画|恋爱|日常|江户|战斗|欢乐|漫画系列|2023",
  444472: "百合|漫画|北尾タキ|轻百合|2023",
  459461: "百合|漫画|校园|搞笑|2023|おーうち|xp|古田朋大|JK|卖肉",
  466038: "轻小说|小说系列|2023|ファンタジア文庫|逆霧",
  473184: "Galgame|桐葉|ルクル|全年龄|分割商法|rkr|PC|百合|同人|游戏|2024",
  507670: "",
  518714: "漫画",
  519040: "Windows|猎奇|游戏|PC|AVG|重口|STEAM|无修正|ryona|EROGE|R18"
};
