// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.04.01.82
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  5510: "轻小说|小木君人|植田亮|重生|小说|后宫|萝莉|ガガガ文庫|一卷全|小说系列|系列",
  6479: "中村明日美子|幾原邦彦|漫画|Lolita|内涵|几原邦彦|猎奇|少女漫画|系列|原创|画风",
  6833: "漫画|木尾士目|宅|青春|校园|日常|2002|講談社|搞笑|已完结|大学",
  10360: "漫画|木尾士目|宅|青春|校园|2010|偽娘|現視研|講談社|御宅|萌",
  19795: "轻小说|西尾维新|世界系列|崩坏|西尾維新|妹控|文字游戏|小说|杀人|推理|2003",
  25950: "皆川亮二|漫画|漫画系列|科幻|青年漫画|战斗|日本漫画|奇幻|系列|小学館",
  68485: "漫画|鳥山明|鸟山明|科幻|全一卷|2000|單卷|コミックス|週刊少年ジャンプ|冒险|奇幻",
  70754: "谷川流|轻小说|小说系列|メディアワークス",
  76385: "漫画|异世界|芊尾悟|漫画系列|轻改|柳内たくみ|小说改|改编|日本|轻小说改|アルファポリス",
  84853: "漫画系列|已完结|一般向|¬|【系列】|版本|CC",
  86725: "山下和美|漫画|治愈|强力|完美|漫画系列|日本漫画|系列|超長篇|CC|未完结漫画",
  87195: "漫画|池上辽一|青年漫画|池上遼一|1990|武論尊|漫画系列|小学館|系列|枪械漫画",
  88290: "芳文社|漫画|百合|日常|萌|Koi|ご注文はうさぎですか|请问您今天要来点兔子吗？|搞笑|轻百合|点兔",
  134684: "轻小说|异世界|藤ちょこ|性转|奇幻|战斗|厕纸|りゅうせんひろつぐ|小说|小説家になろう|マイクロマガジン社",
  141669: "科幻|漫画|小说改|伊藤计划|短篇|SF|漫画系列|2015|系列|中二|已完结",
  148464: "藤崎竜|漫画|集英社|小说改|田中芳樹|科幻|藤崎龙|银河英雄传说|連載中|连载中|系列",
  195702: "恋爱|少女|漫画|少女漫画|冒险|鈴木ジュリエッタ|日本漫画",
  198200: "集英社|系列|原创|冒险|漫画系列|秋本治|漫画|日本|已完結|已完结",
  214260: "漫画|芥見下々|热血|战斗|JUMP|2018|咒术回战|集英社|少年漫画|芥見下|短篇",
  225513: "漫画|青年|搞笑|日常|久世岳|成人向|一迅社|漫画系列|青年漫画|真实|连载中",
  232428: "BL|ABO|BLコミック|羽純ハナ|漫画系列|BL漫画|2017|成年コミック|连载中|H|人外",
  238887: "漫画|芥見下々|战斗|集英社|热血|少年JUMP|芥見下|2018|JUMP|少年漫画|週刊少年ジャンプ",
  250535: "",
  257531: "少女漫画|漫画|少女|鈴木ジュリエッタ|日本漫画",
  265141: "漫画|异世界|轻改|转生|弱智|小说改|漫画系列|大堀ユタカ|轻小说改|奇幻|屎",
  295253: "漫画|中村充志|搞笑漫画|周刊少年JUMP|集英社|日漫|2019|已完结|搞笑|系列|原创",
  295271: "轻小说|性转|战斗|小说系列|ショウセツ|异世界|web小说|热血|TS|我愿称之为厕纸|龙傲天",
  298405: "漫画|少女|漫画系列|日本|奇幻|日漫|连载中|系列|原创|2026-01",
  299585: "轻小说|奇幻|后宫|小说系列",
  305876: "漫画|转生|小说改|悪役|轻小说改|搞笑|迪化|2019|餅月望|漫画系列|连载中",
  309218: "轻小说|二語十|奇幻|小说系列|MF文庫J|恋爱|2019|小说|うみぼうず|系列|后宫",
  312239: "漫画|百合|熊倉献|奇幻|2020|熊仓献|漫画系列|超能力|已完结|日常|青春",
  319309: "漫画|科幻|安田佳澄|悬疑|2020|連載中|青年漫画|活下去|智斗|マンガ|青年",
  320214: "漫画|异世界|轻改|战斗|2020|网游|小说改|穿越|策略|奇幻|魔法",
  337073: "中国",
  337711: "漫画|少女|连载中|人外|原创|擦边|纯爱|系列|优先|2025-09",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|KADOKAWA|燦SUN",
  389637: "轻小说|来栖夏芽|异世界",
  397211: "历史|漫画|2021|トマトスープ|番茄汤|宫斗|系列|连载中|原创|日本|秋田书店",
  397403: "小说系列|Eve",
  409689: "漫画|短篇集|よしながふみ|2023|日本|集英社|原创|吉永史|已完结|日本漫画|一般向漫画",
  425417: "漫画|校园|已完结|朝賀庵|病态|系列|SM|日本|2023|一般向|搞笑",
  427471: "漫画|周刊少年JUMP|系列|週刊少年ジャンプ|已完结|电影|校园|日本|佐伯俊|原创|漫画系列",
  432211: "漫画|小说改|猎奇|百合|战斗|大逃杀|一般向|日本|连载中|漫画系列|轻小说改",
  435154: "轻小说|异世界|南野海風|校园|日本|系列|小说|奇幻|连载中|2021",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|日本|講談社|连载中|原创",
  457341: "转生|搞笑",
  471502: "漫画|杉崎ゆきる",
  490905: "轻小说|恋爱|織島かのこ|校园|纯爱|小说系列|2024|ただのゆきこ",
  505451: "",
  510664: "轻小说",
  526509: "八目迷|轻小说|时与四季|恋爱|奇幻|小说|青春|2025|纯爱|单行本|悬疑",
  537761: "百合|漫画|画集|原创|GL|日本|ムロマキ|真百",
  542035: "",
  553290: "百合|漫画|短篇集|伊藤ハチ|相崎うたう|雨水汐|恋爱|短篇|GL|幼驯染|コダマナオコ",
  599535: ""
};
