// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.06.16.47
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  142: "key|Galgame|麻枝准|Kanon|久弥直樹|催泪|樋上いたる|泣きゲー|PC|GAL|1999",
  232: "key|麻枝准|Galgame|air|鸟之诗|催泪|泣きゲー|观铃|神作|国歌|PC",
  563: "CLAMP|万年坑|漫画|这辈子见不到结局了|X|角川书店|神威好媳妇|耽美系|少女漫画|坑|擦边球",
  10617: "漫画|治愈|科幻|芦奈野仁|末日|芦奈野ひとし|横滨购物纪行|日本星云奖|日常|1994|生活",
  20675: "暁WORKS|Galgame|PC|泣きゲー|GAL|AB2|2012|PS3|2012-03|‘＆’",
  38979: "Galgame|KID|5pb.|重制|志倉千代丸|AVG|Ever17|GAL|Xbox|Xbox360|infinity",
  62927: "漫画|川原礫|南十字星|漫画系列|2012|日本|奇幻|完结|四格|科幻|SF-",
  71193: "漫画|系列|职场|灾难|中篇|漫画系列",
  84888: "漫画|刀剑神域|比村奇石|轻小说改|完结|2013年|狗粮|漫画系列|連載中|轻小说|恋爱",
  85896: "Galgame|PeasSoft|妹|PC|2014|双飞|生肉|ADV|实妹|小倉結衣|后宫",
  119393: "漫画|冒险|致郁|来自深渊|奇幻|つくしあきひと|猎奇|竹書房|幼女|連載中|硬奇幻",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  220773: "漫画|异世界|轻改|凤傲天|百合|奇幻|女性主人公|轻小说改|穿越|冒险|小说改",
  230297: "漫画|小川悦司|料理|系列|竞技|美食|日漫|少年漫画|漫画系列|料理漫画",
  230591: "漫画|石黑正数|悬疑|科幻|石黒正数|2018|講談社|脑洞|公路|战斗|末世",
  249876: "ADV|Galgame|Traumend|PC|同人|游戏|全年龄|音乐美|10h-|dw|资源难找",
  260111: "漫画|异世界|转生|小说改|轻小说改|搞笑|轻改|史莱姆|彭傑|开挂无敌|无敌",
  261543: "百合|轻小说|みかみてれん|恋爱|将放言说女生之间不可能的女孩子，在百日之内彻底攻陷的百合故事|小说|系列|校园|官能|小说系列",
  265151: "异世界|漫画|轻改|后宫|无双|真綿|小说改|转生|智商低|穿越|浪费设定",
  270112: "漫画|恶役千金|恋爱|小说改|轻改|吉村旋|搞笑|柚原テイル|异世界|2018|恶役",
  271005: "漫画|后宫|福利向|战斗|竹村洋平|卖肉|奇幻|2019|福利|肉|集英社",
  279893: "板垣恵介|格斗|漫画|搞笑|2018|格斗漫画|漫画系列|相扑道|秋田书店|热狗人",
  293668: "マンガ",
  311891: "漫画|恋爱|短篇|校园|青春|JUMP|三浦糀|2020|週刊少年ジャンプ|动作|社团",
  316278: "漫画|恋爱|校园|奇幻|魔女|日常|仲邑エンジツ|已完结|2020|少年画报社|连载中",
  324102: "漫画系列|已完结|全3卷",
  330890: "漫画|漫画系列",
  340073: "小说改|漫画系列",
  341375: "漫画|魔法|乙女|轻改|成长|依空まつり|桟とび|漫画系列|内向|奇幻|小说改",
  342106: "漫画|板垣巴留|2021|連載中|搞笑|漫画系列|热血|秋田書店|マンガ|画风",
  371101: "漫画|异世界|奇幻|轻改|2019|刀坂アキラ|加茂セイ|月刊少年シリウス|战斗|轻小说改|恋爱",
  375316: "漫画|恋爱|幼驯染|搞笑|校园|后宫|2022|日常|党争|講談社|三簾真也",
  392095: "漫画|恋爱|校园|小说改|纯爱|轻小说改|漫画系列|2022|轻改|网络连载|講談社",
  409281: "黑暗|犯罪|漫画|悬疑|战斗|少年|智斗|杀手",
  412501: "青年漫画|工口|漫画|已完结",
  431932: "Galgame|艹猫|PC|NEKOWORKs|汉化|GAL|游戏|后宫|文字游戏|2025",
  432458: "漫画|One|搞笑|想象力|日本|原创|設楽清人|BUGEGO|系列|连载中|校园",
  452281: "悬疑|@|小说改|7.5|結城真一郎|第一个故事有意思",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|講談社|2023|日常|后宫|午夜心旋律",
  457692: "漫画|恋爱|校园|身份交换|搞笑|岸川瑞樹|前任文学|2024|奇幻|少年ジャンプ＋|日本",
  473830: "PC|Galgame|VN|游戏|NS|2025|待发售",
  497214: "百合|Galgame|PC|游戏|AVG|GL|VN",
  513940: "Galgame|FrontWing|浅生咏|GAL|全年龄|松本文纪|前翼社|2025|游戏|ゆさの|待发售",
  553277: "画集|中国|国产|纸质书"
};
