// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.11.03.51
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|少年JUMP|OP",
  8949: "漫画|樋野茉莉|吸血鬼|少女漫画|画工不错|樋野まつり|白泉社|吸血鬼骑士|女性向|少女漫|乙女向",
  16057: "漫画|甲斐谷忍|短篇|智斗|コミックス|短篇集|全一卷|系列|讲谈社|2008|短",
  24207: "漫画|肉|后宫|佐藤ショウジ|战斗|校园|卖肉|恋爱|福利|漫画系列|日本",
  26944: "石黒正数|漫画|推理|科幻|神展开|短篇|伦理|石黑正数|2011|講談社|黑暗",
  44121: "森下suu|漫画|少女漫画|少女漫|日々蝶々|集英社|少女|マーガレット|高嶺之花|三无女|恋爱",
  77155: "漫画|已完结|光永康則|全4卷|工口|节操漫不解释|青年漫画|漫画シリーズ|卖肉|エロ|漫画系列",
  80299: "搞笑|漫画|姐弟|清末邦彦|日常|治愈|日本漫画|2011|コミックハイ!|实姐|德国骨科",
  83914: "皮皮传|漫画|口袋妖怪|搞笑|穴久保幸作|冒险|已完結|搞笑漫画|pokemon|toku",
  143080: "少女漫画",
  145280: "森本梢子|少女漫|少女漫画|漫画|搞笑|少女|已完结|高台家的成员|恋爱|女性漫画|Comic",
  155705: "Galgame|白もち桜|hearts|妹|萝莉|PC|GAL|2016|生肉|ADV|实妹",
  170007: "漫画|シモダアサミ|日常|搞笑|月刊アクション|中学生性日记|漫画系列|2013|双葉社|系列|短篇",
  178494: "少女漫画|漫画|野切耀子|已完结|日本|男二控|期待度1|日本漫画|全4卷|ARIA|日漫",
  191651: "漫画|搞笑|校园|日常|后宫|安部真弘|社团|恋爱|周刊少年Champion|黑丝|2016",
  249482: "漫画|搞笑|天原|穿越|エロ|万太郎|2017|欢乐|系列|糟糕|贞操观",
  270190: "漫画|漫画系列|异世界|轻改|2018|B漫|春乃えり|竹書房|转生|小说改|轻小说改",
  295693: "漫画|日漫|表|BG|書籍化|系列|恋爱|漫画系列|青梅竹马",
  315767: "漫画|末世|2020|公路|治愈|さいとー栄|百合|原创|日本|系列|连载中",
  324883: "マンガ",
  326654: "漫画|恋爱|开大车|轻改|异世界|2020|轻小说改|御姐x正太|shiryu|となりける|系列",
  347848: "漫画|轻小说改|恋爱|校园|2021|日常|小说改|一般向|日本|カメーリエ|搞笑",
  368650: "漫画|落语|2022|末永裕樹|馬上鷹将|热血|集英社|大女主|週刊少年ジャンプ|连载中|日本",
  372262: "漫画系列|日本|漫画|短篇集|小说改|系列",
  377526: "漫画|漫画系列",
  378189: "漫画|战斗|少年漫画|漫画系列|少年|一般向|晴川シンタ|2021",
  378564: "系列|漫画系列",
  384494: "漫画|恋爱|搞笑|2022|雌小鬼|漫画系列|校园|原创|講談社|日本|週刊少年マガジン",
  409402: "百合|漫画|ウオズミアミ|2022|漫画ウオズミアミ|恋爱|NTR|人妻|日本漫画|GL|集英社",
  453901: "漫画|恋爱|党争|校园|五十嵐正邦|搞笑|2023|講談社|日常|后宫|原创",
  454851: "漫画|后宫|卖肉|佐原玄清|校园|2023|穿越|奇幻|恋爱|一般向|漫画系列",
  455423: "浅野いにお|漫画|杀手|2023|系列|浅野一二|战斗|青年漫画|浅野一二〇|政治|未完结漫画",
  463771: "漫画|恋爱|日常|直球|多治見尚哉|原创|2023|系列|漫画系列|连载中|日本",
  464379: "漫画|卖肉|异世界|穿越|控制欲|そらモチ|奇幻|H|墨天業|川崎悠|2023",
  486042: "Galgame|民俗|CARNELIAN|ROOT|重置|2025|拔作|PC|悬疑|ADV|游戏",
  497897: "漫画|搞笑|原创|外星人|系列|日常|日本|一般向|卖肉|泽田コウ|连载中",
  504636: "卖肉|后宫|漫画|工口|异世界|R18|恋爱|閃凡人|修女|2024|穿越",
  523908: "Galgame|CIRCUS|全年龄|初音岛|妹|废萌|萝莉|2025|DC|幼驯染",
  569616: ""
};
