// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2025.08.24.14
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  26405: "片岡とも|Galgame|ねこねこソフト|猫猫社|感动|妹|治愈|PC|妹ゲー|GAL|冬",
  181993: "漫画系列|已完结",
  189208: "漫画|集英社|三好輝|福尔摩斯|2016|犯罪|日本漫画|竹内良輔|一般向|少年|冒险",
  191037: "少女漫画|漫画系列|已完结|全11卷",
  196954: "少女",
  201573: "",
  216554: "漫画|恋爱|恐怖|椎名うみ|悬疑|灵异|2016|月刊アフタヌーン|講談社|連載中|少女漫画",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|連載中|講談社",
  217833: "漫画|艺术|山口つばさ|校园|講談社|成长|2017|青年漫画|月刊アフタヌーン|美术生|美术",
  220792: "漫画|搞笑|小林家的龙女仆|奇幻|漫画系列|月刊Action",
  220844: "漫画|Fate|漫画系列|fgo|Type-Moon|連載中|系列|主条目|奇幻|川口毅|カワグチタケシ",
  221040: "异世界|漫画|战斗|奇幻|游戏改|漫画系列|FF系列",
  244959: "SRPG|同人|RPG|游戏性|アドレナ戦記|Galgame|战斗|freegame|约50或100h|魂like",
  270199: "漫画|异世界|中二|搞笑|龙傲天|小说改|轻小说改|转生|2018|轻改|KADOKAWA",
  271065: "中国",
  272351: "格斗|漫画|战斗|2019|漫画系列|格斗漫画|だろめおん|小学館|打斗|老年痴呆|搞笑",
  286110: "ACT|海贼无双|PS4|PC|海贼王|2020|无双|万代南梦宫|白金达成|繁体中文版|Galgame",
  287300: "BL|漫画系列|讲谈社|BLコミック",
  289304: "耽美|BL漫画|BLコミック|カキネ",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|2019|集英社|権平ひつじ|已完结|漫画系列",
  293551: "漫画|恋爱|狗粮|日常|校园|雪森寧々|集英社|甜|小恶魔|2019|爱情",
  295492: "漫画|漫画系列|转生|小说改编|搞笑|奇幻|战斗|异世界|小说改",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|漫画系列|女装",
  326724: "漫画|恋爱|校园|喜剧|搞笑|久世蘭|原创|杀必死|逆推|2021|講談社",
  328376: "漫画|校园|エロ|卖肉|福利|搞笑|色情|糟糕|ムラタコウジ|漫画系列|コミックヘヴン",
  334753: "Galgame|韩国|全年龄|短篇|STEAM|电影视觉小说|MidnightWorks|PC|时空跳跃|2021|科幻",
  339092: "轻小说|恋爱|校园|白毛|插画好看|纯糖|角川スニーカー文庫|燦々SUN|ももこ|KADOKAWA|小说系列",
  349339: "恋爱|漫画|人妻|巨乳|搞笑|卖肉|杀必死|ねこ末端|已完结|漫画系列|日本",
  368804: "漫画|战斗|奇幻|講談社|2022|热血|裏那圭|漫画系列|原创|废品",
  378649: "漫画",
  382508: "漫画|搞笑|漫画系列",
  395984: "异世界|漫画|正太|种田流|奇幻|漫画系列|青色まろ|赤池宗|轻小说改|2021|小说改",
  403378: "漫画|中国|魔幻|国漫|国创",
  421419: "漫画|后宫|恋爱|一般向|青年漫|搞笑|福利|泥石流|女拳",
  423149: "",
  429425: "小说",
  457605: "漫画|治愈|职场",
  465813: "",
  469153: "轻小说|背德|扇風気周",
  486053: "阿泉来堂|小说|系列",
  500226: "",
  509166: "Galgame|全年龄|PC|丸户史明|2024|ADV|丸戸史明|游戏|NS|等发售|喜剧",
  513795: "漫画|丧尸|卖肉|日本|后宫|2024|系列|猎奇|原创|连载中|搞笑",
  530363: "轻小说|丸戸史明|恋爱|小说|2025|37|小说系列",
  538910: "日本|漫画|BL|原创|已完结|系列"
};
