// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.01.23.85
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  7644: "麻枝准|AngelBeats!|GDM|神曲|Monster|KSL|INST|插入曲|アニメ|Angel|Dead",
  14483: "轻小说|阴阳师|东京暗鸦|あざの耕平|战斗|恋爱|幼馴染|热血|小说|微燃|奇幻",
  76385: "漫画|异世界|芊尾悟|漫画系列|轻改|柳内たくみ|小说改|改编|日本|轻小说改|アルファポリス",
  86421: "轻小说|大森藤ノ|在地下城寻求邂逅是否搞错了什么|王道剧情|后宫|奇幻|GA文庫|战斗|小说|系列|ヤスダスズヒト",
  122776: "漫画|治癒|徳間書店|今井哲也|超能力|連載中|漫画系列|系列|短篇|マンガ|治愈",
  130540: "轻小说|在地下城寻求邂逅是否搞错了什么|外传|大森藤野|大森藤ノ|外传上瘾|GA文庫|小说|小说系列|王道剧情|战斗",
  180060: "漫画|搞笑|公主|奇幻|熊之股鍵次|魔王|小学馆|欢乐向|2016|在魔王城说晚安|欢乐",
  193851: "漫画|悬疑|智斗|河本ほむら|吉村英明|生存游戏|生存|推理|已完结|2015|漫画系列",
  212997: "小说",
  217598: "漫画|恋爱|宮島礼吏|校园|后宫|2017|周刊少年magazine|搞笑|讲谈社|灌水|連載中",
  242129: "漫画|叶精作|小池一夫|漫画系列|青年漫画|1977|福利|单元剧|已完结|GORO|日本",
  242602: "漫画|种田|穿越|历史|小说改|轻小说改|2017|沢田一|轻改|日本|连载中",
  245274: "漫画|小说改|转生|轻改|异世界|恶役千金|少女漫画|ビス|2018|玉岡かがり|恋爱",
  250520: "国漫|搞笑|漫画|童年|中国|彩漫|国产|2008|补标|日常|喜剧",
  252542: "轻小说|恋爱|狗粮|紙城境介|青春|校园|角川スニーカー文庫|搞笑|2017|治愈|小说",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|日本|つきや|少女漫|连载中",
  270190: "漫画|异世界|漫画系列|轻小说改|轻改|春乃えり|B漫|2018|小说改|竹書房|转生",
  272026: "漫画系列|漫画|短篇|完结|系列",
  279507: "轻小说|宇野朴人|魔法世界|奇幻|小说系列|2018|战斗|电撃文库|電撃文庫|发刀|校园",
  286892: "轻小说|性转|小说系列|BS|あし|WEB|无聊|垃圾",
  289602: "漫画|恋爱|搞笑|校园|少女漫画|木内ラムネ|2018|年下|少女|集英社|少女漫",
  293355: "漫画|搞笑|百合|欢乐|电波|轻百合|沙雕|日常|2019|抽象|講談社",
  295217: "轻小说|河野裕|智斗|科幻|架見崎系列|小说|幻想|系列|神作|越島はぐ|小说系列",
  297267: "漫画|恋爱|党争|吉河美希|2020|搞笑|講談社|周刊少年magazine|日漫|週刊少年マガジン|妹",
  300270: "百合|轻小说|みかみてれん|竹嶋えく|后宫|欢乐|恋爱|屑粉毛|小说|日本|校园",
  308287: "漫画|神鬼|悬疑|怪谈|奇幻|ぬじま|萝莉|小学館|女性主人公|漫画系列|2019年",
  311834: "百合|轻小说|异世界|奇幻|战斗|恋爱|WEB|鴉ぴえろ|小说|小说系列|2020",
  316965: "漫画|日常|R18|成年コミック|生活感|双龍|恋爱|集英社|限制|2020|未完结漫画",
  326724: "漫画|恋爱|校园|喜剧|搞笑|原创|久世蘭|杀必死|连载中|逆推|2021",
  329858: "漫画|甜米らくれ|卖肉|露出|恋爱|色气|2021|摄影|好看的|漫画系列|日本",
  336906: "漫画|恋爱|日常|namo|科普|职业|幼驯染|治愈|KADOKAWA|漫画系列|日本",
  343241: "轻小说|恋爱|校园|败犬|搞笑|雨森たきび|青春|恋爱喜剧|日本|小说|GAGAGA文库",
  347240: "漫画|战斗|龙傲天|奇幻|异世界|误解系|不要动脑！|酷儿角色|搞笑|灾难|畫功好",
  355888: "已完结|全3卷|生存|生存遊戲",
  358187: "轻小说|恋爱|校园|重置|小说|HJ文庫|青春|小说系列|ラブコメ|雨宮和希|连载文",
  365620: "漫画|2021|异世界|奇幻|轻小说改|坂野杏梨|小说改|漫画系列|冒险|ヤンマガWeb|灾难",
  376422: "漫画|恐怖|灵异|漫画系列|萝莉|原创|可爱|日本|日漫|女主|百合太郎",
  389454: "轻小说|恋爱|黑长直|小说|小说系列|疎陀陽|校园|日本|后宫|恶役|2022",
  400332: "轻小说|恋爱|校园|猫又ぬこ|狗粮|穿越|日本|2022|小说系列|講談社|前任",
  426967: "轻小说|七沢またり|狂气|小说|白毛|奇幻|战记|小说系列|系列|日本轻小说|女性向",
  433639: "漫画|奇幻|转生|小说改|7.1|画风还行|不够爽|sb太跳脸",
  433726: "漫画|青春|奇幻|校园|JK|小说改|复制人|一般向|日常|画功好|7.4",
  433903: "",
  433931: "",
  462533: "漫画|恋爱|战斗|杀手|黑暗|暴力|大瀬戸陸|分镜爽|連載中|2024|黑道",
  465369: "奇幻|漫画|战斗|神鬼|致郁|历史|女性主人公|2023|别致",
  476978: "轻小说|恋爱|青梅|2023|病娇|日本|连载中|overlap|系列|小说系列|OVERLAP文库",
  489436: "轻小说|恋爱|3pu",
  493365: "性转|漫画|TS|三角恋|校园|2024|百合|恋爱|日本|异性恋|畫功好",
  497178: "轻小说|后宫|小说",
  501181: "漫画改|日本|漫画|系列|已完结",
  505355: "轻小说|2024|單卷|恋爱",
  527456: "",
  570431: "JRPG|PS5|2025|NS2|RPG|NS|Gust|游戏|PC|工作室|Switch",
  615503: "ED|葬送的芙莉莲|2026|milet|动画|日本|2026年1月|CD|专辑|葬送的芙莉莲第二季|anime"
};
