// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2026.10.21.67
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  3510: "海贼王|尾田荣一郎|JUMP|热血|漫画|少年漫画|集英社|燃|神作|少年JUMP|OP",
  8352: "漫画|猎奇|重口|芙兰|木々津克久|人体改造|医学|木木津克久|萌|2006|各种手术",
  13982: "漫画|热血|加藤和惠|JUMP|青驱|集英社|青之驱魔师|恶魔|战斗|青の祓魔師|少年漫画",
  132067: "漫画|城平京|推理|恋爱|片瀬茶柴|悬疑|鬼神|講談社|2015|奇幻|少年マガジンR",
  234799: "漫画|恋爱|色气|校园|福田晋一|cosplay|辣妹|日常|日本|2018|爱情",
  257333: "漫画|番外|搞笑|赤坂アカ|2018|G3井田|校园|配角|漫画系列|集英社|恋爱",
  276371: "漫画|恋爱|杀必死|校园|日常|中田ゆみ|一迅社|2019|已完结|师生恋|伪娘",
  285997: "漫画|猎奇|重口|医学|木津克久|木々津克久|2019|画风|38|木木津克久",
  288315: "漫画|少女漫画|恋爱|森下suu|2019|講談社|少女漫|少女|校园|日本漫画|デザート",
  308287: "漫画|神鬼|悬疑|怪谈|奇幻|ぬじま|萝莉|小学館|2019年|漫画系列|女性主人公",
  313877: "百合|漫画|奇幻|人外|猎奇|苗川采|2020|妖怪|日本|漫画系列|轻百合",
  332037: "漫画|恋爱|青春|运动|校园|三浦糀|週刊少年ジャンプ|党争|2021|集英社|日本",
  333285: "漫画|日常|治愈|真造圭伍|2021|小学館|日本|慢生活|连载中|原创",
  346060: "漫画|奇幻|2021|江野スミ|江野朱美|神鬼|猎奇|战斗|怪异|漫画系列|系列",
  439199: "漫画|恋爱|校园|阿賀沢紅茶|日本|已完结|集英社|原创|2020|群像|系列",
  502531: "漫画|恋爱|校园|一般向|日本|连载中",
  510299: "漫画|集英社|2024|战斗|JUMP|日本|校园|忍者保镖|热血|2026-01|畫功好",
  511646: "漫画|致郁|原创|日本|2024|连载中|百合|系列|亜月ねね|边缘群体|青年",
  534919: "恋爱|漫画|假小子|校园|日本|日常|原创|连载中|系列|纯爱|异性恋",
  569178: "漫画|恋爱|职场|搞笑|ずり騎士|日本|误解|反差|连载中|幻想|7.4",
  572419: "漫画|恋爱|日本|连载中|日常|桜井のりお|外传|原创|校园|七坂ハイカ|樱井纪雄"
};
