// ==UserScript==
// @name        azusa_partner_library_bgm_tags_updates
// @namespace   https://greasyfork.org/users/1396048-moeruotaku
// @version     2024.12.21.524
// @description bgm_tags_updates
// @author      moeruotaku
// @license     MIT
// @match       https://azusa.wiki/torrents.php*
// @match       https://zimiao.icu/torrents.php*
// @icon        https://bgm.tv/img/favicon.ico
// @grant       none
// ==/UserScript==

const bgm_tags = {
  1488: "minori|Galgame|七尾奈留|新海诚|ef|天门|御影|纯爱|ef_-_the_first_tale.|PC|鏡遊",
  34225: "藍井エイル|FATE|角色歌|2012|动漫印象集|重永亮介|アニメ|IM|井上日徳|安田貴広|印象曲",
  42232: "漫画|热血|少年JUMP|古馆春一|运动系|排球|运动|ハイキュー!!|集英社|JUMP|古舘春一",
  47162: "漫画|搞笑|四格|月刊少女野崎君|椿いづみ|校园|少女漫画|少女漫|恋爱|椿泉|日常",
  49043: "桂正和|漫画|短篇|M|福利|2005|コミックス|全一卷|超短篇|恋爱|集英社",
  69358: "ED|日笠陽子|進撃の巨人|进击的巨人|2013|anime|single|动画|日笠阳子|根岸貴幸|动漫主题曲",
  118165: "搞笑|漫画|井上堅二|颜艺|吉岡公威|裸体|智障|潜水|講談社|恋爱|2014",
  168457: "STEAM|国产|推理|AVG|PC|6~7分|致意|国产单机|2017|Mac|Galgame",
  182057: "百合|漫画|漫画系列",
  210505: "漫画|搞笑|校园|少年漫|西修|週刊少年チャンピオン|周刊少年Champion|2017|日常|热血|治愈",
  214685: "漫画|恋爱|甜|和武はざの|萌|狗粮|日常|講談社|2017|奇幻|少女漫画",
  236467: "マンガ",
  236926: "漫画|恋爱|畑健二郎|狗粮|日常|2018|总之就是非常羡慕|周刊少年sunday|爱情|恋爱漫画|总之就是非常酸",
  238887: "漫画|芥見下々|集英社|热血|战斗|少年JUMP|2018|少年漫画|JUMP|週刊少年ジャンプ|芥見下",
  241855: "青年漫画|已完结",
  242942: "漫画",
  254885: "漫画|治愈|萝莉|搞笑|黑道|2018|养女儿|つきや|日本|少女漫|连载中",
  262151: "漫画|真岛浩|上田敦夫|讲谈社|热血|漫画系列|妖精尾巴|講談社|日漫|未完結|2018",
  266652: "PC|推理|中国",
  268279: "藤本タツキ|漫画|战斗|邪道|热血|周刊少年JUMP|集英社|自由人|少年JUMP|2018|藤本树",
  272951: "异世界|漫画|转生|轻改|小说改|战斗|皇ハマオ|开挂无敌|漫画系列|轻小说改|2019",
  273292: "少女漫|漫画|小说改|漫画系列|少女漫画|一迅社|喜久田ゆい",
  277134: "漫画|恐怖|猎奇|战斗|萝莉|近藤憲一|病娇|2019|惊悚|灵异|对战",
  277772: "轻小说|古宮九時|小说系列|已完结|全4卷",
  279871: "百合|漫画|魔法少女|卖肉|搞笑|SM|战斗|恶堕|小野中彰大|2019|反英雄",
  286397: "恋爱|职场|漫画|狗粮|漫画系列|一般向",
  288048: "漫画|异世界|穿越|轻改|复仇|冒险|鵜吉しょう|2019|小说改|龙傲天|漫画系列",
  289325: "漫画|战斗|搞笑|恋爱|周刊少年JUMP|幼驯染|集英社|2019|権平ひつじ|漫画系列|连载中",
  292902: "轻小说|裕夢|青春|校园|校园恋爱|弹珠汽水瓶里的千岁同学|恋爱|ガガガ文庫|2019|raemz|小说系列",
  296457: "漫画|性转|异世界|恋爱|搞笑|冒险|2019|穿越|池澤真|津留崎優|小学館",
  303246: "小说改|恋爱|少女|少女漫|轻小说改|漫画系列",
  303347: "小说系列|成长|夜宵草|ReLIFE",
  307607: "漫画|异世界|左藤真通|网游|搞笑|奇幻|游戏|战斗|2020|bug|連載中",
  311289: "漫画|网游|轻小说改|战斗|冒险|週刊少年マガジン|2020|不二涼介|热血|奇幻|爽片",
  311456: "漫画|伪娘|日常|恋爱|全彩|狗粮|にいち|2018|マンガ|2020年|画风",
  312483: "漫画|历史|漫画系列",
  317612: "漫画|漫画系列|战斗|热血|黑暗|未完結|圣杯战争|日漫|Coamix|2021|其他",
  320214: "漫画|异世界|轻改|小说改|2020|网游|策略|穿越|战斗|奇幻|搞笑",
  326724: "恋爱|漫画|校园|喜剧|久世蘭|搞笑|逆推|日常|講談社|杀必死|2021",
  327060: "轻小说|恋爱|青梅竹马|狗粮|纯爱|小说系列|桃子|小说|笨蛋情侣|未知后续|青梅",
  328458: "漫画|BL|奇幻|BL漫画|漫画系列|喜剧|BLコミック|腐|耽美|R18|2021",
  347240: "漫画|龙傲天|战斗|异世界|奇幻|不要动脑！",
  349842: "漫画系列|小说改|漫画|奇幻|异世界|2021.",
  351918: "Falcom|伊苏|SAV|2021",
  354986: "漫画|藤本タツキ|短篇集|藤本树|奇幻|2021|短篇|集英社|日漫|青年|搞笑",
  355057: "小说改|奇幻|講談社|少女漫画|系列|漫画|少女漫|星彼方|2021|连载中|漫画系列",
  375145: "漫画|BL|BL漫画|BLコミック|志木見ビビ",
  375683: "漫画系列",
  377765: "卖肉|漫画|伪限制|搞笑|あおむし|搾精研究所|单行本|前篇|系列|日本|重口",
  402045: "全年龄|STEAM|百合|Galgame|PC|游戏|2022|池田大輝",
  405395: "川原砾|轻小说|小说系列|日常|日本|堀口悠紀子|2022",
  406468: "漫画|搞笑|恋爱|2022|战斗|集英社|千葉侑生|连载中|漫画系列|少女漫画",
  422014: "轻小说|恋爱|榛名丼|奇幻|校园|2023|迷惘|人心|复制人",
  423295: "洛天依|泛Vocaloid",
  429824: "同人|Galgame|STEAM|AVG|视觉小说|PC|奇幻|ADV|冰岛|短篇|游戏",
  432940: "漫画|川原砾|刀剑神域",
  462533: "漫画|恋爱|战斗|杀手|2024|連載中|黑暗|漫画系列|8分|黑道|可爱",
  466653: "",
  469394: "PC|PS5|XSX|CC2|白金|ACT|游戏|龙珠|STEAM|童年|经典",
  486165: "Galgame|kazuki|2024|全年龄|亲情|游戏|PC|穿越|视觉小说",
  487470: "",
  509336: "",
  512789: "Galgame|小说改|2024|ADV|性转|PC|VA|腾讯游戏|Visual|游戏|Arts"
};
